{"posts":[{"title":"HELLTAKER评测","text":"游戏主要内容《HELLTAKER》，中文译名《地狱把妹王》。 玩家扮演主角，下地狱寻找天使，但是因为种种机缘巧合，","link":"/articles/HELLTAKER-Review/"},{"title":"Hexo 博客与你","text":"前言如果你还在忍受诸如新浪微博、腾讯微博等博客网站的臃肿，那你马上该读一读这篇文章了。 拥有一个你自己的博客网站，你可以： 记录日常生活⏰ 写写学习笔记📋 跟其他博客创作者们探讨写作🖊 发电⚡ 至于为什么写博客，上知乎搜一搜就有很多答案。我的语文老师说过一段话，我觉得很适合回答这个问题： 作文博客是孩子们的一种创造，是一种优秀的表现，古人曾经靠的是一篇文章走遍天下。而如今，能写得一手好文章，也会受益终生。谢谢。 那不多废话，往下读开始你的博客生涯吧。 准备工作在开始之前，你应该： 有一台能访问互联网的，能正常工作的电脑。 会使用搜索引擎。知道常用计算机术语并至少有初中的英语水平。 会基础的文件操作。如复制、粘贴、下载和上传。 有一个能正常使用的电子邮箱。如 QQ 邮箱。 另外，我非常建议使用加速器和 VPN。因为 GitHub 在中国没有服务器，使用 VPN 能让你快速访问网站。 搭建环境务必按照顺序来安装！ Ⅰ 下载 git从 git 官网下载对应的安装包： 安装好后在桌面 右键 → Open Git Bash here输入 git --version 查看，这样显示就算安装成功了： 打开你下载 git 的目录，右键 git-bash.exe 选择[属性]并如下选择： Ⅱ 下载 Node.js从 Node.js 官网下载对应的安装包： 在 Git Bash 中输入 node -v，不报错即可。 环境配置参考这里。 Ⅲ 安装 Hexo在 Git Bash 中输入 npm config set registry https://registry.npm.taobao.org（这一步换下载源，是为了后面下载不报错）。输入npm install -g hexo，等待完成后，输入hexo -v。 继续输入 npm install --save hexo-deployer-git安装依赖。 到这里，全部环境就搭建好了，下面是正式的搭建博客环节。 使用 git 生成 SSH key如果你的用户名称中含有中文，这一步不建议在 Git Bash 中操作。Windows自带搜索框搜索cmd，右键→以管理员身份运行是更好的选择。 如果你到现在都没有自己的 GitHub 账户，就现在去注册一个并设置好用户名。 在 Git Bash 或 cmd 中输入ssh-keygen -t rsa -C &quot;填你注册 GitHub 的邮件地址&quot;，按三次回车后，会像这样： 然后输入clip &lt; ~/.ssh/id_rsa.pub，将刚刚生成的 SSH 密钥复制到剪贴板。如果是 cmd，就把~/.ssh/id_rsa.pub改成 id_rsa.pub 的绝对路径。 接着打开github主页，点击个人设置，点击左侧的SSH and GPG keys，点击New SSH key。 将你的剪贴板里的东西复制进去，Title随意取： 输入ssh -T git@github.com测试，接着输入yes，不报错即可。接着设置你的个人信息： git config --global user.name &quot;karlbaey101&quot; #你的github用户名 git config --global user.email &quot;xxx@example.com&quot; #填写你的github注册邮箱 搭建博客新建博客开始之前先介绍一下 Hexo 的基本命令 hexo new &quot;postName&quot; #新建文章 hexo new page &quot;pageName&quot; #新建页面 hexo generate #生成静态页面至public目录 hexo server #开启预览访问端口（默认端口4000，'ctrl + c'关闭server） hexo deploy #部署到GitHub hexo help # 查看帮助 hexo version #查看Hexo的版本 对应的缩写，比如： hexo n == hexo new hexo g == hexo generate hexo d == hexo deploy hexo s == hexo server 新建一个保存博客的存放目录，必须是空文件夹。比如卡尔白的是：E:\\Karlblogs 在你的存放目录右键→ Open Git Bash here，输入命令hexo init 查看你的存放目录，里面应该出现了这些： 生成静态网页并预览:hexo g &amp;&amp; hexo s浏览器输入http://localhost:4000 报错解决：问题：hexo g报错,line.mathALL is not function问题解决原因：nodejs版本低于12解决：两种方法方法1）请将nodejs升级到高于12.0.0的版本方法2）config.xml中的 highlight-&gt;enable的值从true更改为false，这样可以避免异常。 访问没问题了，接下来部署到 GitHub。 部署到github注意： 此处需要一个新仓库（Repository），仓库名称格式：用户名.github.io。比如卡尔白的就是：karlbaey101.github.io。 编辑_config.yml，_config.yml在博客存放目录下： _config.yml1234deploy: type: git repository: git@github.com: branch: main repository仓库地址改为自己的。branch 看自己的 GitHub 仓库是 master 还是 main，卡尔白这里是 main，所以就填写 main。 发布到 GitHub，命令：hexo d。在浏览器访问：https://karlbaey101.github.io/ 不出意外即可成功访问。 这个博客地址已经是部署到了公网，感兴趣的读者也可以访问。 编写博客搭建好博客之后，日常中肯定是需要编写博客并且同步到 GitHub。卡尔白来带大家写一篇博客。 新建一篇名为Karl-first-blog的博客：hexo n &quot;Karl-first-blog&quot; 查看对应的文件夹： 可以看到生成了一个Karl-first-blog.md文件，通过这个md文件去写博客 默认的内容是这样的： Karl-first-blog.md123456---title: Karl-first-blogdate: 2025-02-10 23:47:31tags:---这里开始编写正文（markdown格式） 使用 markdown 格式编写好后，在博客存放目录右键→ Open Git Bash here，输入hexo g &amp;&amp; hexo d，你的博客就被部署到网站上了。访问网站就能看到。 结语到这里，你就应该会写博客和部署博客了，（如果有）下一期就告诉诸位怎么导入模板和网站操作。 完结撒花！🎇🎇🎇","link":"/articles/Hexo-blog-and-you/"},{"title":"Markdown编辑器推荐","text":"前言今天卡尔白离开学校的时候看到了一张很有意思的海报，当然，也相当高血压： 这张海报的四级标题、粗体字和表格都没有正确地渲染。可以看出制作者对 Markdown 如何正确使用知之甚少了。 下面就推两个我正使用的 Markdown 编辑器吧。 推荐TyporaTypora 是老牌 Markdown 编辑器了。它最突出的特点就是极度的简洁，让人可以专注于内容的创作上。不过虽然简洁，它内在的功能也是样样不少，就比如论文常用的 \\(\\LaTeX\\)（MathJax），Typora 也是原生支持。Typora 的界面是长这样的： 同时 Typora 提供了非常丰富的快捷键，比如下面这些： 官网下载速度实在太慢，卡尔白这里提供一个下载源。按我下载⬇️ 以后又可以水一篇 Typora 了，嘿嘿。 Microsoft Visual Studio CodeVSCode 也是耳熟能详了，直接贴上官网地址⤴️。VSCode 强大之处在于它不局限在 Markdown 本身，而是发挥出多语言写作的优势。举个例子：Markdown 与写博客非常常用的 JavaScript 可以在同一个窗口内共同运行，而不需要多开窗口。此外，借助 VSCode 里无数方便的插件，Markdown 也能做到支持 \\(\\LaTeX\\)（KaTeX）。虽然相较 Typora，VSCode 缺少了简洁，但是它非常适应程序员的需要。 如果使用 VSCode，我十分推荐安装这几个插件： 结语没想到为了一个错误渲染 Markdown 我还专门水写了一大段文字。保证每周更新的进度又向前迈了一步，好耶！这个过程里也学会了怎么把 GitHub Pages 链接到下载页，至少没有蠢到把 GitHub 当网盘使。","link":"/articles/Markdown-editors-recommend/"},{"title":"Markdown 语法速查","text":"Markdown 语法速查表，在编写博客时很有用。提供pdf格式下载。 目录 H1 标题 H2 标题 H3 标题 H4 标题 H5 标题 H6 标题 文本格式 列表 无序列表 有序列表 链接 图片 代码 行内代码 代码块 表格 引用 分割线 任务列表 转义字符 标题123456# H1 标题## H2 标题### H3 标题#### H4 标题##### H5 标题###### H6 标题 H1 标题H2 标题H3 标题H4 标题H5 标题H6 标题文本格式12345*斜体文本* 或 _斜体文本_**粗体文本** 或 __粗体文本__***粗斜体*** 或 ___粗斜体___~~删除线文本~~行内`代码`效果 斜体文本 或 斜体文本粗体文本 或 粗体文本粗斜体 或 粗斜体删除线文本行内代码效果 列表无序列表12345- 项目1 - 子项目1 - 子项目2* 项目2+ 项目3 项目1 子项目1 子项目2 项目2 项目3 有序列表1231. 第一项2. 第二项3. 第三项 第一项 第二项 第三项 链接123[显示文本](https://www.example.com) [锚点链接](#标题名称) &lt;https://www.example.com&gt; 显示文本锚点链接https://www.example.com 图片1234![替代文字](图片地址 &quot;ExampleText&quot;) ![图标](https://example.com/logo.png &quot;ExampleText&quot;) 带尺寸控制： &lt;img src=&quot;图片地址&quot; width=&quot;200&quot; /&gt; 代码行内代码1使用 `print()` 函数输出内容 使用 print() 函数输出内容 代码块123‎``‎`pythonprint(&quot;Hello World!&quot;) `‎`` 1print(&quot;Hello World!&quot;) 表格1234| 左对齐 | 居中对齐 | 右对齐 || :----- | :------: | -----: || 数据1 | 数据2 | 数据3 || 数据4 | 数据5 | 数据6 | 左对齐 居中对齐 右对齐 数据1 数据2 数据3 数据4 数据5 数据6 引用123&gt; 这是引用内容 &gt; 多行引用 &gt; &gt; 嵌套引用 这是引用内容多行引用 嵌套引用 分割线123---***___ 任务列表12- [x] 已完成任务- [ ] 未完成任务 已完成任务 未完成任务 转义字符1234\\* 星号 \\# 井号 \\( 括号 \\! 感叹号 * 星号# 井号( 括号! 感叹号","link":"/articles/Markdown-grammar-quick-reference/"},{"title":"RSS 入门教程","text":"开始 ——RSS 简介RSS 是什么呢？ RSS（英文全称：RDF Site Summary 或 Really Simple Syndication[2]，中文译作简易资讯聚合[3]，也称聚合内容[4]，是一种消息来源格式规范，用以聚合多个网站更新的内容并自动通知网站订阅者。使用 RSS 后，网站订阅者无需手动查看网站是否有新的内容，同时 RSS 能将多个网站的更新整合并以摘要形式呈现，有助于订阅者快速获取重要信息，并选择性点击查看。 ——来自：维基百科-RSS 消息来源[1]（英语：web feed、news feed、syndicated feed又译为源料[2]、馈送[3]、资讯提供[4]、供稿[5]、摘要、源[6]、新闻订阅、网源[7]）是一种资料格式，网站可透过它将最新资讯传播给用户，用户能够订阅网站的先决条件是网站可提供持续更新的资讯。消息来源受到网志及新闻网站的广泛采用，因为此类型的网站经常更新内容。如前所述，feed的译名很多，莫衷一是，至2008年底为止，还没有一个十分通用而备受认可的中文译名。将feed汇流于一处称为聚合（aggregation），而用于聚合的软体称为聚合器（aggregator）。对终端使用者而言，聚合器是专门用来订阅网站的软体，一般亦称为RSS阅读器、feed 阅读器、新闻阅读器等。 ——来自：维基百科-消息来源 那我们就知道了，RSS 本质就是一种推送机制，只不过这种机制完全把握在用户的手中，这样就避免了对算法的依赖。用户通过设置自己的 RSS 订阅源，就能阅读自己真正感兴趣的内容。 不过这对内容创作者来说相当不友好，因为 RSS 是一种“无流量访问”，创作者的流量相当于凭空消失。所以，现在 RSS 声势渐微，最主要的原因还是流量至上的时代，再其次就是 RSS 相对复杂的操作了。这也难怪，打破茧房总是要付出些代价的，不过是值得的。 事实上，一些 RSS 阅读器完全可以通过数据中转（提供 feed -&gt; 阅读器服务提供商的服务器 -&gt; 用户）使得本来被网络审查（也就是俗称的“墙”）的内容不通过搭载 VPN 等方式直接抵达用户手中。而常见的被墙的网站（例如 X、Facebook和维基百科）是提供 RSS 订阅的，因此，市面上常见的 RSS 阅读器大部分都已经被墙。这也是网络审查的一部分。 至今被墙的 Web 端 RSS 阅读器有：Feedly（2018.11）、Inoreader（2020.4）、RssHub 官方域名（2020.3），Reeder（2020.9，仅限 iOS）。 下面就以本站的 RSS 订阅源为例，简要介绍怎么订阅。 获取 feed如果网站里有这个图案： ，就说明网站本身是提供 feed 的。点击这个图案，看看浏览器地址框，如果是以atom.xml结尾的话，那么这条网址就是这个网站的 feed；或者阅读页面中的介绍，通常都会在醒目处写出 feed 的地址。只要这个网站不被墙，你就可以在阅读器中使用它。 没有主动提供 feed 呢？那你可以尝试在 RSSHub 寻找，这里有很详细的使用方法。 使用 feed通常来说，如果网站本身有 feed，那它通常是 example.com/atom.xml 这样的格式，只要把这个链接放在阅读器里即可。 我们以 Fluent Reader PC 版为例： 现在我们拿到了 Karlblogs 的 feed，也就是 karlbaey.top/atom.xml。现在需要下载一个 Fluent Reader，下载好后，打开并选择右上角的齿轮图案。官网链接→ 把拿到的 feed 粘贴到输入框中，Fluent Reader 就会自动将读取到的文章显示在首页了。 但是，一些网站的正式 feed 是托管在 Google Feedburner 上的，无法在中国大陆访问，比如说我的正式 feed。这种格式的 feed 如果按照上文的方法在 Fluent Reader 中使用，会提示 Error 403（禁止访问），因此需要在外国提供的服务器上解码才能正常访问，比如说 Inoreader，前文也提到，它们中的大多数已经被墙，想要用这种 feed 只能自建 RSS 服务。因为成本相对高就不在这里说明部署方法。 有没有只通过收电子邮件就能获得更新的方法呢？当然有的。 follow 订阅这是官网，目前本站也正在使用 follow 订阅，如果是 PC 端就看网页的左栏，有这样的一张图片： 目前本站采用的 icarus amazing 模板内置了有关 follow 订阅的模块，所以是已经配置好 follow 订阅了，在这里输入你的邮箱并且在邮箱中查收并确认邮件就能订阅更新了。其实到现在都没有人订阅。 有一个和 follow 订阅功能类似的网站，也就是 FeedBlitz，不过因为需要付费我并没有选用。 结语其实 RSS 这档子事本来也就是早期互联网不仅网速慢而且上网也不方便，Netscape 适应环境而开发出来的一个小玩意，放在今天的互联网已经小巧到可以归类到 Gadgets 那一级别。它的没落是必然的，复兴也是必然的。 大数据的出现带动了算法、信息茧房等等诸多让人不适却又不得不沉浸其中的概念，一个普通人实在是很难抵挡这一切。就比如说微信公众号，虽然它本来也是像 RSS 一样，为了让每一个互联网用户都能看到自己真正感兴趣的东西。但是时代在发展，公众号也渐渐偏离了初衷，成了分析用户的工具。我们甚至可以试想，这些分析得到的数据会被拿去培养更精密的 AI，算法越来越完备，茧房越来越难逃脱，恶性循环早就已不可知的形式在整座互联网大厦里运行了起来。人真的只成了互联网运行的齿轮，成了冷冰冰的数据，而不是建设它的一份子。 RSS 摆在那里，就好像前朝的宝物重新焕发光彩，因此它必然复兴，当初只有新闻作用的它如今竟然成了生产力工具。或许 RSS 要给我们思考的，就是如何在信息的洪流下找到自己真正在意的东西。 当然，也包括不要忘了自己的初心。 没想到一个小小的 RSS 也能让我写出这么些东西，可能我真的被算法预测太久太久了。 (The end)","link":"/articles/RSS-tutorial-for-Karlblogs/"},{"title":"不会再有的地方&#x2F;&#x2F;Lieu Évanoui","text":"他们回首望去，眼中满含泪水，//看到东方那乐园的大门紧闭，//火焰的剑在他们面前挥舞，//无情地阻挡了他们的归路。//他们只得转身，面对荒凉的世界，//步履沉重，心中充满无尽的悲伤。——约翰·弥尔顿《失乐园·卷拾贰·陆肆壹~陆肆陆行》 分班了。就这么确确实实，明明白白地分班了。与此同时宿舍也大换血，恐怕我今后是很难再见到能陪我聊到凌晨两点的人了。 写点东西吧，算是纪念那段回不来的日子。 当卡尔离开的那一刻，他不会知道，在将来的某个星期三晚上他不会想起曾在那逼仄的阳台看到的星光，也不会想起曾经挤在一个人口密度一千二百万人每平方千米的地方嘻嘻哈哈。因为那是以前的事情，现在不会有，以后也不会有。 但卡尔没有忘掉当他看着空荡荡的 404，心里的寂寞和失落——事实上，这失望会裹挟着人的心。当夜深人静时，它会从没有人看到的地方迸发出来，就像路西法从天坠落。 阳光穿透这里的空气，微风能拂过这里每个人的脸颊，月亮还是散发着它数十亿年始终如一的光芒。但那是以前的事了。未来的事情太遥远，从现在来看未免有杞人忧天之嫌。 不过，卡尔还是妥协了——也是没办法的事。所以他踏入门，看着这个给过他很多欢乐的地方。现在恰是暮春，太阳不大猛，刚刚好能给室内的一切蒙上层时间的尘埃，于是风顺着阳台卷入，卷走了卡尔最后一丝希望。该走了。 背对着阳台，卡尔呼吸急促。他清楚只要他离开这个房间，以后就很难再有回来的机会了。这间宿舍里即将搬进来的人他一个也不认识，更没有兴趣培养新的关系，大概是高中生的并发症。卡尔抱着最后的一点信念，回头看了一眼：跟他刚来时一模一样，床架整齐地摆在两侧，阳台正对着出口，不时有几股清风从中穿过，划过卡尔的脸颊——这风太温柔，让眼泪几乎要从他的眼眶落下来。该走了。 卡尔在关上门之后没有再回头，他害怕自己控制不住自己。该走了。 注：标题双斜线后是法文。","link":"/articles/Lieu-Evanoui/"},{"title":"修复成功MVP结算","text":"卡尔白在搭建好博客之后，觉得 Hexo 提供的模板不合乎自己口味，就在 GitHub 找了个喜欢的模板。经历了九九八十一难终于把参数调对了，就在准备发布的时候，意外发生了： 突然之间，页面消失不见，所有的条目都不能访问。他对着机箱发怒了一刻钟，毫无效果后只能老老实实翻配置文件。这是修改前的代码块： _config.icarus.yml123456789101112131415# Alipay donate button configurations - # type: alipay # Alipay qrcode image URL # qrcode: '' # &quot;Buy me a coffee&quot; donate button configurations - # type: buymeacoffee # URL to the &quot;Buy me a coffee&quot; page # url: '' # Patreon donate button configurations - #type: patreon # URL to the Patreon page #url: '' 问题很明显了，其中的分隔符 - 没有被注释，但我还是排查了好久才发现原因QwQ。所以只要把这些 - 前加上 # 就解决问题了。 要是不这样的话，整个网站都会消失，该死的 yaml…… 最后附上一张图，这是我修复成功的结算画面：","link":"/articles/repair-success/"},{"title":"十年边缘&#x2F;&#x2F;The Edge of a Decade","text":"观前提醒： 这是以前的故事。本文含有较为直白的性描写，不适合 13 岁以下人士观看。 任何意见请在评论区或真理博客版反馈。 Section 1在弗莱明刚认识卡尔白的时候，他还只是个三位数加减法都不会的小男孩，而卡尔自己也只有单马尾一种发型，直到现在也鲜少改变。弗莱明还记得卡尔搬来的那天：他坐在家门口，看着一个一个蓝衣蓝帽的搬运工将一个又一个大纸箱移动进对门，弗莱明甚至记得那天一共有十六个箱子在视野里出现。正当他看得出神，忽然间一种奇异的感觉顺着他的脖颈攀上大脑皮层。转过头，一个比弗莱明高出一个头的女孩子正俯视着他。弗莱明此生都不会忘记她拥有的可可色长发。 弗莱明不自觉地深呼吸了一下，尽管这对一个初中都没上的男孩来说显得太刻意了。最终还是卡尔白先示好：“你就住对门？那太好了！这可比我之前对门那个阴暗的怪老头好多了……”尽管内容全无营养，少女天生的温柔微笑依然像春风拂过弗莱明的脸颊，他觉得自己的脸红得要滴下血来。他忘了自己那天是怎么支撑着完成对话的，只不过每次想起这段经历，他先是感到让人抓狂又无奈的尴尬，后面却转化成片刻的温柔。 月亮顺着卧室的窗户越爬越高，恍惚间如水的月色就洒满弗莱明的房间，但他躺在床上蜷成一团，脑中充满了混沌。“我连她名字是什么都不知道……”想到这里，弗莱明顿时灰暗下来：第一次被女生搭话就连语言功能都扔掉了，不争气啊不争气…… 心里事情多，弗莱明想着想着就睡着了。太阳照常升起，又是一个星期二。弗莱明不喜欢学校，他曾有次因为说错一句话，而被班里的异性们孤立许久，于是本来正常的与人相处在他眼中却成了难如登天的事。有这样的背景，弗莱明想喜欢学校都难。可旷课的后果更惨痛，权衡再三，还是艰难起身，去了学校。 “好困啊……”弗莱明的脑中只剩下这句在空荡地回响。他太累了，以至于他刚落座就扑通一声摔桌面上睡着了。等到他醒来，第一节课才刚要开始——是后桌的人用笔戳醒了他。弗莱明回过头去，话又被眼前所见生生梗回去了，他又开始脸红。 “啊，嗯，我们是不是在哪见过……”弗莱明不自觉地吐出句废话，反倒是少女感觉到弗莱明的窘迫，结巴地回复：“啊——我是不是不该吵醒你……但是要上课了，还是不要睡觉的好，”少女顿了顿，将慌张掩盖住，“我叫卡尔白，叫我卡尔就好。你是弗莱明是吧，我们昨天见过了。”话毕，卡尔眨着眼睛等着回应。弗莱甚至能数清她有几根睫毛，但他不敢去数。 “卡尔啊，好名字，跟导师一模一样。”弗莱全然不顾是否存在女生对阶级斗争感兴趣，就把马克思的名部分跟眼前可可色头发的女孩结合起来了。 他们没注意到的是，老师已经站在讲台上，面有愠色地瞧着可以判作“交往过密”的一男一女。还是弗莱的同桌咳嗽一声，才把数睫毛数到出神的少年弄回过神来。课程无聊透顶，弗莱实在不知道怎么会有人蠢到往游泳池一边装水一边放水。他就和同桌搭话，但同桌第一句话让弗莱几乎沉默。 “你后桌那女生新来的吧？长得确实不错啊，个子还高。”说着，同桌把手背朝上，在两人间挥来挥去，“你说你怎么这么好运，这样的女生第一个认识你。” 同桌不提还好，现在他一提，弗莱心里涌出一股无助感。他清楚女生培养关系的速度连病毒自我复制都望尘莫及，要是卡尔知道了他被排挤，一定会从众而排挤他的，毕竟不会有人为了他愿意舍弃什么。弗莱的脸上看不出情绪的变化，因为他已经被这样的无助感折磨大久了，多来一点也不碍事。 时间在弗莱浑浑噩噩的大脑里飞得比子弹还快，此时的弗莱已经走在了放学路上。忽然一只手“啪”的一下搭上他肩头，用力程度之大让他打了个趔趄。 “一个男生身体弱成这样也太不应该了吧，你应该抓住我的手把我拉到前面才对。”只听声音就知道了，弗莱根本不需要回头。他今天已经无数次听到卡尔充满活力的声音了。新来的总是使人新鲜，更何现卡尔接近 180 厘米的个头和甜美的长相本来就受人欢迎。弗莱的血液瞬间降温，他感觉有点晕厥，但还是试探性地问：“今天过得开心吗？” “当然了！本来以为刚来这里会很难适应，没想到大家都这么好相处。”卡尔转到弗莱的面前，双手搭上他肩膀不让他乱动——其实不这么做弗莱也不会动，因为他紧张到忘记路怎么走了。他只好含糊应下两声。 卡尔将手拿下，和弗莱并排走。弗莱踌躇了一阵，才开口：“你有没有听到什么关于我的事情？”卡尔抬头看天，看了一阵才重新和弗莱对上视线：“有啊有啊，女生们说你脑子有点问题……” 弗莱觉得太阳熄灭了。“……但是我想啊，昨天第一次遇见你你连大气都不敢出一口，真的不像她们口中那种穷凶极恶之徒，我猜是以前你被女生搭话说了什么不该说的话被人讨厌了吧……”卡尔越往下说，弗莱的脸色便愈加铁青。直到最后他的脸快凝成一块钢板，卡尔才觉得不对劲，止住了话头。 “……我说错了吗？看你脸色好差……” 事实上，弗莱自己都没意识到自己脸色的变化，他觉得心里愈合已久的一块创口被无情地撕开了，尽管在这之前他认为自己无所畏惧。原来真正被人理解是这样痛的一件事，弗莱两手颤抖。他顿时有种流泪的冲动，但他不能流，旁边还有女生在，只好略微抬头让已经发红的眼眶在夕阳的光芒下不至于太明显。 卡尔伸手摸了摸弗莱的头顶，后者急忙躲开了。两人接下来一路上都没再开口。沉默在暮色里浮动，夕阳拉出两个人影，一长一短，来回晃荡。就像弗莱明慌乱的内心。 以后的日子倒是平静得不寻常。没有女生来调侃弗莱，他过了段着实难忘的清静日子——对他来说，独处已经是极大的奢侈了。慢慢学校也不再是什么可憎的东西。卡尔每天都与弗莱聊天，只此一点就让小男孩重拾信心了。 Section 2弗莱终于迎来了小学毕业，再到初中毕业。高中入学考试前一夜弗莱主动给卡尔白打了电话。他觉得心里空落落的，一点自信也没有，急需一个人来平复弗莱躁动的内心，跟父母来两句又太尴尬。思来想去，对门的妹子倒是最合适的选择。令他意外的是，电话一通，对面就传来卡尔兴奋异常的声音，有点像百灵鸟。 “嘿嘿，我就知道你会来电话，等你好久了。” 卡尔“扑”地一下坐起身，少女已经发育起的躯体被白色睡衣和夜色温柔衬托得像天使。弗莱应该庆幸没看见这场面，否则光流鼻血就足以使他晕厥。 “啊，好……我现在睡不着，想和你说说话。” “正合我意。”卡尔“扑”地一下躺回床上，弹簧发出嘎吱声。 “嗯，你也知道，我从出生到现在，一直没做过什么惊天动地的事来证明自己。现在机会来了，我不想白白浪费它。或者说，我不想再被人讨厌了，虽然只是一次考试，但是我觉得只要比其他人优秀，就能获得尊敬了。话又说回来，我要是失败了，肯定会受到更多嘲笑的……” 对面沉默了一阵，像是深思熟虑才选择开口。 “怎么感觉你压力很大的样子。”卡尔白的声音突然低沉下来，像修女指引迷途的羔羊，“可是你也没怎么被人讨厌啊，到少我挺喜欢你的 别误会！不是你想的那样！我是说，你一定比你自己想的受欢迎，一定是这样的。无论如何，弗莱明，你一定要挺直腰杆走路啊，活在阳光下一定比浑浑噩噩地生活好一百倍！” 弗莱已经是不知第几次听到别人劝诫他不要浑浑噩噩，但是他没有一次是听进去的；他一没有出众的外表，二没有足以吸引人的身材，三没有掏得出手的才能。极端点说，他已经忘记了做人的意义。弗莱的呼吸异常规律，胸脯一起一伏就像海水潮汐，他心里的浪潮也快把他淹没——他感到自卑时总是这样。 “怎么不说话？睡着了？” “没有…..突然觉得很难受而已。以前从没人跟我说过这些。”弗莱将脸对着枕头，这样说话不会让卡尔听见他话里的哭腔。 “没关系啦，不会很难的，只是需要你一点点勇气罢了。”卡尔蜷在床中央，像哄小朋友般，轻声同弗莱明说，“你真的是个很好的人啊……” “哪里好了？”弗莱警觉地反问。 “就是，怎么说呢，曾经还读小学，我们两个被分到同一个植物小组。你忘记了么？就是班主任不知哪搞来的盆栽轮流让人管理。但是班里的人新鲜感一过，马上就把盆栽的事抛在脑后了。只有你还在每天都去看看它们，时不时来点水。多亏了你，当时班里才不至于一点生机都没有。” “哦……”弗莱想起来了。但他并不是因为责任感才去照料植物的，实在是因为找不到与人搭话的由头才会去和植物说话的。弗莱本身不相信书里写的“万物有灵”，可照料植物愈久，他愈觉得万物确实有灵。他的话里充满快乐，植物就绿意盎然；不然就和霜打的茄子一样。弗莱也未想过，他做的一切被电话那头的女生尽收眼底，他有种感觉——卡尔白是来拯救他弗莱明的天使。 “是吧是吧，我就说有！”电话那头显得非常雀跃，“我看到你名字，就开始想：弗莱明（Flaming），就是会像火焰（flame n.）一样温暖别人呀。” “不至于不至于，别把脑子烧坏就成。” 电话里你一言我一语，时钟上的指针也一圈圈跟着走。弗莱明打起哈欠，打开手机时钟才发现已经过零点了。 “困了？给你唱首摇篮曲吧，祝你好梦~”卡尔也不管什么了，开口唱起来。 “睡吧，睡吧，我亲爱的宝贝……🎶” 弗莱的脸顿时绯红，再平静下来。卡尔的声音不算多么登峰造极，但也可称作是动听了，就像是弗莱把卡尔开的演唱会包下来一样。不多时，弗莱就沉入了梦乡。 Section 3卡尔感觉到对面传来呼噜声，就把电话挂上，合上了眼睛。因为是夏天，卡尔只用被子盖住腹部，随意地躺着便入梦了。一双超过 42 英寸的腿被睡衣覆住一半，露出来的部分比婴儿的皮肤更光滑细腻。卡尔也常常因此被初中班上的男生们指摘，对着她流过口水的男孩们都能组一个排了。 沉浸在梦中的弗莱就没那么好运了，现实中的他正全身躁热，想动却动不了。因为在他的梦境里卡尔白把他压得紧紧的，弗莱自然动弹不得。与此同时，卡尔的手在他身上乱摸，然后终于是摸到了预料中的地方，卡尔揪住不松手。正当弗莱想叫出声时，卡尔亲了他一口，还把舌头往咽部里面伸。弗莱的心里充满了罪恶感，但肉体上的刺激使他无法自拔。 似乎是知道弗莱不会再叫出声，卡尔坐起身，这时弗莱才注意到骑在他身上的女孩只穿着内衣。可是这个子也太高了，弗莱胡思乱想。卡尔的重量刚刚好，介乎他没感觉和疼痛之间。换言之，他现在太舒服了。卡尔用她滑溜溜的大腿内侧夹紧，弗莱这回是真的叫出声了，现实中停在他窗外的两只小鸟被他的叫声吓得扑腾扑腾飞走了。 弗莱的右手不自觉地掐住卡尔的屁股，还在上面轻拍一下，清脆的拍打声顿时充满整个房间。卡尔娇喘一声，脸上忽然出现一种得逞般的邪笑。她把弗莱拉起来，两人此时的身体贴在一起。虽然是梦，感觉却无比真实，甚至卡尔温暖的小腹还在源源不绝地传递温度给他，卡尔的脸突然变红，在弗莱耳边轻声说：“变态~”,弗莱起了一身鸡皮疙瘩。 他低头，才发现卡尔大腿内侧流动着粘液一样的东西，这让弗莱好不容易消散的罪恶感又涌出来，他不知所措，只好抱紧卡尔以示自己不会推托。只在外面蹭蹭就如此手足无措，弗莱不知道自己是太没用还是因为坐在自己身上的是卡尔白了。 弗莱惊醒，太阳还在地平线以外沉睡。他感觉内裤湿嗒嗒，用手去摸却并不像水。这时他才知道梦里的时事情不全是假的。他回忆起卡尔淡粉色的内衣，脸不知不觉又红了。 无论如何，裤子还是要换。弗莱坐在床边，回忆起梦里的各种细节。卡尔在他印象中绝对不是如此好色的人，这种反差着实让人难以接受。卡尔现在还睡得正香吧，弗莱一边幻想一边苦笑。确实，一夜间卡尔在床上转了数圈，被子上每层褶皱都像精心设计过，与她身体的曲线几乎融为一体。她脸上的微笑告诉整个世界少女的梦境如何美好，嘴唇——也是最引人注目的——似乎总是如此红润。让弗莱觉得如此灼目。 过了接近两个小时，天空才泛起鱼肚白，但弗莱明不想继续留在家里，于是他趁父母没醒，溜出了家门。就在他回头关上门的那一刻，一只手戳了戳他的后颈，他吓得”轰”的一声关上房门。刚准备回头输出，就听见一个温柔的声音： “啊——弗莱明，你怎么这么早就出门了？” 听见卡尔的声音，弗莱顿时没了脾气，只好低着头含糊应答：“不想继续在家发呆了，索性早点出门……” “那我们一起走吧。” “嗯……” 太阳还没有完全露脸，所似即使在夏天，气温也没有多么极端。走到阳光下，弗莱才有机会好好审视整个世界。街边树木身上的熟石灰涂层好像永远褪不掉，但树上无数的绿叶告诉人们：冬天过去了，夏天来了。弗莱记得之前看过，春天也是有落叶的，不过那些是新生的叶子，营养不足才会飘落，冬天那才真是万物凋零，看不出一丝生机。弗莱一直认为自己活在寒冬里，掖着仅剩的棉衣撑过无尽冰雪，但他现在拥有一座篝火了。 卡尔掏出一盒 Pocky，撕开包装，先抽出一条塞进弗莱唇间，然后就一条一条把整盒吃光了。弗莱有点出神，叼着 Pocky 也不说话，注意力放在旁边咬饼干的声音。 “不好吃吗？”卡尔问。 “没有，挺不错的。” 弗莱一节一节咬下饼干，一半苦涩裹着另一半甜蜜。还是巧克力味的，弗莱明很喜欢这种味道，就像卡尔给他的印象一样。这时他才有机会欣赏卡尔的样貌。还记得两个刚认识的时候卡尔头发并不长，只扎个马尾辫，前额的头发就有点拮据了；现在留了长发，一直留到肩胛骨往下，这让弗莱想起之前读的《查理与巧克力工厂》中描写的巧克力瀑布，甚至卡尔头发颜色也是一模一样的可可色。 看着卡尔嚼饼干，弗莱注意力又被引到卡尔嘴唇上。他之前一直好奇，卡尔是不是有抹口红的习惯，因为她嘴唇的确比弗莱见过的其他人更红一分。后来才知道不是的，不然也不会无所顾忌地咬饼干。也许是它的原因，卡尔的皮肤白得接近透明，弗莱想戳戳看看是不是和初生儿一样水嫩。 虽然只是看看，弗莱明也非常开心了。他知道曾经有多少人喜欢过卡尔，也知道曾有个不长眼的到处表明爱意，尽管这小子看着连真爱是什么都不知道，大约只是馋卡尔身子。确实啊，卡尔的美浑然天成，连棕黑色的虹膜都像是为了支撑她的美，不过身材不能说像钢板，也就比钢板多点弧度，像久用的砧板。想到这，弗莱憋不住笑出来。 “笑什么？”卡尔发现弗莱一边盯着自己一边发出气球漏气一样的笑声，警觉地问。 “不好笑，我就是觉得很开心。” 弗莱明发现，学校已经出现在视线内了。他真心希望这条路能长一点，再长一点，让他能多看两眼卡尔白。她的腿被短裤衬托得像豆腐，弗莱心里蠢蠢欲动。 不过该来的总是要来，弗莱跟卡尔在学校门口说了再见。他的心忽然感到落寞，毕竟以后可能再也见不到这可可发色的女孩了。 考试倒是乏善可陈，三天的时间一晃眼就过去了，期间卡尔一直没出现，弗莱心里空落落的。当他打开手机，发现今天已经是六月十九日了，再往后数……多少天呢？弗莱有些懊恼，卡尔跟他说过很多次她生日落在哪天，现在他全给忘了。他只好打开聊天框，试探地向卡尔发出： “生日快乐~” 等了三十秒，消息框从手机顶弹出： “我还没过生日呢，你怎么比我还急？” “我忘记了……” “你也真是粗心，我再说一次，是6月26号” 弗莱松了一口气，至少没等到卡尔生日过了才祝生日快乐。 “想送礼物了？这么着急” “突然想起来而已。考试前你好像跟我说过这些” “是啊，我生日那天你要来我家吗？会有很多人来的” “算了吧”按下“发送”，弗莱就不再看手机。并不是他不想去，而是出于一种莫名的恐惧。弗洛伊德说童年经历会影响人的一生，弗莱明深信不疑，他想，自己的恐惧源自童年被疏于照料，在外面受了委屈却没有一个可以倾诉的对象。弗莱也嘲笑自己，说打碎牙往肚里咽不是很正常的事吗？很快又笑不出来了，因为被委屈缠绕的是自己，又是在人最天真的孩提时期。弗莱明害怕有一天卡尔消失，像一股轻烟飞走了，那时候他又变回一个人，索性现在就少点见面。虽然他骗不过自己的心。 “为什么……明明就在对门……”可惜弗莱不会看到这条消息了。 Section 4过了几天，弗莱明收到高中录取通知书，他惊奇地发现又和卡尔白在一间学校了。弗莱感觉一种莫名的喜悦涌出来。但他对高中生活并不抱多大期望。他读初中时每到星期五就有以前的毕业生回母校探望老师。他印象最深刻的是一个眼圈黑得让熊猫都怜悯的学长，学长在弗莱班上大谈特谈理想与前程，但学长脸上的憔悴实在让人怀疑。 四个月的日子一下就溜过去了，弗莱明没有觉得开学前的自己有任何认知错误。他最厌恶的就是在高中住宿，并不是宿舍矛盾激烈，而是弗莱只喜欢家里的床。现在也算是暂时地结束了，就这，班主任还提醒要弯道超车。 但弗莱明最喜欢的新年就要来了，虽然没有多么热闹，但弗莱可以拿到不少的压岁钱，足以吃喝不愁。尽管距新年还有接近两个星期，弗莱明就已经在手机日历上做好标记了。 除夕夜当天，弗莱明早早洗好澡，坐在床上那玩起手机准备领各路来历的红包。一条短信吸引了他的注意，大意是他在的城市会有烟花演出，恰巧他卧室的窗户正对着演出地，这使弗莱兴奋异常。但敲门声打断了他的兴奋： “弗莱明–你在家吗——” 弗莱突然尴尬起来，要是这声音让父母听见想必一定会被问东问西。不过还好，看样子一切正常。弗莱打开门，门外是裹成狗熊一样大只的卡尔白。 “你在家真是太好了，我家里没人，可以来你家跨年吗？”卡尔白的眼睛里闪着星星，弗莱发现自己根本无法拒绝。“啊……好吧。但你小点声，我爸妈还在家。” 卡尔比出一个 OK 的手势，回头把门轻轻关上。和弗莱一起蹑手蹑脚进入房间。卡尔惊呼： “你房间的窗户好大啊，很适合看夜景呢！” “是啊，今天晚上还可以看烟花。” 弗莱明看着充满期待的卡尔，一种自豪之情油然而生。与此同时，他觉得心底被掩盖住的一块在不安地躁动，而他独处时从没有这种感觉。他向卡尔移动得更近一些，卡尔看了他一眼，没有拒绝。 “诶，卡尔白……” “什么？”卡尔对有人直呼自己的名字突然有点迷茫。 “你有交过男朋友吗？” “没有，真的没有。好多人问我这个问题。我知道自己长得好看身材也不错，现在还没谈过真是奇怪。”卡尔白开了个玩笑。 “……”弗莱明脸红了，张张嘴却一言不发。 “不是，你不会……”卡尔意识到不对劲了，站起来俯视弗莱。 卡尔在弗莱面前走来走去，一脸的难以置信。披散的可可色长发如同爬山虎一样晃动。 “我发自心底地觉得我们只是好朋友，如果想再近一步绝对不合适。至于原因，”卡尔站定了，眼神坚定，“你会知道的。” “不是，你会错意了。你怕是不知道，一个学期之间你被传了多少条排闻，甚至包括我和你的。我只是为了确认一下，你多虑了。” “……” “小丑竟是我自己。”卡尔跌坐下来。 看完烟花，卡尔白自己回家睡觉了。但让弗莱明难以忘怀的是，倒计时跨年的那几秒间，卡尔在他脸上轻轻吻了一下。当时他没敢问发生了什么，只觉得心里像有团火在烧，脸颊上一大块区域都红得像番茄。深呼吸几次，激动的心情才得以恢复。 此后的日子单调得如同溪流穿过林间。弗莱的日程表每天都充满了各种各样的课程，要是没有课程那也是抢着吃饭洗澡，时间在这种单调的日子里过得是最快的，弗莱现在真是深刻领悟了这一点。但弗莱明也会做梦，当夜深人静，他的大脑开始造梦时，这梦里便必须然有卡尔的身影。但它始终是梦，梦再真实醒来也是一场空，弗莱很讨厌这种感觉，被空虚攫取的郁闷实在难以消解。 高考前后的日子改变其实并不大，不过是班级中的人们愈发沉默寡言，书本纸张可以从地面堆上天花板，整个世界近乎黑白色，幸运的是，弗莱心里多了一抹可可色，这使他不至于如此难熬。 Section 5高考后，连弗莱明都感觉到一股自由的风席卷整座城市：街道上的年轻身影越发多起来，尤其是在晚上。但他有件更重要的事，要是这件事做不成，其他说再多都没什么意思。弗莱坐在书桌前，摊开一张信纸，抓住笔转了半天，也没有有趣的话好写。最后没办法了，只写上一行字： “I want you to be MY ALL. ” 写完署名封口，出门打算将它从门底的缝隙投入。他失望了，他又一次看见一大群蓝衣工人，进进出出，这回搬走了二十个箱子。弗莱次难得真正清醒一回： “人还是会成长的啊……” 最后一个离开的工人给弗莱明一个信封，捏了捏，里面东西还挺多。信封上没有收寄信息，只画了一片绽放的烟花。弗莱不敢打开，他怕里面全盘否定自己这十年间的感情。到最后他坐回书桌前，桌上摆着两封信:一封永远无法寄出，一封永远无法打开。弗莱明相当仓皇，他又胡思乱想起来。那个身高接近一米九，一头棕色……是可可色头发的女孩成了他青春的剪影。 幸运的是，十年过去了，弗莱明再也没见过卡尔白。 全文完 2024.11.16 后记这个故事并不是完全虚构的，这个女生是存在的。 把她的名字直接用我的替换上，有两个原因： 我眼中没有一个人的名字配得上她。 我不知道她的名字。 看得懂的，就读读下面这条B站评论，我自己写的，权当作补充材料。看不懂的，当成个悲剧看就好。 当时本子上画的漫画，突发奇想做出来的： 注释1.〔42 英寸〕约合 106.68 厘米。↩ 2. 因为是气泡消息，所以不加句号。↩","link":"/articles/the-edge-of-a-decade/"},{"title":"我终于有自己的域名啦！","text":"在拥有域名以前……受阮一峰先生的影响，我对个人博客这一块很早就有了非常浓厚的兴趣，但是碍于技术条件一直未能如愿。不过很幸运的是，我在 2025 年寒假时用上了个人电脑，也自己学习了怎么用 Hexo 框架搭建博客。不选用 Wordpress 就是因为我认为 Wordpress 虽然傻瓜式操作，部署等操作非常方便，但是太过于笨重，如果我以后要在网页里实现比较复杂的功能那 Wordpress 实在不够看，因此最后选了轻量化而且静态的 Hexo。 2025 年 2 月 8 日，我注册了个人博客站，也就是你看到的这个站点。同天发表了第一篇博客，就此踏上了 blog 之路。本着吃水不忘挖井人的精神，我还发布了一篇教学 Hexo 博客与你。 我没有 VPS 或可供当服务器的设备，因此白嫖 GitHub Pages 部署网页。但是显然有弊端：GitHub Pages 只支持如 .html 等的静态页面，对 .php 页面无能为力。不过对我来说无伤大雅，至少我在互联网上有自己的基地了。 看到不知不觉就一个月了心里还是很感慨的，虽然每一步走的都堪称艰难。（因为我的代码技术太差了嘛） 但这么一路白嫖下去也不是个事，看看：karlbaey101.github.io 这个网址，太长了。我需要一个短些的网址。于是…… Karlbaey.top字面意思很好理解，就取了“最顶尖的卡尔白”这个含义。还有一个原因就是 .top 顶级域名比 .com，.cn 之流便宜得多，也省去了备案的麻烦。 特别鸣谢 非常感谢 Nekoaday 为我建站和域名选择提供了非常有价值的建议和帮助！相关 issue：miaomiaolol · Issue #2 · Karlbaey101/Karlbaey101.github.io 域名是在 Spaceship 上购买的，就顺便用了 Spaceship 提供的 DNS 解析服务，不得不说体验非常好。不过后来还是把一些服务托管在 Cloudflare 上了，因为我需要电子邮箱服务。以后可能会慢慢多起来的。 不过可能很少有人知道我原本是打算买 Karlblo.gs 这个域名的，但是我嫌域名长得不好看最终作罢。Karlbaey 也是个陪伴我很久的虚拟形象了，用这个来做域名显然更好。 困难和困难买域名的时候 DNS 解析一直对不上，甚至出现了被墙的惨状，到最后发现是 Cloudflare 抽风，关掉小黄云后就万事大吉了。 记一次令人疲劳的网站修复 提醒 本段于 2025-03-23 03:26 编辑。 星期五回到家，发现自己博客文件夹莫名其妙少配置文件了，就打算着索性换一个模板吧，因为我正用着的 Icarus 模板显示范围相当窄，看长篇文字的时候很让人不愉快。 于是就在 GitHub 上找了找，找到一个看着很喜欢的 amazing 模板（够霸气的名字），再细看下来原来是在 Icarus 基础上魔改的，倒也正合我意。 然后依葫芦画瓢把仓库克隆到本地了，结果报错一堆，实在心累。不多说，直接上图吧： 我不会改代码，就问了 AI，但是它给的方法一点用都没有。我只能自己上必应搜方法慢慢调试，最后终于好了。原因就是：我没有把模板文件夹命名成“amazing”。除了脑残我想不到任何更好的词表达我的愤怒。 光处理 HTML 文件无法生成这个问题就耗掉了我接近一个小时，我也没有耐心去改配置了。现在 karlbaey.top 暂时关闭访问了，预计等到明天我修好站点页面之后再开放访问。 更让我恼火的是，我用的无线鼠标在我正修得热火朝天之时，突然坏掉了……我崩溃。 希望不要有人重蹈我的覆辙，hexo 模板也不要再搞什么反人类的东西了。现在是3:26，非常晚，我睡了。 以后的计划好多想说的，好多想做的，都慢慢来吧。 每周更新一篇博客，内容不限，哪怕是碎碎念也算是努力过的证明。一年下来也会有 50 篇的。 一直保留着 Karlbaey.top 这个域名，因为我实在是太喜欢了。 加入十年之约，认识更多更多的中文 Blogger。 嗯，就这样吧。太阳照常升起，又是新的一天。","link":"/articles/My-own-domain-karlbaey-top/"},{"title":"新评论系统上线！🚀（以及其他的技术更新）","text":"最近给自己的博客折腾了点新东西，还是很开心的。下面就把这些更新写在这篇博文里吧。 新评论系统众所周知，我的评论系统最早用的是 utterances，但是体验并不好：评论一多起来，评论输入框就会出现在页面最下方。我本来想发 issue，但是发现已经有不少人反映过这个问题了 Place new comment box above comments #513： 然后发现 icarus 模板原生支持 giscus 评论系统，我一用就喜欢上了：评论框置顶、评论表态跟回复功能。这简直就是我见过最最理想的评论系统。这里有张效果图： 现在忙着给以前托管在 issues 的评论补档，不过还是很开心的。 RSS 订阅源和 follow.it 订阅这两个技术性调整都是为了方便喜欢我博客的朋友们及时获取订阅的，具体操作见下面： RSS 订阅源关于 RSS 订阅源，参考这篇文章：《知道RSS的人越少，我就越希望它能被人知道！》——阿虚同学。 考虑到我一直积极维护的互联网精神（也就是自由、开放、合作、共享的精神），我还是给自己的博客开了 RSS 订阅源。你可以按我头像下的 符号或者这里来获得 RSS 订阅源。而关于如何使用本站的 RSS，请参考我的这篇博客。 follow.it 订阅相比起 RSS 订阅，follow.it 会方便许多。左侧有一个输入框： 只要输入你的电邮并且在你的收件箱里激活，就可以通过 follow.it 提供的订阅收取我的更新通知了！它与 RSS 订阅有相似之处，不同的是，RSS 订阅更简洁明了而 follow.it 只需要查收邮件。 萌国备案其实这是很早之前的事了，有朋友推荐我去一些人多的地方混个脸熟，于是就找到了萌社区并且注册了备案，这是我在萌社区的个人资料。但愿能招揽些人来看我的网站吧。 话说有没有人注意到标题的 emoji 从烟花变成火箭了？","link":"/articles/New-commenting-system-and-other-updates/"},{"title":"第一篇博客","text":"不知道花了多少时间，终于把我的 GitHub 个人博客搭好了。 中间经历了 hexo 无法部署、断网等等困难。 现在可以写个人博客了，不用依赖新浪微博真是太好了。 GitHub项目地址➲ 本博客几乎全部的图片都由图床托管搭载在仓库中，所以要是崩了直接发邮件告诉博主就行。 这里放张博主的 GitHub 头像，算是博客之路的起点：","link":"/articles/my-first-blog/"},{"title":"评论系统上线！🎇","text":"提醒 这篇博客里叙述的东西已经不再适用于本站了，关于本站的评论系统等请看此处。 我在搭好自己的博客之后，决定给自己添加一个评论系统，bing 一番后选择了最时兴的 Gitalk。当时的我太单纯，不知道 Gitalk 的代理服务器被墙了，点我查看完整 issue。/(ㄒoㄒ)/~~ 本着有问题就解决问题的思想，我试了挂其他大佬的代理（HTTP 429：请求过多），自己在 Cloudflare 搭反向代理（截至本博客发布日期，Cloudflare 依然关闭免费反向代理服务。但我觉得我没找到的可能性大一点，因为我读不懂英文）。全部失败。 活不下去了，换一个评论吧。 然后换了 giscus，但我配置好才发现什么都不显示，配置又出问题了。最后才选用了现在的 utterances，弊端就是要求评论者要有 GitHub 账户，其他的话我用着还挺满意的。 如果有大佬愿意给我提供个 Gitalk 的代理我倒是很愿意换回来。 希望不要再出什么意料之外的错误了…… 目前已知的问题： 使用 utterances 做评论会使得评论框出现在评论区底部。","link":"/articles/commenting-system-launch/"},{"title":"【清明节特刊】乐评：碎月群岛BrokenMoon Islands","text":"这是一个发生在很久很久以前的故事，发生在传说中的碎月群岛。 版权声明：本文封面图使用了原地图文件中打包的世界地图，使用的 &lt;iframe&gt; 嵌入仅供演示和辅助本文对于《碎月群岛（Piano ver.）》（原作：幻影刃shadow）和《Minecraft生存 - 碎月群島》（原作：舞秋风）的评论。使用到的非本人创作素材版权均属原作者所有。 在故事的开始 ↑这是作者上传到网易云的版本，欢迎前往支持。 ↑这是作者在 bilibili 上传的版本，点击即可访问原网站。 作为一个呜帕，当我听到这段旋律又一次回响在我耳边时，我的心里其实是很又难过又感慨的。难过在无法回到当年看舞秋风一看就是一个下午的快乐，感慨在居然有人在这个流量至上的时代依然记挂着秋风。 然后我反反复复地听，越听反而越能找回最初的感动，于是萌生了为这首钢琴曲写一篇小乐评的想法。毕竟世界上再也找不到像这样的钢琴曲，像一部散文集一样讲完一个完整的故事。 在故事的中间按照它给人最直接的听觉感受，我将整篇谱子划分成五段： 00:00 ~ 00:20 楔子 00:21 ~ 01:34 开篇 01:35 ~ 02:52 中间 02:53 ~ 04:48 后面 04:48 ~ 05:08 结束 你的爷爷是个隐居在碎月群岛, 一个很偏僻的群岛的老人家。 有天你乘着船打算去探望很久没见的他, 但到了他家后，却发现他已经去世一段日子了…… 你在他的家里发现了他的遗书。 上面写着他一直很想去探望在其他岛上的老朋友, 但碍于行动不便,所以一直没办法去。 你得悉这件事后, 你就觉得你应该帮爷爷完成他没能完成的事情… （为了方便描述并且适应我压根不懂钢琴的需要，弹奏部分就用左右手示意弹奏的乐句） 楔子以左手伴奏入场，右手弹旋律。虽然这时候右手相对全篇来说非常的青涩，但是考虑到《碎月群岛》可以理解成主角登岛前发生在主角爷爷身上的故事，青涩感就有了源头。事实上，楔子部分很大程度上呼应了结束部分一阵爆发的感觉，这个我们后面再说。 可能有些可笑，但是楔子部分好像在说“接下来我要说一个‘神威难藏泪’的故事”，如果仅从字面意思上解读的话“神威难藏泪”是很合适的：即使后来经历的事情越来越多，但人童年的时光绝对难以消去。正所谓： 幸福的人用童年治愈一生，不幸的人用一生治愈童年。 当然，无论幸不幸福，它就在那儿。 开篇这一段的编曲（我认为）相对大胆。首先为了承接楔子，依然是左手伴奏右手旋律，不同的是，旋律的存在感强了很多，这也意味着：故事开始了，请你坐下好好听我说吧。 虽然说是伴奏，但是左手在乐曲行进中慢慢凸显出来： “这是爷爷也曾有过的青春。”我想。 右手虽然因为反复而略显单调，但是左手右手交替进场弥补了这一点，这样的单调感贯穿了整首曲子，这也是独属于碎月群岛的旋律：单调，但是在平凡中看到了破碎的闪闪月光。 事实上，碎月群岛便得名于此：群岛结构支离破碎，拼合起来又恰好是月亮的形状。 中间这一段的编曲突然昂扬了起来，并且因为和弦大量运用，声音变得十分响亮，但是丝毫不破坏原曲给人的舒适感。 中间编曲有点人青年时期的味道，相当的燃，就是人青年时光芒万丈的样子，似乎整个世界都在你的手里，尽管你的世界只有群岛上的一片洼地。 当然，我不敢臆测在主角登岛前岛上的日子是怎么样的。不过当听到中间部分依然激烈，但仍然留存着一股挥之不去的忧郁感时，我就知道，这一段故事并不是什么英雄往事，它只是一个普通人的故事，没有什么慷慨的陈词，古往今来的英雄很多，唯独不在碎月群岛。在这片土地上只有普通人，像一个普通人一样度过这一生。 确实，如果世界上全是英雄，而没有普通人，世界是绝对运行不下去的，因为普通人才能在一代又一代中被砌入大厦，成为代价。 离别后的夕阳是如此的美丽 你也应该是知道的吧 后面后面部分也是全曲的高潮段，我想破脑袋都想不明白作曲人是怎么作出这段旋律的。一种爆发的感觉充满了五线谱，左手在之前一直作为伴奏处理，但它在这一段发挥出了 C 区和弦的作用，感情宣泄全部都在这一段了。 什么感情呢？我认为有两种：一种是对群岛的不舍，一种是作为听众的我们，已经从作为观众的小朋友长成现在这样大，失去了当初的天真（其实也是对碎月群岛的不舍吧）。 听到这里，我的眼泪快被听下来了：在我的童年里，秋风占了很大一部分，直到今天我对 Minecraft 依然抱有这么深厚的感情，秋风功不可没。千言万语汇到指尖竟然无法成句。就留在这里权作为纪念吧。 结束这一段作为收尾，自然而然编得十分平静，同时呼应了最早那一段平静的感觉。每个回到碎月群岛的人都发现这里改变不大，但这里已经没有人了。 引用一些语录吧。 就像是花开会花谢一样。 花开的时候，花团锦簇，五彩缤纷，生机勃勃，欣欣向荣，让人心生欢喜！ 花谢的时候，满眼残败，一地破碎，让人感伤！ 回不去才让人失落，可以回去是最大的谎言，那里没有人才是真实的 我忘不了小时候电视机上面的那张两个宝宝的图片，不是因为我想念它，而是想到了过去躺在床上，没有忧虑，总是能在看电视时注意到图片，很容易快乐的自己 资料来源→ ……其实，我姓名下方的 The Rekalyab Islands 就是来自于当年看秋风时学到的 BrokenMoon Islands，每次看起来，不得不令人感慨万千。 如果可以的话，多去支持秋风吧，这是作为一个呜帕最希望看到的事情了。 (The end) 参考资料： 【全站最高清!!!】舞秋风Minecraft 碎月群岛 BrokenMoon Islands - 【钢琴改编】舞秋风碎月群岛BGM 九年了，你还记得爷爷的墓吗？ 碎月群岛（Piano ver.） 舞秋风个人主页","link":"/articles/BrokenMoon-Islands/"},{"title":"压缩包学习笔记","text":"关于压缩包压缩包的正式名称是归档文件，也叫压缩文件。压缩文件分为有损压缩和无损压缩。 有损压缩通过抛弃部分不需要的数据，来实现减小文件大小的功能，也就是说，作为用户，必须接受压缩程序对原始文件的重新解释。最有代表性的就是 MP3 文件。简单来说，MP3 通过滤过人耳无法捕捉到的声音（也就是利用人耳听觉系统的遮蔽效应特性），来达到压缩音频大小的效果。 无损压缩算法通过消除数据中的冗余和重复部分来压缩数据，同时保持数据的完整性和准确性。举个例子，这是一段无序的字符： ppppsdwwwwqq 我们可以换一种书写方式，用数字代表这个字符出现的次数，省略1，所以就能得到： 4psd4w2q 这样，原长为 12 的字符串就被减少到了 8。当然，实际上的压缩算法比这更先进，也比使用有损压缩更复杂，而此时的压缩包已经是另一种文件格式了，如果想使用其中的数据，首先得用压缩软件把数据还原，这个过程称作解压缩。 我想写的主要是诸如 .zip 之类的压缩文件，因此下面就不多写有损压缩的东西了。","link":"/articles/Compressed-files-notes/"}],"tags":[{"name":"Delights","slug":"Delights","link":"/tags/Delights/"},{"name":"Steamgames","slug":"Steamgames","link":"/tags/Steamgames/"},{"name":"Reviews","slug":"Reviews","link":"/tags/Reviews/"},{"name":"GettingStarted","slug":"GettingStarted","link":"/tags/GettingStarted/"},{"name":"GitHub","slug":"GitHub","link":"/tags/GitHub/"},{"name":"Guide","slug":"Guide","link":"/tags/Guide/"},{"name":"Feed","slug":"Feed","link":"/tags/Feed/"},{"name":"DailyLife","slug":"DailyLife","link":"/tags/DailyLife/"},{"name":"Past","slug":"Past","link":"/tags/Past/"},{"name":"Sadness","slug":"Sadness","link":"/tags/Sadness/"},{"name":"Original","slug":"Original","link":"/tags/Original/"},{"name":"Milestone","slug":"Milestone","link":"/tags/Milestone/"},{"name":"Music","slug":"Music","link":"/tags/Music/"},{"name":"Minecraft","slug":"Minecraft","link":"/tags/Minecraft/"},{"name":"Markdown","slug":"Markdown","link":"/tags/Markdown/"},{"name":"Files","slug":"Files","link":"/tags/Files/"},{"name":"Desktop","slug":"Desktop","link":"/tags/Desktop/"},{"name":"Lanzou","slug":"Lanzou","link":"/tags/Lanzou/"}],"categories":[{"name":"Karlblogs","slug":"Karlblogs","link":"/categories/Karlblogs/"},{"name":"Tales","slug":"Tales","link":"/categories/Tales/"},{"name":"Tech","slug":"Tech","link":"/categories/Tech/"},{"name":"Reviews","slug":"Karlblogs/Reviews","link":"/categories/Karlblogs/Reviews/"}],"pages":[{"title":"Karlblogs API 页面","text":"欢迎你来到本站的 API 页面！下面列出了本站使用的全部应用程序编程接口！ API 标识号 应用方法 使用例 lanzou 共有三种参数：url（必填）、type（选填）、pwd（如有） 例如，https://karlbaey.lanzoum.com/iht9v2hgsquf，密码:seeyou，它会下载 《See You Again》这首歌，应用到这个 API 上就是：https://api.karlbaey.top/lanzou/?url=https://karlbaey.lanzoum.com/iht9v2hgsquf&amp;type=down&amp;pwd=seeyou - - -","link":"/main/"},{"title":"关于本站","text":"1 欢迎你！欢迎你来到卡尔白的博客站！ 如你所见，karlbaey.top（下称本站）是卡尔白（en_US = Karlbaey），也就是我的个人博客网站。本站脱胎于真理博客版，随后慢慢来到了全球最大同性交友程序员交流网站 GitHub 上。我个人暂时没有写代码的需求，所以本站就来当作我记录生活的地方吧！ 若不做特殊说明，“我”“我本人”“卡尔”均指卡尔白。 2 关于本站2.1 这个网站是干什么的？用来写写日记，当然也不一定每天更新。如果你看了我写的东西，感觉到开心就足够了。有什么想对卡尔说的欢迎发 issue，写电邮到Karlbaey101@outlook.com也很不错！ 2.2 本站的协议和技术支持本站的全部内容均遵循 CC BY-NC-SA 4.0 协议，保留所有权利。这也意味着，本站： ✓ 欢迎非商业性转载/二次创作。 ✓ 需保留完整署名与原文链接。 ✓ 禁止将内容用于商业用途。 选用了 GitHub Pages 搭配 Hexo 框架，以及建立在 icarus 主题上的 amazing 主题。使用静态博客站点完全是因为手头没有多余的钱购买 VPS 或者自建服务器，也因此与 Wordpress 无缘。 （目前已知的问题：使用 VPN 连接很可能导致托管在图床的图片无法加载） 2.3 版权归属本站的 Favicon 与 Logo 均由我绘制，转载请标明出处。 本站的 Favicon 见下图： 本站的 Logo 见下二图： 本博客内，分类在： Karlblogs 下的文字内容均由我本人（Karlbaey101）创作。我拥有完全控制权。 Tales 下的内容与 Karlblogs 做同等处理。 Tech 下的内容是本站新技术内容（如评论系统）的新闻。 Reproduction 下的内容为转载，并且在醒目处标明出处。版权属于原作者。 Archived 下的内容为留档专用，不一定由我创作，但因为种种原因它们已经快消失了。版权属于原作者。与Archives存档区分。 待补充 本站的正式名称是：卡尔白的博客站。非正式名称包括但不限于：老卡尔的旧纸箱、Karlbaey’s Blogs、Karlblogs。但本站更常用“Karlblogs”这个称呼。 2.4 相关法律法规及本站规定如果您正访问、浏览、使用或进行任何与本站有关的活动，即代表您知晓并遵守： 中华人民共和国宪法法律法规条例、全国人民代表大会批准加入的国际法公约倡议、公序良俗//现代社会基本道德标准//普世价值观//社会主义核心价值观和本页面全部规定。如必要本站会协助有关部门进行合法工作。 也就是说：请勿直接或间接发表涉政，色情，人身攻击，黑灰产广告等公认无法在中国大陆通过互联网平台审核的内容，不得故意或者过失损害或弱化本网站的各类合法权利与利益，不将本网站以及与之相关的网络服务用作非法用途以及非正当用途，不干扰和扰乱本网站以及与之相关的网络服务。 本站点托管在 GitHub，非评论的文字及图片内容均托管在相应的 GitHub 仓库，我拥有使用权；评论均托管在本站唯一评论仓库，版权归评论编写者所有，但我保留删除不合本页规定评论的权利。 部分内容来源于互联网，出版物等。如无意中侵犯了哪个自然人，法人，非法人组织等民事法律主体的知识产权或相关权益，请携带权利证明，联系我进行删除等相关处理 (联系方式请详见网站上方)。 引用内容版权属于原作者，本站及其访问者均认可并尊重其版权。 本站并不储存任何数据，您可能需要向网络存储服务商提供版权侵犯通知。 需要注意的是，以下属于合法使用： 《中华人民共和国著作权法》规定的“合理使用”和“法定许可使用”。 《计算机软件保护条例》规定的“为了学习和研究软件内含的设计思想和原理，通过安装、显示、传输或者存储软件等方式使用软件的，可以不经软件著作权人许可，不向其支付报酬。” 符合原作者授权协议的使用或原作品已进入公共领域。 本站遵循 CC BY-NC-SA 4.0 协议，转载及引用时请附上作者和原文链接并标注及使用原授权协议，且请勿用于商业或非法目的，否则后果自负。 本站上的文章可能会包含嵌入的内容（如视频、图片、文章等）。阅读来自其他站点的嵌入内容的行为和您直接访问这些其他站点没有区别。 这些站点可能会收集关于您的数据、使用 cookies、嵌入额外的第三方跟踪程序及监视您与这些嵌入内容的交互，包括在您有这些站点的账户并登录了这些站点时，跟踪您与嵌入内容的交互。 3 常见问题解答Q3.1 我读完了，现在我能干什么？A： 太多了。 你能读读我的博客，要是发现什么有趣的也可以联系我。 好像也不怎么多。 Q3.2 卡尔，你写的挺不错的，我能给我的朋友家人们看看吗？A： 当然可以，只要你遵照2 关于本站的全部内容就可以了。不过记得，不要因为观点不同就吵架。 Q3.3 你的博客有友站吗？A： 有的兄弟，有的，请点这里。 Q3.4 我该怎样联系站长？A： 分三种途径： 针对博客文字本身的疑问或见解，直接在对应的博客页发评论。评论服务由 giscus 提供。 如果对站点的 HTML 或是 JavaScript 代码等有建议，请到这里发 issue。在发 issue 前我非常建议你先读读其他朋友们发的 issue 并参考标签，这或许对你表达建议有些帮助。 想找卡尔聊天的可以直接加我的 QQ 2454161978 或者与我互发邮件 karlbaey101@outlook.com。 除此之外，我也建议你了解以下这些常用的电子邮箱账号： info@karlbaey.top ——本站的新闻机器人（正式名称：Karlbot-info ），会不时给订阅者发邮件通知网站的重大事项，兼任发布与友站的官方互动消息。活动通告也由这个邮箱发出。需要注意的是，这个邮箱不具有收信功能，如果你想反映问题，请往下看。 不过虽然说是机器人可邮件都是我亲手写的😡 inbox@karlbaey.top ——本站专用收信箱（正式名称：Karlbox-in ），与发 issue 具有同等效力，我个人更推荐前者。与 Karlbot-info 相反，这个邮箱没有发信功能，因此送至这个信箱的邮件很可能没有回音，这也是我推荐发 issue 的理由。 待更新…… 4 结语好了，请开始你在本站的生涯吧！ 由卡尔白撰写，因为本站产生的纠纷以本页面为准。将会随时间更新。","link":"/about/"},{"title":"","text":"碎碎念 tips：github登录后按时间正序查看、可点赞加❤️、本插件地址..「+99次查看」 说实话不知道写点什么好，毕竟我已经被 Gitalk 吓怕了，等我什么时候玩利索了再来修这个页面吧。 2025.04.11 改：修了，但是不会做反向代理，就这样吧。 123456789101112131415&lt;script&gt; $.getScript(&quot;/js/gitalk_self.min.js&quot;, function () { var gitalk = new Gitalk({ clientID: '46a9f3481b46ea0129d8', clientSecret: '79c7c9cb847e141757d7864453bcbf89f0655b24', id: '666666', repo: 'issue_database', owner: 'removeif', admin: &quot;removeif&quot;, createIssueManually: true, distractionFreeMode: false }); gitalk.render('comment-container1'); });&lt;/script&gt;","link":"/chatters/"},{"title":"本站友情链接","text":"申请友链须知 申请请提供：站点名称、站点链接、站点描述、logo或头像（不要设置防盗链）。 排名不分先后，刷新后重排，更新信息后请留言告知。会定期清理很久很久不更新的、不符合要求的友链。本站不存储友链图片，如果友链图片换了无法更新。图片裂了的会替换成默认图，需要更换的请留言告知。 如果您也想加入本页，请在评论区留言并且附上您网站的URL和介绍图（宽与高的比应尽可能接近1）。 本站友链信息如下，申请友链前请先添加本站信息： 123456789网站名：老卡尔的旧纸箱网站URL：Karlbaey.top简介：这里存着卡尔白的过去、现在和未来站长：Karlbaey101站长头像：https://karlbaey.top/images/Fundamental/avatar.png本站 favicon：https://karlbaey.top/images/Fundamental/Favicon.png本站 logo（1024×512）：https://karlbaey.top/images/Fundamental/KarlblogsLogo1.png 以后会不断更新。 《冯摹兰亭序》卷 加载中，稍等几秒...","link":"/friends/"},{"title":"","text":"&nbsp;&nbsp;听听音乐 音乐播放器由mePlayer提供，布局参照网友博客所作，感谢作者的辛勤付出。更多音乐分享请查看歌单。 &nbsp;&nbsp;看看视频 ->点击以下条目开始播放视频,向下滑动查看更多","link":"/media/"},{"title":"","text":"来而不往非礼也。 有什么想说的，都写在下面吧。卡尔会很高兴能回复你的。","link":"/message/"},{"title":"音乐歌单收藏","text":"温馨提示：选择喜欢的音乐双击播放，由于版权原因部分不能播放。如果喜欢歌单收藏一下，去网易云都能播放哟！","link":"/music/"},{"title":"","text":"window.location.href = \"https://api.hanximeng.com/lanzou/?url=https://karlbaey.lanpw.com/iziv32p9l3sj&type=down\"; 感谢你的支持！Typora 的下载马上开始…… 如果下载不开始，请按这里","link":"/special/Download-Typora"},{"title":"关于我","text":"你好，我是@卡尔白！也就是这个网站的站长！本文有一个更正式的版本，请看这里。 我吗？其实还是有很多想说的吧。 名字的由来Karlbaey （跟我一起读：/‘kɑ:rlbɑ:ɪ/），中文音译为卡尔白，分成两部分：","link":"/about/me/"},{"title":"","text":"Hi 👋, I’m Karlbaey📋个人简介✍一个喜欢写写小作品的人 按我跳转 –&gt; 博客 通常以 @Karlbaey101 的身份活跃在 GitHub，也喜欢在哔哩哔哩以 @Karlbaey 的身份活跃，有时你也能在各大社交平台看见我，甚至有可能是 Hypixel 服务器。 下面列出了我常用的编程语言和平台： 📕最近在读哈珀·李 《杀死一只知更鸟》 ☕在忙的事 更新个人博客 摆弄 php 和 python 学习 HTML、CSS 和 JavaScript 三兄弟 🥇个人项目 是的，现在只有这个 Repo 拿得出手。 🛎️个人服务以下内容纯粹出于兴趣，不保证稳定性。 标识符 URL 博客页 karlbaey.top API 文档页面 api.karlbaey.top 蓝奏云网盘直链解析 api.karlbaey.top/lanzou 待补充 - ⏫栈🧑‍🤝‍🧑自然语言 中文（zh-hans、zh-hant） English（en-US） ⌨️编程语言 C / C# / C++ Java Python HTML CSS JavaScript / TypeScript 📌以及其他的…… Markdown KaTeX 🖥️操作系统 Windows 11 Android 是的我就是那么的钉子户 🥰其他偏好 搜索引擎：Bing、Google 文本编辑： Markdown：Typora Python 和其他：Visual Studio Code 下载：Internet Download Manager 🔗联系我以下两种联系方式都很欢迎！或者你也可以发送至这个邮箱：inbox@karlbaey.top","link":"/album/README"}]}