{"posts":[{"title":"Hexo 博客与你","text":"前言 如果你还在忍受诸如新浪微博、腾讯微博等博客网站的臃肿，那你马上该读一读这篇文章了。 拥有一个你自己的博客网站，你可以： 记录日常生活⏰ 写写学习笔记📋 跟其他博客创作者们探讨写作🖊 发电⚡ 至于为什么写博客，上知乎搜一搜就有很多答案。我的语文老师说过一段话，我觉得很适合回答这个问题： 作文博客是孩子们的一种创造，是一种优秀的表现，古人曾经靠的是一篇文章走遍天下。而如今，能写得一手好文章，也会受益终生。谢谢。 那不多废话，往下读开始你的博客生涯吧。 准备工作 在开始之前，你应该： 有一台能访问互联网的，能正常工作的电脑。 会使用搜索引擎。知道常用计算机术语并至少有初中的英语水平。 会基础的文件操作。如复制、粘贴、下载和上传。 有一个能正常使用的电子邮箱。如 QQ 邮箱。 另外，我非常建议使用加速器和 VPN。因为 GitHub 在中国没有服务器，使用 VPN 能让你快速访问网站。 搭建环境 务必按照顺序来安装！ ¶Ⅰ 下载 git 从 git 官网下载对应的安装包： 安装好后在桌面 右键 → Open Git Bash here输入 git --version 查看，这样显示就算安装成功了： 打开你下载 git 的目录，右键 git-bash.exe 选择[属性]并如下选择： ¶Ⅱ 下载 Node.js 从 Node.js 官网下载对应的安装包： 在 Git Bash 中输入 node -v，不报错即可。 环境配置参考这里。 ¶Ⅲ 安装 Hexo 在 Git Bash 中输入 npm config set registry https://registry.npm.taobao.org（这一步换下载源，是为了后面下载不报错）。输入npm install -g hexo，等待完成后，输入hexo -v。 更正：淘宝的镜像源已经修改为 https://registry.npmmirror.com，请参照本教程的朋友及时修正。 继续输入 npm install --save hexo-deployer-git安装依赖。 到这里，全部环境就搭建好了，下面是正式的搭建博客环节。 使用 git 生成 SSH key 如果你的用户名称中含有中文，这一步不建议在 Git Bash 中操作。Windows自带搜索框搜索cmd，右键→以管理员身份运行是更好的选择。 如果你到现在都没有自己的 GitHub 账户，就现在去注册一个并设置好用户名。 在 Git Bash 或 cmd 中输入ssh-keygen -t rsa -C &quot;填你注册 GitHub 的邮件地址&quot;，按三次回车后，会像这样： 然后输入clip &lt; ~/.ssh/id_rsa.pub，将刚刚生成的 SSH 密钥复制到剪贴板。如果是 cmd，就把~/.ssh/id_rsa.pub改成 id_rsa.pub 的绝对路径。 接着打开github主页，点击个人设置，点击左侧的SSH and GPG keys，点击New SSH key。 将你的剪贴板里的东西复制进去，Title随意取： 输入ssh -T git@github.com测试，接着输入yes，不报错即可。接着设置你的个人信息： git config --global user.name &quot;karlbaey101&quot; #你的github用户名 git config --global user.email &quot;xxx@example.com&quot; #填写你的github注册邮箱 搭建博客 ¶新建博客 开始之前先介绍一下 Hexo 的基本命令 hexo new &quot;postName&quot; #新建文章 hexo new page &quot;pageName&quot; #新建页面 hexo generate #生成静态页面至public目录 hexo server #开启预览访问端口（默认端口4000，'ctrl + c'关闭server） hexo deploy #部署到GitHub hexo help # 查看帮助 hexo version #查看Hexo的版本 对应的缩写，比如： hexo n == hexo new hexo g == hexo generate hexo d == hexo deploy hexo s == hexo server 新建一个保存博客的存放目录，必须是空文件夹。比如卡尔白的是：E:\\Karlblogs 在你的存放目录右键→ Open Git Bash here，输入命令hexo init 查看你的存放目录，里面应该出现了这些： 生成静态网页并预览: hexo g &amp;&amp; hexo s 浏览器输入http://localhost:4000 报错解决： 问题：hexo g报错,line.mathALL is not function问题解决 原因：nodejs版本低于12 解决：两种方法 方法1）请将nodejs升级到高于12.0.0的版本 方法2）config.xml中的 highlight-&gt;enable的值从true更改为false，这样可以避免异常。 访问没问题了，接下来部署到 GitHub。 ¶部署到github 注意： 此处需要一个新仓库（Repository），仓库名称格式：用户名.github.io。比如卡尔白的就是：karlbaey101.github.io。 编辑_config.yml，_config.yml在博客存放目录下： _config.yml1234deploy: type: git repository: git@github.com: branch: main repository仓库地址改为自己的。branch 看自己的 GitHub 仓库是 master 还是 main，卡尔白这里是 main，所以就填写 main。 发布到 GitHub，命令：hexo d。 在浏览器访问：https://karlbaey101.github.io/ 不出意外即可成功访问。 这个博客地址已经是部署到了公网，感兴趣的读者也可以访问。 ¶编写博客 搭建好博客之后，日常中肯定是需要编写博客并且同步到 GitHub。卡尔白来带大家写一篇博客。 新建一篇名为Karl-first-blog的博客：hexo n &quot;Karl-first-blog&quot; 查看对应的文件夹： 可以看到生成了一个Karl-first-blog.md文件，通过这个md文件去写博客 默认的内容是这样的： Karl-first-blog.md123456---title: Karl-first-blogdate: 2025-02-10 23:47:31tags:---这里开始编写正文（markdown格式） 使用 markdown 格式编写好后，在博客存放目录右键→ Open Git Bash here，输入hexo g &amp;&amp; hexo d，你的博客就被部署到网站上了。访问网站就能看到。 结语 到这里，你就应该会写博客和部署博客了，（如果有）下一期就告诉诸位怎么导入模板和网站操作。 完结撒花！🎇🎇🎇","link":"/articles/Hexo-blog-and-you/"},{"title":"Markdown编辑器推荐","text":"前言 今天卡尔白离开学校的时候看到了一张很有意思的海报，当然，也相当高血压： 这张海报的四级标题、粗体字和表格都没有正确地渲染。可以看出制作者对 Markdown 如何正确使用知之甚少了。 下面就推两个我正使用的 Markdown 编辑器吧。 推荐 ¶Typora Typora 是老牌 Markdown 编辑器了。它最突出的特点就是极度的简洁，让人可以专注于内容的创作上。不过虽然简洁，它内在的功能也是样样不少，就比如论文常用的 \\(\\LaTeX\\)（MathJax），Typora 也是原生支持。Typora 的界面是长这样的： 同时 Typora 提供了非常丰富的快捷键，比如下面这些： 官网下载速度实在太慢，卡尔白这里提供一个下载源。按我下载⬇️ 以后又可以水一篇 Typora 了，嘿嘿。 ¶Microsoft Visual Studio Code VSCode 也是耳熟能详了，直接贴上官网地址⤴️。VSCode 强大之处在于它不局限在 Markdown 本身，而是发挥出多语言写作的优势。举个例子：Markdown 与写博客非常常用的 JavaScript 可以在同一个窗口内共同运行，而不需要多开窗口。此外，借助 VSCode 里无数方便的插件，Markdown 也能做到支持 \\(\\LaTeX\\)（KaTeX）。虽然相较 Typora，VSCode 缺少了简洁，但是它非常适应程序员的需要。 如果使用 VSCode，我十分推荐安装这几个插件： 结语 没想到为了一个错误渲染 Markdown 我还专门水写了一大段文字。保证每周更新的进度又向前迈了一步，好耶！这个过程里也学会了怎么把 GitHub Pages 链接到下载页，至少没有蠢到把 GitHub 当网盘使。","link":"/articles/Markdown-editors-recommend/"},{"title":"Markdown 语法速查","text":"Markdown 语法速查表，在编写博客时很有用。提供pdf格式下载。 ¶目录 H1 标题 H2 标题 H3 标题 H4 标题 H5 标题 H6 标题 文本格式 列表 无序列表 有序列表 链接 图片 代码 行内代码 代码块 表格 引用 分割线 任务列表 转义字符 ¶标题 123456# H1 标题## H2 标题### H3 标题#### H4 标题##### H5 标题###### H6 标题 H1 标题 ¶H2 标题 ¶H3 标题 ¶H4 标题 ¶H5 标题 ¶H6 标题 ¶文本格式 12345*斜体文本* 或 _斜体文本_**粗体文本** 或 __粗体文本__***粗斜体*** 或 ___粗斜体___~~删除线文本~~行内`代码`效果 斜体文本 或 斜体文本 粗体文本 或 粗体文本 粗斜体 或 粗斜体 删除线文本 行内代码效果 ¶列表 ¶无序列表 12345- 项目1 - 子项目1 - 子项目2* 项目2+ 项目3 项目1 子项目1 子项目2 项目2 项目3 ¶有序列表 1231. 第一项2. 第二项3. 第三项 第一项 第二项 第三项 ¶链接 123[显示文本](https://www.example.com) [锚点链接](#标题名称) &lt;https://www.example.com&gt; 显示文本 锚点链接 https://www.example.com ¶图片 1234![替代文字](图片地址 &quot;ExampleText&quot;) ![图标](https://example.com/logo.png &quot;ExampleText&quot;) 带尺寸控制： &lt;img src=&quot;图片地址&quot; width=&quot;200&quot; /&gt; ¶代码 ¶行内代码 1使用 `print()` 函数输出内容 使用 print() 函数输出内容 ¶代码块 123‎``‎`pythonprint(&quot;Hello World!&quot;) `‎`` 1print(&quot;Hello World!&quot;) ¶表格 1234| 左对齐 | 居中对齐 | 右对齐 || :----- | :------: | -----: || 数据1 | 数据2 | 数据3 || 数据4 | 数据5 | 数据6 | 左对齐 居中对齐 右对齐 数据1 数据2 数据3 数据4 数据5 数据6 ¶引用 123&gt; 这是引用内容 &gt; 多行引用 &gt; &gt; 嵌套引用 这是引用内容 多行引用 嵌套引用 ¶分割线 123---***___ ¶任务列表 12- [x] 已完成任务- [ ] 未完成任务 [x] 已完成任务 [ ] 未完成任务 ¶转义字符 1234\\* 星号 \\# 井号 \\( 括号 \\! 感叹号 * 星号 # 井号 ( 括号 ! 感叹号","link":"/articles/Markdown-grammar-quick-reference/"},{"title":"RSS 入门教程","text":"¶开始 ——RSS 简介 RSS 是什么呢？ RSS（英文全称：RDF Site Summary 或 Really Simple Syndication[2]，中文译作简易资讯聚合[3]，也称聚合内容[4]，是一种消息来源格式规范，用以聚合多个网站更新的内容并自动通知网站订阅者。使用 RSS 后，网站订阅者无需手动查看网站是否有新的内容，同时 RSS 能将多个网站的更新整合并以摘要形式呈现，有助于订阅者快速获取重要信息，并选择性点击查看。 ——来自：维基百科-RSS 消息来源[1]（英语：web feed、news feed、syndicated feed又译为源料[2]、馈送[3]、资讯提供[4]、供稿[5]、摘要、源[6]、新闻订阅、网源[7]）是一种资料格式，网站可透过它将最新资讯传播给用户，用户能够订阅网站的先决条件是网站可提供持续更新的资讯。消息来源受到网志及新闻网站的广泛采用，因为此类型的网站经常更新内容。如前所述，feed的译名很多，莫衷一是，至2008年底为止，还没有一个十分通用而备受认可的中文译名。将feed汇流于一处称为聚合（aggregation），而用于聚合的软体称为聚合器（aggregator）。对终端使用者而言，聚合器是专门用来订阅网站的软体，一般亦称为RSS阅读器、feed 阅读器、新闻阅读器等。 ——来自：维基百科-消息来源 那我们就知道了，RSS 本质就是一种推送机制，只不过这种机制完全把握在用户的手中，这样就避免了对算法的依赖。用户通过设置自己的 RSS 订阅源，就能阅读自己真正感兴趣的内容。 不过这对内容创作者来说相当不友好，因为 RSS 是一种“无流量访问”，创作者的流量相当于凭空消失。所以，现在 RSS 声势渐微，最主要的原因还是流量至上的时代，再其次就是 RSS 相对复杂的操作了。这也难怪，打破茧房总是要付出些代价的，不过是值得的。 事实上，一些 RSS 阅读器完全可以通过数据中转（提供 feed -&gt; 阅读器服务提供商的服务器 -&gt; 用户）使得本来被网络审查（也就是俗称的“墙”）的内容不通过搭载 VPN 等方式直接抵达用户手中。而常见的被墙的网站（例如 X、Facebook和维基百科）是提供 RSS 订阅的，因此，市面上常见的 RSS 阅读器大部分都已经被墙。这也是网络审查的一部分。 至今被墙的 Web 端 RSS 阅读器有：Feedly（2018.11）、Inoreader（2020.4）、RssHub 官方域名（2020.3），Reeder（2020.9，仅限 iOS）。 下面就以本站的 RSS 订阅源为例，简要介绍怎么订阅。 ¶获取 feed 如果网站里有这个图案： ，就说明网站本身是提供 feed 的。点击这个图案，看看浏览器地址框，如果是以atom.xml结尾的话，那么这条网址就是这个网站的 feed；或者阅读页面中的介绍，通常都会在醒目处写出 feed 的地址。只要这个网站不被墙，你就可以在阅读器中使用它。 ¶没有主动提供 feed 呢？ 那你可以尝试在 RSSHub 寻找，这里有很详细的使用方法。 ¶使用 feed 通常来说，如果网站本身有 feed，那它通常是 example.com/atom.xml 这样的格式，只要把这个链接放在阅读器里即可。 我们以 Fluent Reader PC 版为例： 现在我们拿到了 Karlblogs 的 feed，也就是 karlbaey.top/atom.xml。现在需要下载一个 Fluent Reader，下载好后，打开并选择右上角的齿轮图案。官网链接→ 把拿到的 feed 粘贴到输入框中，Fluent Reader 就会自动将读取到的文章显示在首页了。 但是，一些网站的正式 feed 是托管在 Google Feedburner 上的，无法在中国大陆访问，比如说我的正式 feed。这种格式的 feed 如果按照上文的方法在 Fluent Reader 中使用，会提示 Error 403（禁止访问），因此需要在外国提供的服务器上解码才能正常访问，比如说 Inoreader，前文也提到，它们中的大多数已经被墙，想要用这种 feed 只能自建 RSS 服务。因为成本相对高就不在这里说明部署方法。 有没有只通过收电子邮件就能获得更新的方法呢？当然有的。 ¶follow 订阅 这是官网，目前本站也正在使用 follow 订阅，如果是 PC 端就看网页的左栏，有这样的一张图片： 目前本站采用的 icarus amazing 模板内置了有关 follow 订阅的模块，所以是已经配置好 follow 订阅了，在这里输入你的邮箱并且在邮箱中查收并确认邮件就能订阅更新了。其实到现在都没有人订阅。 有一个和 follow 订阅功能类似的网站，也就是 FeedBlitz，不过因为需要付费我并没有选用。 ¶结语 其实 RSS 这档子事本来也就是早期互联网不仅网速慢而且上网也不方便，Netscape 适应环境而开发出来的一个小玩意，放在今天的互联网已经小巧到可以归类到 Gadgets 那一级别。它的没落是必然的，复兴也是必然的。 大数据的出现带动了算法、信息茧房等等诸多让人不适却又不得不沉浸其中的概念，一个普通人实在是很难抵挡这一切。就比如说微信公众号，虽然它本来也是像 RSS 一样，为了让每一个互联网用户都能看到自己真正感兴趣的东西。但是时代在发展，公众号也渐渐偏离了初衷，成了分析用户的工具。我们甚至可以试想，这些分析得到的数据会被拿去培养更精密的 AI，算法越来越完备，茧房越来越难逃脱，恶性循环早就已不可知的形式在整座互联网大厦里运行了起来。人真的只成了互联网运行的齿轮，成了冷冰冰的数据，而不是建设它的一份子。 RSS 摆在那里，就好像前朝的宝物重新焕发光彩，因此它必然复兴，当初只有新闻作用的它如今竟然成了生产力工具。或许 RSS 要给我们思考的，就是如何在信息的洪流下找到自己真正在意的东西。 当然，也包括不要忘了自己的初心。 没想到一个小小的 RSS 也能让我写出这么些东西，可能我真的被算法预测太久太久了。 (The end)","link":"/articles/RSS-tutorial-for-Karlblogs/"},{"title":"Nothing Dawn","text":"¶序 己巳孟夏，以不可言之志，尝撰此文，乃一无谓之举，不胜一览。有卿语人曰：“其一丧家犬，其有作文亦如犬狺然狂吠耳。”白怫然，终无可奈何，独觉此卿“狺然”、“狂”言之过矣，余皆无误。既叹然，不可不藉尺卷寸管，以抒其不可言之志。篇中有论世，有叹惋，有嬉笑，有怒骂，为赋一文强说愁也。且聆之犬吠如。能解吾意，亦非一不幸事。 ¶Section 1 和音乐扯上关系的故事都不会有多么美好的结局。布莱恩看着那个背对着她的男孩，心里终于是回想起了那个男孩曾下的判决。 布莱恩当时只当布鲁斯的话只是受刺激后的气话，但他脸上的平静神色否认了布莱恩的观点，于是她半戏谑半认真地追问：“为什么？” “啊——倒没什么，只是看了很多乐队的结局，一点有感而发罢了。”布鲁斯木然地说，“远的有约翰·列侬，近的有黄家驹……实在是太多了，根本列不完。听不懂算了，你当我是胡言乱语吧。”布鲁斯让头轰然倒塌，趴在桌上，连眼镜也没摘，发出了嘎吱的响声。布莱恩刚想追问，看他一副拒之门外的模样，只好作罢。 如果不是布莱恩十分肯定布鲁斯对此一无所知，她一定会当场把布鲁斯的桌子掀翻，但她一直把这个秘密压在心底，从未和离开后见到的任何人说。这个秘密就是：她组了个乐队，一个完整的乐队。 事情发轫于何时呢？布莱恩不由自主地回忆起来。好像是三年前吧，布莱恩想，那时她刚学会一点吉他，就火急火燎地想给人看看自己努力的成果。她也记得，自己弹的第一首完整的曲子是酷玩乐队的《Yellow》[1]，这还是她检索“新手入门吉他曲”后得来的结果。事实也如她所愿，这首鼓手入门曲同样非常适合吉他。从此以后，它成了布莱恩最爱的抒情摇滚。 不过，首次表演出来后，布莱恩觉得自己弹得烂透了，尽管听众给出的掌声和赞美的话绝对出自真心。那也好吧……布莱恩轻抚着六条弦，安慰自己般地想，琴弦的金属光泽熠熠生辉。 正在听众们分离后不久，一个头发乌黑的女孩找上了布莱恩：“啊，嗯，”女孩因为羞涩哽咽了两声，“你是布莱恩吧？你弹得太好了，以后也会有其他的曲子吗？” “会，会的吧。”布莱恩同样脸红红，“我只是刚开始学罢了。” 像是下定了某种决心，女孩先埋低头，然后猛地一抬：“我是明日奈。 其实我会点口琴……我觉得，咱可以组个乐队。”发现布莱恩马上要开口作出回应，明日奈阻止道：“你不用马上回答的，我知道这么问太唐突了，但我还是希望你能考虑一下，我下了很大决心的。” 明日奈说话时手指不停搓弄着衣角，大概是局促了吧。见她这样，布莱恩说：“好，我会考虑。”突然之间，明日奈也不搓衣角了，眼角流出欣然的颜色。这句话在 布莱恩心里埋下了一颗地雷，但它不会爆炸，即便是暂时的。不同的是，这地雷会生根，会发芽，也会像它的兄弟硝酸甘油[2]一样，会灰飞烟灭。今天是3月16日，临近春分。 在那之后？两个星期还是三个星期，总之四月的阳光已经不留情地向地球投掷热量时，布莱恩和明日奈的微型乐队就此组建。布鲁斯正在数学课上睡得半梦半醒，布莱恩就在他旁边，饱含着心底油然生出的温柔，回忆着她的乐队，布鲁斯发出的暴论也就在她心里烟消云散。等到布莱恩下一次想起来，已经是布鲁斯离开很久之后的事了。 给乐队起名并不花很多的时间，她们在第一个设想上就达成了一致。明日奈提议道：“我觉得，我们的乐队叫做“Sunset”再合适不过了，布莱恩你怎么看？” 日落吗……布莱恩首先想起的是《Yellow》单曲专辑的封面，一棵不知是棕榈树还是椰树的大叶片挡住太阳的大部分，但日轮余下的光芒把整个画面都渲染上一片鹅黄。这是只属于夕阳的光芒，自此之所外再也找不到一个时刻能这样均匀地为世界打上色彩。 “就这个了。”布莱恩一锤定音，脑中深深地刻下了太阳浮在海平面上的样子。 “那太好了！”明日奈兴奋得快跳起来，“我想了挺久的……不要笑我！ 就一个词也是要下心思去想的好不好！”布莱恩想到只是一个六字母单词就让明日奈想了很久，不禁笑出声来。 回忆的马车被下课铃砍断了车轴，布鲁斯也被唤醒过来。布莱恩看见布鲁斯几欲张嘴却又把话咽回肚里，像是在睡眠时被地震震开的碎石掩埋后又被挖出来的人，被吓得丧失了语言功能。布鲁斯叹了口气，无奈地说：“黄梁一梦啊……” 布莱恩当然不知道他做了什么梦，好奇心驱使她问个明白。布鲁斯抢先开了口： “布莱恩，你有朋友吗……不对，我在问什么……就是说，本来关系很好却因为各种各样的原因事情绝交的？” “有吗？”布莱恩照布鲁斯的话试图搜索，“有的。你问这个干嘛？” “那有没有因为一句话就断交的？” “这倒没有。”布莱恩的问题并没被解答，但她已经猜到了答案。于是她也不再好奇，随布鲁斯自己自言自语去。 看着布鲁斯突然阴沉，布莱恩猛记起好像布鲁斯从认识开始就是这种样子：除了自己，找不到另一个能说上话的人。当然，也不是一开始就这样想的，因为布鲁斯长相与普通人没有多大分别，她自然觉得布鲁斯没有多大问题，只是较其他人多了几分灰头土脸罢了。但是不对劲的地方太多了，就比如说，布鲁斯从来不找自己说话，布莱恩想。本来以为是他觉得和异性说话会尴尬，最后才发现他是几乎连话也不说，在闲时要么是发呆，要么是双目无神地自言自语。布莱恩觉得他像江山尽为外人夺去的末代皇帝，以前尽管有无限的辉煌，但也只能从他眼里不时滴出的无奈读出一些了。她只好尊重布鲁斯的选择。大概是他们两人无中生有的默契，尽管他们二人未曾说过一句话，他们好像心意相通，是布鲁斯不时流淌出的落寞在他们间筑起的高墙阻止了交流的可能吧。“怎样都好吧。”这是布鲁斯自言自语时最爱说的话。 不过他们最后还是聊上了天。“布莱恩，你是不是觉得，我很奇怪？ “会这样觉得也正常，因为我不爱说话嘛。” “各人有各人的选择嘛，无所谓奇不奇怪吧。”布莱恩否认。 “你直接同意的话我反而好受点。算了吧，怎样都好。我只是想告诉你，你是个很好的人，我不和你说话只是我自己的选择。至于原因，是很久以前的事情了，总之，言多必失吧。” 布莱恩对这莫名其妙的一番说辞弄得摸不着头脑，姑且觉得这是示好了。 ¶Section 2 在这以后，他们不时地会说起各种各样的废话。反正废话是说给朋友的，不说废话的那不叫朋友。也谈音乐，谈的多是现代的流行歌，摇滚其次。不时说起粤语歌，不过那些都是三十年以前的老歌了。 “音乐这东西，挺有意思的，我觉得是。一首好歌一定是要为现实里的事情作的。要是写的歌就为了歌颂，赞美一个人，还不如别写出来的好。”布鲁斯正说到 Beyond 乐队的《灰色轨迹》[3]。布莱恩发现他久违地露出了一点笑容，心里就知道了布鲁斯对音乐真心的喜爱。 聊着，就几个月过去了。布鲁斯突然在晚自习前掏出一个黑色的物体，表面闪着光。“嘿嘿，终于有钱买个好点的 MP3 了。”布鲁斯 一边&quot;嘿嘿&quot;笑着一边连上 3.5 mm 有线耳机。 “今天我要听一晚上MP3了。”布莱恩觉得布鲁斯脸上的笑是发自心底的，于是布莱恩也回之以微笑，尽量不让布鲁斯觉得自己被嘲讽了。至少能笑出来，还是能救回来的。布莱恩想。 好景不长，布鲁斯塞上耳机后，分针转过了 12°，班主任从后门偷偷地摸进来了。布莱恩注意到时，已经太晚了，他站在布鲁斯斜后面， 此时的布鲁斯手忙脚乱地把耳机揉成一团塞在手心，却只能听到一句无谓的警告： “以后别让我看到你这里有 MP4。” 布莱恩不敢出声，用余光瞟见布鲁斯木然地点头，他的脖子像根被扯坏的弹簧，无济于事地低下了头。布鲁斯把 MP3 小心地装回袋子，再把耳机一圈圈缠好，也装进 MP3 的袋子里，整个袋子就被放回了书包的格子里。虽然班主任已经走了，但布鲁斯继续低着头发呆，也不说话。 “回家再听也可以的，别太难过了。”布莱恩轻拍布鲁斯的左肩。 布鲁斯含糊地&quot;嗯&quot;了一声，算是回应。对他来说，耳机不只是播放设备，耳机更像是把他和外界暂时隔开的屏障，在被耳机保护的世界，布鲁斯大可以像个正常人一样写写画画，不论好坏。但是布鲁斯现在发现耳机还不如塑料袋可靠，事实已经证明了。他觉得，或者说是希望，布莱恩能体会到他的失望，如果连布莱恩都感觉不到，那真的不会再有人能发现了。 “布莱恩，”听到布鲁斯的声音，布莱恩搁下了笔，“你觉得，普通人活着的价值是什么呢？” “自己去翻价值论，课本上就有。” “书上的那顶个屁用，”布鲁斯不带表情地骂道，“价值论有用人就不可能组成像你我看到的这个样子了。” （此处删去 616 字） ¶Section 3 过了两个星期的周末，Sunset 乐队终于想起来排练了。明日奈问布莱恩：“咱们一直唱的都是其他人的写的歌，要不咱自己写一首” 布莱恩表示同意，她们苦恼了一个上午，终于在一大片白纸上画出了几个音符。录下来用的就是手机的麦克风，音质相当难让人满意。不过也没有别的办法，专业的麦克风压根不是她们这样的微型乐队值得买一支的。大部分都是布莱恩在吉他独奏，明日奈见缝插针地补上她的 F 大调口琴。录音合成后的结果出人意料地不错，口琴竟然被明日奈吹出了卡祖笛[4]的味道。她们两人都相当满意。布莱恩把编曲存进了闪存卡[5]。 明日奈提出要写词，她们互相大眼瞪小眼，因为对方的文学造诣各自心里都再清楚不过。布莱恩 说：“我给我同桌听听吧，他脑子里想的事情多，写出来的文字如何也不可知。” 布莱恩把闪存卡交给布鲁斯时，他看上去相当惊讶：“你什么时用候有个乐队了？” “很早啦，认识你之前就有了，只是因为以前一直没有自己的作品才没跟你说。你听听这个。”布莱恩把闪存卡往前推了推。 布鲁斯仔细地审视布莱恩, 看她扎好的马尾辫。现在是 6 月，正是太阳最毒的时候，但布莱恩把肱骨中间往下的皮肤都暴露出来，眨着棕色的眼睛，想让布鲁斯同意试听。 布鲁斯悄悄在心里感叹，明明穿的衣服都一样，她看上去好耀眼啊。 布鲁斯拾起卡片，插进 MP3。这是什么搭配？吉他和卡祖笛……是口琴。布鲁斯点点头。全长五分钟，布鲁斯沉默了七分钟。 “怎么回事，不是只有五分钟吗？怎么不说话啊？”布莱恩惴惴不安。 布鲁斯缓缓摘下眼镜，然后是耳机。“对一个高中女生来说，这个编曲太超前了。不可能是一个人录的歌吧？我能看看你们乐队的成员吗？”他的神情突然焦急起来。 “就两个人，另一个也是女孩子，有机会带你看看。先说正事，评价一下？” “我刚刚已经说了。” “那你觉得能不能写词？”布莱恩终于问上了正事。 “写是当然可以，”布鲁斯有点为难，“但我没写过，我吃不准怎么写。” “能委托你吗？”布莱恩棕色的虹膜闪闪发光。 “我尽量。” 布莱恩把存着歌的闪存卡给了布鲁斯，布鲁斯一边听着旋律一边敲打笔杆，拿捏着原曲的情感。他心里有了点数，反正是抒情摇滚，就自己发挥了…… （此处删去 215 字） 布鲁斯没用多长时间，就按照自己的意思写出一篇词作，交给了布莱恩。布莱恩只觉得布鲁斯多半是夹杂了私货在里头的，不押韵的同时还有许多心思。布莱恩也不在意，只照着词唱了出来。第二天，布莱恩把带着自己声音的母带给明日奈听。“真是你同桌写的？我挺好奇他长什么样的。”明日奈说。 “就很普通一男的。你觉得怎么样？这是歌词本。”布莱恩掏出草稿。 &quot;好，好，&quot;明日奈突然结巴起来，“就这个。” 新问题又出现了，就是这歌总得有个名字。本来照歌词的意思就叫做“孤独”的问题也不大，但明日奈当即反对： “不行，不能叫这个。‘孤独’已经被尼采写绝了，在他以后再怎么写都是无病呻吟。所以，换个称呼也好，叫这名字烂透了。” “你说叫什么好？” “提到了夜晚，有黄昏，就是没有黎明。叫《Nowhere Is Dawn》吧。” 思考了一阵，布莱恩说：“好。”但在这之后，她们并不会有机会把这首歌演奏出来给大众了，即使以后偶有人将这完成的作品翻找出来，或反复地听，或弹奏，但它也会注定成为历史的一粒灰，沉没后没有再恢复的可能。 ¶Section 4 又是几个月。布莱恩眼睁睁看着布鲁斯的眼窝深陷下去，他的眼镜框好像越来越大，像是要把他的脸整张地盖住，镜片玻璃把他的目光和呼吸全都隐在一片朦胧后。但布莱恩什么也没有做，因为她清楚，如果干涉效果必然事与愿违。 也没有让布莱恩等太久。星期五，布莱恩发现布鲁斯从座位上消失了一整天，但她并没从任何人口中听说布鲁斯请了假。直到那天晚上，布莱恩接到了布鲁斯的电话。 “我眼镜是不是在你的包里？” 布莱恩先是疑惑，让布鲁斯等等，然后用右手在包里翻找起来。没用多久就挖出来了一副黑色金属框的眼镜，镜片已经因为使用已久泛起淡黄色；镜框上，镜腿上，划痕处处可见。Briam家中没人戴眼镜，这想必就是布鲁斯的了。 “有的。还有你眼镜为什么会在我的包里？” “我太粗心了……能拜托你明天把眼镜给我吗？算我求你。”布鲁斯声音里竟有分毫的乞求，这乞求不仅毫无诚意反而让布莱恩一阵恶寒，但终究答应了下来。 “那好。”布莱恩已经知道布鲁斯家在哪里，便不再多言，切断了电话。 但那天晚上布莱恩翻来翻去，总难以平静下来。于是她回忆起刚才的那通电话，她总觉得布鲁斯的声音不像现实里听到的那样，倒像是——布莱恩不安地检索了一遍大脑——像具尸体，她知道不该那样想。可是，可是，布莱恩在心里逼问自己，为什么布鲁斯的声音里突然流出那么多的废然呢？她不敢再想，只好尽力转移自己的注意力，不久就陷进了睡眠中。 其实布莱恩睡得并不好，她的脑中萦绕着那张母带的影子，布鲁斯答应作词的时候格外爽快，布莱恩也很高兴，因为这省下了她很多精力说服其他人写词。事后想起来，布莱恩才发现布鲁斯当时的神态和行为都太反常了，就像是接受宿命的那种爽快。这绝对不是好兆头。 第二天，布莱恩决定步行去找布鲁斯。今天是个大晴天，虽然还早，但只属于夏天的炎热早就随着太阳升起辐射到大气中。晴朗的天空丝毫无法掩盖闷热，布莱恩撑在伞下，但汗水早流遍了全身。 “好吧，”布莱恩一边在太阳下喘气一边想，“谁让他的眼镜在我这里呢？” 布莱恩敲开门的那一刻，她吓了一跳——布鲁斯眼球深深地陷进去，就像一夜没睡。布鲁斯回答：“我没事，只是没有眼镜，看不清，只能这样看了……” 布莱恩理解地点点头，但心里存着更多的怀疑，于是她谨慎地观察布鲁斯，生怕他下一秒就做出什么灭绝人性的举动。还好他什么也没做，只是跟布莱恩说了几句废话，布莱恩打着哈哈，一边点头一边说着“是”“那好”之类的话，但布鲁斯像是没有察觉到一样，不停发表着漫长的演说。“奇怪”，布莱恩想，“他怎么这样了？”。布莱恩的疑惑很快会被事实解答。 事实上，布莱恩压根记不得布鲁斯都说了些什么，只记得他的情绪出人意料的稳定，与自己先前印象中喜怒无常的布鲁斯大相径庭。除此之外，就是离开时撒得漫山遍野的阳光了。布莱恩摇摇头，试图消去头脑中的思考残片。她成功了。 布鲁斯接过眼镜后一直没有戴，只是把它随手搁在自己的床上。布莱恩走之后，布鲁斯死盯着自己的眼镜，发了很久的呆，从日上三竿到太阳下山。 他看着眼镜，不知不觉他回忆起了他戴上眼镜的那天。在那之前，他记得自己总是受各样的训诫，其中之一就是保护好眼晴，不要近视。“怎么可能得近视……”布鲁斯还小就这样不听劝——直到日渐看不清东西后才想起来保护眼睛，但显然已经没有用了。不过，令他高兴的是，戴上眼镜之后，训诫的声音小了很多也少了很多，也可能是一天到头都戴着眼镜吧，近视的程度从未加深，这也未必不是幸运的事。这是他们两个相陪伴的第五年，但现在，布鲁斯不会再需要这对眼镜了。 像是刻意逃避现实和过去，布鲁斯闭上了双眼，一种久违的安全感顺着黑暗降临，蔓延上他的四肢，脊柱，然后是大脑皮层，这样的舒适几乎要让他落下泪来，因为，安全感确实不是唾手可得的东西。回忆的走马灯还在闪烁，但布鲁斯已经没有继续欣赏的耐心了，那就像是场已经被炒作到烂的电影，从万众瞩目到人见人嫌，只用了3年。看到这里，布鲁斯不禁笑出声来。布鲁斯如同驱走蚊虫一样，手不自觉地在眼前挥了挥。 布鲁斯起身离开房间，走到阳台上，阳台很大，他攀住栏杆，视线向外面的晚霞远远地投去。布鲁斯突然想起来小时候听的一句农谚：“朝霞不出门，晚霞行千里。”看来明天天气不错。布鲁斯想。他在的城市不知道为什么少见大鸟，自然也看不见沿海的地方才会有的黑尾鸥[6]，他很想看一次黑尾鸥，但现在看来只能留作遗憾了。不过夕阳特有的金黄中泛起的赤红色还是很让人眼晴舒缓的。正在夏天，这颜色并不会只吝啬地停留几分钟，于是布鲁斯看完了太阳是怎样掉进地平线的，这是他第一次看落日，布鲁斯觉得这感觉挺不错的。但再好的东西也会消失，当乌云重新占领天空，天上就只剩下阴翳。 布鲁斯自觉无味，就走回卧室，躺到了床上。他觉得活着也不是无可取之处，但自己已经没有别的退路了。布鲁斯连眼睛都没睁开，只向右一伸手，就探到了早搁在那里的药瓶——长期的神经衰弱让他不依靠药物才能勉强入睡，而半夜是否醒来完全看运气，最好不要，因为一旦醒来就只能独卧空榻与天花板共守到天明了。这种药的说明书上写每 24 小时最多吃一颗，布鲁斯从未逾这规则半步，不过他早想破坏这规则了。市面上通行的安眠药剂量不狠，所以布鲁斯想了个办法浓缩，让它的剂量不只是催眠这样平淡。 布鲁斯坐起身，把浓缩后的药丸泡进冷水，然后一饮而尽。其实浓缩后药依然是乏力的，布鲁斯直等了 5 分钟才产生一点困意。躺回床上，闭上眼睛后的一刻，布鲁斯把此生最后一次落日余晖刻在了心里。 布莱恩收到布鲁斯的死讯，已经是一个星期后了。起初布莱恩并没有觉出任何异常。连续一个星期不来学校对于布鲁斯不是什么新鲜事，所以布莱恩觉得这次也只是布鲁斯旧疾复发罢了。消息到时，布莱恩是格外愕然的。她的心底某处总是为这一天预演，但她没想到会来的这样快。虽然感到有点惋惜，不过，对于布鲁斯来说，如果不再有什么活着的动力，他自己也觉得并没有什么益处的话，那么，放弃生命，于人于己，的确都是最好的选择。 很久以后，布莱恩才知道，布鲁斯本来是可以继续活下去的，那一点安眠药要达到致死量还有相当的距离，如果发现得及时，可能布鲁斯能逃过一死，但他被发现时已经是第二天半夜了。怎么被发现的布莱恩至今不能得知。所以完全可以说杀死他的绝对不仅是药品，占更多的是他求死的信念。 让布莱恩感到有点安慰的是，安眠药致死不会让人受苦，比睡着还快。 ¶Section 5 布莱恩的邻桌一直空到离开高中，这期间布莱恩遗忘了她的乐队。她的杂事好像永远都无法结束，甚至无法抽身做自己真正喜欢的事情，连自己在忙什么也不得而知。时间久了，布莱恩甚至忘记了吉他应该怎么按和弦，这不完全是玩笑，当她架起那一柄吉他想复习大 F 和弦[7]时，发现无论怎么调音，吉他发出的声音不仅没有音乐感，反倒像是哀鸣。布莱恩叹口气，算是同过去的自己作了告别。 以后的故事看去是顺理成章的。布莱恩已经忘记了怎么弹吉他，那她的乐队也再没有存在的必要了。不过，令她没想到的是，像是两人心意相通，布莱恩刚打算打电话给明日奈，就抢先收到了明日奈发来的见面消息。 见面地点是在某处公园，布莱恩不甚熟悉，但天底下的公园大同小异，布莱恩很快找到了约好的树下。 今天天气不好。风吹不透乌云，天上黑压压的，却总也下不起雨，于是单位体积里巨大的水汽量就平等地折磨每一个人。布莱恩不知道为什么选这样的一天见面，只能耐心地等。没有等多久，明日奈矮矮的身影，出现在树的右侧，气氛着实尴尬，两人都知道为什么要见面，但见面之后却连一句完整的话都组织不出来。最后还是布莱恩打破沉默： “怎么突然叫我出来。” 没有回答。明日奈先看天上的乌云，再踩了踩几片落叶，下定了决心才开口： “我以后会很忙，乐队的事情做不成了·要不咱解散吧。” 同样没有回答。布莱恩并不认真地分辨明日奈说的什么，因为她的注意力同样全在天上悠悠划过的乌云，沉重得好比秤砣，一瞬间布莱恩甚至期待这么多乌云全部都一起塌下来，埋住所有人。“那好吧。”布莱恩不相信那是自己的声音，但也是这句话，把布莱恩拉回眼前行将分离的乐队。明日奈会意地点头，背上背包，离开了大树。 一片泛黄的叶子在枝头摇摇欲坠，布莱恩自言自语：“一叶知秋啊。” 布莱恩心里最后一块石头落了地，从此往后就再没有什么值得注意的事了。这期间布莱恩搬了好几次家，其中遗忘遗失了很多东西，最狠的一次，布莱恩忘记了一本相册集，里面存了布莱恩许多小时候的照片，虽说现在数字化手段足够强，把布莱恩的照片存到移动硬盘的工作也是早完成了，但是，有旧照片的人都知道，如果没有旧照片上斑驳的黄色氧化痕迹，那看起来纯纯一假照片，就好比自己从来没有拥有过那段时间一样，这是布莱恩翻看硬盘里的照片时，最最直观的感受。 不过，有一样东西，布莱恩从来没敢忘记，那就是她那把破吉他。布莱恩不知道为什么留着这个累赘，也有心把它扔掉，但她每次下定决心，执起琴身时，心中总油然生出一股不安，终于作罢。布莱恩参加工作后辗转六七个城市，都是如此。每当布莱恩看到吉他袋子上星星点点的白色霉斑，手抚摸起她终身难忘的几道木纹，就隐隐约约有哭的冲动，像是要从心肺里冲出来，把布莱恩整个地裹进悲哀里。虽然谈不上喜欢这种感觉，但这是为数不多让布莱恩觉得自己活着的时刻了，这就是狠不下心的原因吧。布莱恩安慰自己。 ¶Section 6 几年过去了，一个深夜，布莱恩支撑着一副充满了乳酸的身躯搭着末班地铁，走到了家楼下。虽说是走，却比爬还慢——布莱恩是蹭着走的，踏上几步就会打个盹，老天可怜，布莱恩一路上没有遇到一个人，也没有尸体，只能听见远远传来的猫头鹰啼。布莱恩想，如果一直是深夜的话，也很不错吧。 布莱恩“啪”地打开门，再“啪”地打开灯，家里空荡荡的，墙上的时钟告诉布莱恩已经是第二天了，布莱恩轻轻叹了口气。这样的生活已经一个星期了，布莱恩觉得自己已经成了一具会动的死尸，不知道明天和希望在哪里。布莱恩鬼使神差地走进卧室，从床底抽出吉他，手不自觉地弹了起来，布莱恩相当惊讶，但还是试图照着旋律唱出来了。 Look at the stars Look how they shine for you ............ All the things you do... 上一次奏起这首歌是什么时候呢？有七年了吧？布莱恩不很肯定，因为她激动得浑身震悚，她觉得终于找到以前的自己了，这种快乐简直像是幻觉。不知不觉，布莱恩眼泪决堤了。 于是布莱恩抬起头来，在一片雾茫茫中，她突然看见布鲁斯的身影。像是早有预料，布鲁斯问道：“我说的没错吧？” 布莱恩说不出话来，布鲁斯走到她跟前，表示理解地拍了拍她肩头。布莱恩一开始的兴奋突然荡然无存，低下头啜泣着。她不清楚自己为什么哭，但是没关系，没有来由的哭才是最能抚慰人心的。布鲁斯看着布莱恩，眼神中充满了怜悯。 布莱恩呜呜了好久，终于下定决心不哭了。擦干净泪水，抬起头刚想说些什么，却发现布鲁斯已经消失不见了，布莱恩只能感受到肩头他留下的余温。 布莱恩顺着卧室门看出去。先是空气，再是挤破天穹的繁星。 2025.5.27 (The end) ¶脚注 1.〔《Yellow》〕 英国摇滚乐队酷玩乐队演唱的歌曲。由乐队四位成员克里斯·马汀、盖·贝瑞曼、强尼·邦蓝、威尔·查平共同填词，肯·尼尔森和乐队四位成员共同制作。 这首歌被收录于乐队的首张专辑《Parachutes》里，并于2000年6月26日作为专辑的第二支单曲发布。 ↩2.〔硝酸甘油〕又称硝酸甘油酯、三硝酸甘油酯、硝化甘油，化学式为C3H5N3O9，简称NTG，是甘油的三硝酸酯。是微挥发性无臭油状液体，具有甜味、芳香味和刺激性。硝酸甘油是一种爆炸能力极强的炸药，同时，在医学上也被用作血管扩张剂。 ↩3.〔《灰色轨迹》〕电影《天若有情》插曲。由刘卓辉作词，黄家驹作曲，Beyond 编曲并演唱，收录于 1990 年 5 月 31 日发行的专辑《天若有情 电影原声带》中。《灰色轨迹》创作于 Beyond 低潮时期，该曲以简洁而富有张力的曲调，配以明亮而有力量的吉他和打击乐，描述了一个人于生活中迷茫和彷徨的心境，同时也揭示了人们在追寻梦想与现实之间的矛盾和挣扎。 ↩4.〔卡祖笛〕是一种极为特殊的管乐器。它通过人声哼唱发出的声音，依靠自身的膜片和共鸣管的声音放大，发出嘶哑的音色，类似萨克斯管。 ↩5.〔闪存卡〕利用闪存技术达到存储电子信息的存储器。一般应用在数码相机，掌上电脑，MP3等小型数码产品中作为存储介质。样子小巧，有如一张卡片，所以称之为闪存卡。 ↩6.〔黑尾鸥〕（学名：Larus crassirostris）是一种中型海鸥。身长约45厘米，翼展120-128厘米。分布于东亚地区，包括中国、日本和韩国，也会到阿拉斯加至北美洲东北部分一带漂泊。黑尾鸥喙末端上有红色的斑点。幼鸟褐色，嘴粉色，尾黑，需要四年才羽翼丰满成长为成鸟。会发出像猫叫的哀怨叫声，所以在日本被称作“海猫”，在韩国则为“猫鸥”。 ↩7.〔大 F 和弦〕因其指法特点又称作“大横按”，是由 4、6、1 三音叠置构成的大三和弦，是 C 大调的 Ⅳ 级下属和弦，是小调式的 Ⅵ 级和弦。 ↩","link":"/articles/nothing-dawn/"},{"title":"一道物理小题","text":"没 blog 可写的时候，Neko 给了我一道物理题。 原题： 文字版： 科考人员从山岭前坡向山势险峻的背坡投掷追踪器来跟踪动物活动路径。山岭可简化为如图所示的 \\( \\triangle{ABC} \\)，\\( \\angle{BAC}=30 \\degree \\)，\\( \\angle{ABC} =60 \\degree \\)，科考人员在前坡的同一点 \\(M\\) 投掷追踪器。第一次以大小为 \\( 5 \\sqrt{7}\\ ~ \\text{m/s} \\) 的速度投出，追踪器恰好沿背坡表面向下滑动；改变速度第二次投掷，追踪器刚好水平掠过 \\( C \\) 点。重力加速度 \\( g=10\\ ~ \\text{m/s}^2 \\)，忽略空气阻力，两坡足够长。求： (1) 第一次掷出时的速度方向与 AC 夹角的正切值\\( \\tan\\alpha\\)； (2) 第二次掷出后，追踪器在背坡落点到 \\(C\\) 点的距离 \\( L\\)。 我们用 draw.io 画一画这道题的示意图： ¶（ 1 ） 以 M 为原点，AC 方向为 x 轴，BC 方向为 y 轴建立直角坐标系。容易发现当追踪器抵达 C 的时候，追踪器在 y 轴上的分速度为 0。 于是可以得到，重力加速度在 y 轴上的分量 \\( g_y = g\\cos 30 \\degree = 5 \\sqrt{3} ~ \\mathrm{m/s^2}\\)，在 x 轴上的分量 \\( g_x = g \\sin 30 \\degree = 5 ~ \\mathrm{m/s^2}\\) 这样，结合刚才说到的，追踪器抵达 C 点后速度平行于 BC，就得到了两条方程： $$ v \\cos \\alpha - g_x t = 0 \\ v \\sin \\alpha - g_y t = - v \\sin \\alpha $$ 其中 t 表示运动时间。 解方程，先将式子化简， $$ 5 \\sqrt{21} \\cos \\alpha = 10 \\sqrt{7} \\sin \\alpha $$ 所以， $$ \\tan \\alpha = \\frac{\\sin \\alpha}{\\cos \\alpha} = \\frac{5 \\sqrt{21}}{10 \\sqrt{7}} = \\frac{\\sqrt{3}}{2} $$ 且 t = 2 s。完成。 ¶（ 2 ） 因为我用 draw.io 不熟练，这一节我就不打电子图了，看下面的演算过程吧。如果有需要我会考虑做一份电子图出来。 这道题的暗示相当明显，追踪器刚好水平掠过 C 点，意思就是，当追踪器经过 C 点时，竖直方向的分速度为 0。也就是经过 C 点后，追踪器做加速度为 g 的平抛运动。记 v’ 为初速度，θ 是 v’ 和水平面的夹角。 先根据 （1）算出来 M 到 C 的距离 lMC = 10 m。于是， $$ -(v’ \\sin \\theta)^2 = 2gl_{MC}\\sin 30 \\degree $$ 解得 v’sinθ = 10 m/s。记掠过 C 点前用时 t1， $$ (v’ \\sin \\theta) t_1 - \\frac{1}{2} g t_1^2 = 5 \\text{m} $$ 解得 t1 = 1 s。所以，设掠过 C 点时速度为 vm， $$ v_m = \\frac{l_{MC} \\cos 30 \\degree}{t_1} = 5 \\sqrt{3} ~ \\text{(m/s)} $$ 后面就是简单地计算平抛运动的位移。 $$ l_x = v_mt_2 \\ l_y = \\frac{1}{2}gt_2^2 $$ 而且我们知道 \\( \\frac{l_y}{l_x} = \\tan 60 \\degree = \\sqrt{3} \\)，因此容易算出， $$ L = \\sqrt{l_x^2 + l_y^2} = \\sqrt{(15\\sqrt{3})2+452} = 30 \\sqrt{3} ~ \\text{(m)} $$ 完成。 ¶演算过程 这一节主要是为了放我的电子版草稿，以证明我是靠自己做完这道题的。 另外给大家看个挺离谱的东西。我做出来之后突发奇想拿这道题去问了两家 AI：豆包和深度求索。TA 们的解题过程都挺有意思的。 ¶豆包 但凡动脑想一下就觉得不对。前坡已经有 30° 倾斜了，如果 tanα 是根号三就代表 α = 60°，敢情科考人员做的是相对于地面的竖直上抛？ 而且 TA 还有模有样地给出了答案和明确。 豆包给的思路是没毛病的，但是计算能力差点意思。（因为豆包跟我一样都是在 M 点建立直角坐标系） 原对话地址🔗 ¶深度求索 答案是正确的，但是用的方法非常复杂，甚至用到了解析几何的知识。在这一题里用解析几何就是杀鸡用牛刀了。 看用时，居然用了接近五分钟。而且其中的一些思考过程比较复杂，就不在这里一一列举。 原对话地址🔗 (The end)","link":"/articles/a-simple-phys-problem/"},{"title":"不会再有的地方&#x2F;&#x2F;Lieu Évanoui","text":"他们回首望去，眼中满含泪水，//看到东方那乐园的大门紧闭，//火焰的剑在他们面前挥舞，//无情地阻挡了他们的归路。//他们只得转身，面对荒凉的世界，//步履沉重，心中充满无尽的悲伤。 ——约翰·弥尔顿《失乐园·卷拾贰·陆肆壹~陆肆陆行》 分班了。就这么确确实实，明明白白地分班了。与此同时宿舍也大换血，恐怕我今后是很难再见到能陪我聊到凌晨两点的人了。 写点东西吧，算是纪念那段回不来的日子。 当卡尔离开的那一刻，他不会知道，在将来的某个星期三晚上他不会想起曾在那逼仄的阳台看到的星光，也不会想起曾经挤在一个人口密度一千二百万人每平方千米的地方嘻嘻哈哈。因为那是以前的事情，现在不会有，以后也不会有。 但卡尔没有忘掉当他看着空荡荡的 404，心里的寂寞和失落——事实上，这失望会裹挟着人的心。当夜深人静时，它会从没有人看到的地方迸发出来，就像路西法从天坠落。 阳光穿透这里的空气，微风能拂过这里每个人的脸颊，月亮还是散发着它数十亿年始终如一的光芒。但那是以前的事了。未来的事情太遥远，从现在来看未免有杞人忧天之嫌。 不过，卡尔还是妥协了——也是没办法的事。所以他踏入门，看着这个给过他很多欢乐的地方。现在恰是暮春，太阳不大猛，刚刚好能给室内的一切蒙上层时间的尘埃，于是风顺着阳台卷入，卷走了卡尔最后一丝希望。该走了。 背对着阳台，卡尔呼吸急促。他清楚只要他离开这个房间，以后就很难再有回来的机会了。这间宿舍里即将搬进来的人他一个也不认识，更没有兴趣培养新的关系，大概是高中生的并发症。卡尔抱着最后的一点信念，回头看了一眼：跟他刚来时一模一样，床架整齐地摆在两侧，阳台正对着出口，不时有几股清风从中穿过，划过卡尔的脸颊——这风太温柔，让眼泪几乎要从他的眼眶落下来。该走了。 卡尔在关上门之后没有再回头，他害怕自己控制不住自己。该走了。 注：标题双斜线后是法文。","link":"/articles/Lieu-Evanoui/"},{"title":"【清明节特刊】乐评：碎月群岛BrokenMoon Islands","text":"这是一个发生在很久很久以前的故事，发生在传说中的碎月群岛。 版权声明：本文封面图使用了原地图文件中打包的世界地图，使用的 &lt;iframe&gt; 嵌入仅供演示和辅助本文对于《碎月群岛（Piano ver.）》（原作：幻影刃shadow）和《Minecraft生存 - 碎月群島》（原作：舞秋风）的评论。使用到的非本人创作素材版权均属原作者所有。 ¶在故事的开始 ↑这是作者上传到网易云的版本，欢迎前往支持。 ↑这是作者在 bilibili 上传的版本，点击即可访问原网站。 作为一个呜帕，当我听到这段旋律又一次回响在我耳边时，我的心里其实是很又难过又感慨的。难过在无法回到当年看舞秋风一看就是一个下午的快乐，感慨在居然有人在这个流量至上的时代依然记挂着秋风。 然后我反反复复地听，越听反而越能找回最初的感动，于是萌生了为这首钢琴曲写一篇小乐评的想法。毕竟世界上再也找不到像这样的钢琴曲，像一部散文集一样讲完一个完整的故事。 ¶在故事的中间 按照它给人最直接的听觉感受，我将整篇谱子划分成五段： 00:00 ~ 00:20 楔子 00:21 ~ 01:34 开篇 01:35 ~ 02:52 中间 02:53 ~ 04:48 后面 04:48 ~ 05:08 结束 你的爷爷是个隐居在碎月群岛, 一个很偏僻的群岛的老人家。 有天你乘着船打算去探望很久没见的他, 但到了他家后，却发现他已经去世一段日子了…… 你在他的家里发现了他的遗书。 上面写着他一直很想去探望在其他岛上的老朋友, 但碍于行动不便,所以一直没办法去。 你得悉这件事后, 你就觉得你应该帮爷爷完成他没能完成的事情… （为了方便描述并且适应我压根不懂钢琴的需要，弹奏部分就用左右手示意弹奏的乐句） ¶楔子 以左手伴奏入场，右手弹旋律。虽然这时候右手相对全篇来说非常的青涩，但是考虑到《碎月群岛》可以理解成主角登岛前发生在主角爷爷身上的故事，青涩感就有了源头。事实上，楔子部分很大程度上呼应了结束部分一阵爆发的感觉，这个我们后面再说。 可能有些可笑，但是楔子部分好像在说“接下来我要说一个‘神威难藏泪’的故事”，如果仅从字面意思上解读的话“神威难藏泪”是很合适的：即使后来经历的事情越来越多，但人童年的时光绝对难以消去。正所谓： 幸福的人用童年治愈一生，不幸的人用一生治愈童年。 当然，无论幸不幸福，它就在那儿。 ¶开篇 这一段的编曲（我认为）相对大胆。首先为了承接楔子，依然是左手伴奏右手旋律，不同的是，旋律的存在感强了很多，这也意味着：故事开始了，请你坐下好好听我说吧。 虽然说是伴奏，但是左手在乐曲行进中慢慢凸显出来： “这是爷爷也曾有过的青春。”我想。 右手虽然因为反复而略显单调，但是左手右手交替进场弥补了这一点，这样的单调感贯穿了整首曲子，这也是独属于碎月群岛的旋律：单调，但是在平凡中看到了破碎的闪闪月光。 事实上，碎月群岛便得名于此：群岛结构支离破碎，拼合起来又恰好是月亮的形状。 ¶中间 这一段的编曲突然昂扬了起来，并且因为和弦大量运用，声音变得十分响亮，但是丝毫不破坏原曲给人的舒适感。 中间编曲有点人青年时期的味道，相当的燃，就是人青年时光芒万丈的样子，似乎整个世界都在你的手里，尽管你的世界只有群岛上的一片洼地。 当然，我不敢臆测在主角登岛前岛上的日子是怎么样的。不过当听到中间部分依然激烈，但仍然留存着一股挥之不去的忧郁感时，我就知道，这一段故事并不是什么英雄往事，它只是一个普通人的故事，没有什么慷慨的陈词，古往今来的英雄很多，唯独不在碎月群岛。在这片土地上只有普通人，像一个普通人一样度过这一生。 确实，如果世界上全是英雄，而没有普通人，世界是绝对运行不下去的，因为普通人才能在一代又一代中被砌入大厦，成为代价。 离别后的夕阳是如此的美丽 你也应该是知道的吧 ¶后面 后面部分也是全曲的高潮段，我想破脑袋都想不明白作曲人是怎么作出这段旋律的。一种爆发的感觉充满了五线谱，左手在之前一直作为伴奏处理，但它在这一段发挥出了 C 区和弦的作用，感情宣泄全部都在这一段了。 什么感情呢？我认为有两种：一种是对群岛的不舍，一种是作为听众的我们，已经从作为观众的小朋友长成现在这样大，失去了当初的天真（其实也是对碎月群岛的不舍吧）。 听到这里，我的眼泪快被听下来了：在我的童年里，秋风占了很大一部分，直到今天我对 Minecraft 依然抱有这么深厚的感情，秋风功不可没。千言万语汇到指尖竟然无法成句。就留在这里权作为纪念吧。 ¶结束 这一段作为收尾，自然而然编得十分平静，同时呼应了最早那一段平静的感觉。每个回到碎月群岛的人都发现这里改变不大，但这里已经没有人了。 引用一些语录吧。 就像是花开会花谢一样。 花开的时候，花团锦簇，五彩缤纷，生机勃勃，欣欣向荣，让人心生欢喜！ 花谢的时候，满眼残败，一地破碎，让人感伤！ 回不去才让人失落，可以回去是最大的谎言，那里没有人才是真实的 我忘不了小时候电视机上面的那张两个宝宝的图片，不是因为我想念它，而是想到了过去躺在床上，没有忧虑，总是能在看电视时注意到图片，很容易快乐的自己 资料来源→ ¶…… 其实，我姓名下方的 The Rekalyab Islands 就是来自于当年看秋风时学到的 BrokenMoon Islands，每次看起来，不得不令人感慨万千。 如果可以的话，多去支持秋风吧，这是作为一个呜帕最希望看到的事情了。 (The end) ¶参考资料： 【全站最高清!!!】舞秋风Minecraft 碎月群岛 BrokenMoon Islands - 【钢琴改编】舞秋风碎月群岛BGM 九年了，你还记得爷爷的墓吗？ 碎月群岛（Piano ver.） 舞秋风个人主页","link":"/articles/BrokenMoon-Islands/"},{"title":"五月二十五日记","text":"¶…… 我也不知道为什么要写这个，可能是因为我再也没有力气维护一段注定破裂的关系了。 最近几个月一直过得很不好，各种各样的坏事几乎是接连不断地涌过来。小白很早就听过一段话，大意是说人的苦难不是劈头盖脸地朝人一股脑地来，而是一件一件麻烦事接踵而至，颇有一波未平一波又起的意思，听起来就是很煎熬的。事实也大差不差，至少我经历的是这样。其实要说有没有什么值得大发牢骚，恨不得把整件事都一起杀死的那种事情，我现在也想不到。就是因为心情很差，才打算写下这些文字。看的不舒服的话，就关闭这个标签页吧。 不过真要写的话，小白还真不知道从哪里写好一点，毕竟事情千头万绪，牵一发而动全身，就好比一个无解的拓扑排序[1]，从哪件事开始都不合适。这样想来，小白还是觉得，从事情开始来说，也算是个楔子。 事情开始的比较早，距离现在接近一年——其实就是我中考往前的一段时间。那时候小白的学业成绩还算不错，说起来在我读的初中里也能在前五名争夺一番，不必多言。大概也是在那样轻松的环境里，小白并没有多么认真地学习，再加上小白读的初中向来是自由软件[2]的积极践行者和忠实捍卫者，因此小白在读初中时过的日子是非常轻松且快活的。具体说说的话，每天早晨六点十五分前后到学校，然后上课上到十二点，再就是下午的课和晚自习，晚自习之前还可以抽出三刻钟打打羽毛球，每天都是这样。老师们都很和善，相当友好。因此虽然在学校的时间很多，但也并不那么难以忍受。 我在的地方是个小小的县城，再具体一点的话，这个县城隶属于我这个省级行政区贪污腐败最厉害的一个市。与此相反的是，像初中老师一样的公职人员，连工资都很难到手。因此老师们常戏称，抓一个贪官就好了，一个贪官落马整个区的老师能出好几个月的工资呢。当时我也挺单纯的，不明白这些话的内涵，现在想起来，这不完全是玩笑。不过，我的初中老师都是格外尽职尽责的，可能是因为规模比较小（初中部的一个年级只有 6 个班，小学部不知道），教书用的精力也少，也就可以抽出比较多的时间来安排学生的课业。哦对了，还有一点比较引人眼球的，就是我初中的校服是非常亮的鲜黄色[3]，导致了我这个学校的学生，好像生来就比别的初中差一等，以至于被人戏称“龙袍”，而这仅仅是因为颜色相对怪异一点罢了。 不过，客观地来说，一直安逸地生活，对人的无论是身体还是大脑，都是很有害的。“生于忧患，死于安乐”的道理早在两千多年前孟子就提出来了，直到现在它还在发光发热。在这么舒服的环境里，小白的斗志也一点点被消磨了。区一模和二模的成绩无时无刻不在提醒小白：你很有机会去市里的高中。人都是喜欢向上爬的，小白也不例外，而且父母也答应了，只要能考到市里的高中，就给我买一台手机。这里无所谓新不新，因为在这之前我根本没有手机，也就无从谈起新与旧的概念了。所以中考前的日子我是相当野心勃勃的，但也正是这虚假的希望蒙骗我了六个月。 所以啊，小白觉得，总是对遥不可及的东西抱有希望的话，是很应该反复思量是否值得的，毕竟到时候愿望落空，也不至于在倒苦水的时候连个由头都找不到，因为这都是自找的嘛。小白的中考成绩相当可惜，差了大约三分就能去另一所市区内的高中，其实也有一部分是运气因素。这里说的运气确实不是小白给自己找了个借口，我参加的是 2024 年中考，而这一年的中考有一个相当恶心人又蛋疼的政策：英语成绩缩水为原来的 90%。小白最擅长的就是英语，在满分 120 分的前提下，常年是能考到 116 往上的，虽然现在不是了。小白中考英语记得是 106.2 分，也就是本来的 118，如果多了这 11.8 分也许小白今天就不会坐在这里敲出这些文字。不过后来也看开了，一切都是最好的安排，这是小白的初三数学老师常常说的话，但其实我还是有点难以接受的，因为小白在高中的这几个月过的一直很不好，去到一个脑海中完全陌生的地方也不见得能稍微笑出两声来。 好了，既然把这些事情的前传都提了一下，那我觉得可以开始说说后面的事了。小白不是一个很讨人喜欢的人，这里说的“讨人喜欢”可以指任何人，当然互联网上另说。现实里的人实在是很难弄清交流的边界在何处，换句话说，我并不能仅仅通过猜测就能把握好交流以至于交友的方法，更糟心的是，猜测是我唯一做的到，而不至于引人仇恨的方法。如果不引人仇恨，我完全可以通过跟相熟的人旁敲侧击一番，获得了点基础信息，下面的事情也好办。所以问题还是回到了小白自己的身上。虽然类似“交友指南”的流媒体在网上一找一大堆，但那些的创作者已经不是学生了，更有甚者都是仅仅面向女生的哇。再说了，小白也不屑于参照那些方法，因为压根没有用。既然视频的创作者脱离学校已久，那自然不可能了解学校的生态，因此发出的意见只能是毫无根据的意淫罢了。 这样想来，相对好点的成绩也在一个侧面上帮助了我。小白最喜欢和人聊天，几乎什么人都聊得起来，这就需要其他人对小白的好感。但是其他人对小白的好感都是有条件的好感，这里的“有条件的好感”同样适用于任何人。这个条件多种多样，缤纷多彩，但总是能给利用这条件的人带来很多好处。我一没有钱，说没有钱还不算准确，简直是穷得叮当响，小偷来光顾都只能望洋兴叹，所幸是没有达到负资产；二没有帅气的脸，三没有权力。本来这三点在我待的这功利主义的具象中是足以致命的，但是天还是给小白留了一个下水道口：就是上面提到的好成绩。好成绩这东西小白本来是不稀罕的，甚至有时候讨厌它讨厌到恨不得就此扔掉，它给我带来的麻烦已经让小白难以承受了。但小白有什么资格谈讨不讨厌它呢？好成绩让别人愿意与小白打交道，老师也能常给小白一点好脸色看，别的不说，至少有个心安。或许从我这个例子就能推理出为什么“交友的方法”只适合女生了。 但是小白也不是一开始就是抱着上面说的心态与人交往的。仅仅是几个月前，小白还是很单纯，很无忧无虑一个人，可能在那样的心态里，也更容易写出来好比《The Edge of a Decade》这样相对轻松的作品。不过我现在读起来，反而是觉得非常的沉重了，大概小白的潜意识从那时候就开始腐化了吧，不然其中很多的字句怎么可能会有如此特殊的味道？但是很令小白难过的是，很多人都把它读得相当片面，与小白的本意相离甚远了。不过无所谓吧，本来就是因为追求自由才写出来的小作品，也不苛求什么了。但是，如果要小白现在再写一篇类似的作品出来，是不可能的，因为小白已经不是六个月前的那个小白了。 嗯，在这期间也发生了几件事，也一起拿出来说一说吧。小白的班主任（虽然非常不愿意承认，但这是事实）是一个所谓的，这座高中里唯一一个博士学位的教师。但小白非常讨厌他，他总是拿它那套山河四省的教育模式来死死约束小白班里的同学们和小白自己，并且为此有一套格外离谱的说废话技能，每天都要听像他这样的人在耳边如同蚊子一样嗡嗡嗡，实在是倒人胃口。写到这里，实在是不得不叹气，拜托，少来了。并且他眼中的学生都是应该思想好（乔治·奥威尔《1984》）的，如果有一点违逆他的，下场一定好不到哪去。他绝对是有学校在背后撑腰，这是不争的事实。因为小白的学校正在制造一种不可见的恐怖，这么说是因为平日里体会不到这种恐怖的实体，只有在亲身经历这种恐怖之后，才能知道学校外自由生活的美好，相比之下，可能死亡更像是温柔。并且，小白的学校是会进行网络审查的，他们会安排人专门在微博，贴吧等各种各样的 BBS 搜查学生发泄对学校不满的证据，一旦被发现就不堪设想。为此甚至逼得小白得在 GFW 以外的地方大发牢骚。相当奇怪的是，小白以外的人似乎压根没察觉到这种恐怖，可能是他们太热爱母校了吧。我不热爱，我对这种垃圾场不可能产生一点好感。 2024 年 12 月，小白跟人打架了。原因就是小白看那个弱智非常不顺眼，所以动手了。后果显而易见，小白被罚写了 2,500 字的检讨，毕竟是小白先挑起的，事后也没有什么怨言，但是那个天才班主任又以一副无所不知的样子跳出来了，教育了一番不过瘾还给小白安排了个累活。就在这件事发生后的下一个星期，小白因为赖床被锁在宿舍里，又被罚了 1,000 字的检讨。班主任威胁小白，你再敢干这种事情就把你家长叫过来。小白真想顶嘴：“我没有家长。”但最后还是没有这个勇气，因为小白的力量太弱小了，家长虽然说生了小白养了小白但从来没有一次是向着小白的，他们宁可信任一个连脸都没有见过的人，都不愿意听听自己养了十几年的孩子的想法。我也没有什么想法就是了，有了想法说出来不照样是挨骂？所以我在家里呆着的时候，总是会有很失望的感觉。对于中国教育和中国家庭，我再也没有一句话能说，因为切身体验之后，只剩下了劫后余生的侥幸。再说了，互联网上很多人剖析这些都比小白这种片面的观点要完备得多也清楚得多，所以我不想浪费我的精力分析这种毫无价值的东西了。 现在的小白已经单方面停止结交新朋友了，处于无线电静默状态，还是挺舒服的。印度的非暴力不合作[4]最后回到了原点，一败涂地，不知道小白的非暴力不合作能够坚持多久，小白希望久一点吧。小白的非暴力不合作是针对任何人的。小白唯一能做的就是什么都不做，突然觉得很悲哀，不是吗？ 说点轻松的吧。小白的学校很多人谈恋爱，引得小白也有点向往，如果能找到一个能聊得来的异性，那也不能不称是件美事。但也只是想想而已，毕竟就凭小白这个相貌，真能谈上对象也应该是很久以后的事了。不过，虽不能至但心向往之吧，小白在一开始还是会和邻桌的女生有意识地搭话的。可能因为是一开始，第一印象比较空白，她也看起来比较愿意跟小白聊聊天，小白挺开心的。但是后来也无疾而终了，原因不表。直到后来小白发现自己并不是那么讨人喜欢，才渐渐地死了这条心，也不谈遗憾不遗憾，还是错在自己吧。 后来加了很多人的微信，翻看他们的微信朋友圈时，每天都能看到他们在自己的朋友圈发一些“我很自卑”“没人爱我”之类的……所谓文案吧。 像这个样子，仅仅作为示例。看到这些小白总有种哭笑不得的感觉：姐们你都用上 iPhone 不知道多少了还这样说话吗？是，这样的评价可能确实太偏颇，可能她的确遇到了自己迈不过去的坎呢？可能她的生活跟自己的以前相比起来差别很大呢？再或是，可能她以前很好，现在很差，以至于无法接受这种落差了呢？可是当小白看到那些平时过的不错的人抱怨自己的人生如何如何不顺自己的心意，再对比小白自己已经腐朽的生活，不能不哑然失笑。他们倒成了万青歌曲中的“Singing only love songs, they do not see the tanks.”的那种人了。这一段好像也是说自己的事情，无所谓吧。 我过的很不好，话又说回来了，跟以前的……朋友吧？一个个绝交，心里也不舒服，但最后还是不作为了，这应该是法学里提到的主观故意[5]吧。所以对于我来说，我已经再也没有精力去维护一段注定破裂的关系了，并不是我没有多余的精力，而是那样的话……太累人了，实在是太累了。我现在只想尽可能轻松地活着，看着富哥富姐们纸醉金迷的生活，一对比我自己，悲哀就又出来了，我能做的就是什么都不做，扭过头去不看，装成很热爱生活的样子。这又一次让小白想起了《1984》里描述的一类人：思想犯。只有具有“双重思想”的人（通常管他们叫做思想警察）才能把这种人揪出来，让思想犯在行为中流露他们的思想。我在阅读这一段的时候，心里是毛骨悚然的，如果现实里这种双重思想的人以此为乐，那对于小白来说，实在是一件很恐怖的事情。 最近了解到了一个观点，长期焦虑会导致记忆力降低，再对比小白的现状，小白发现这种观点是很有道理的。小白找不到对抗焦虑的方法，因为生活的腐化就是导致小白焦虑的元凶，而生活的腐化又是来自于现实。我出生，长大在小县城，可能死的时候，落叶归根，也是要回到小县城。而我现在遇到的人们，大多是无法找到我理想的善意的。所以我喜欢互联网，网络上的大家似乎都有很充分的耐心陪我聊天，说说话，教我很多事情，哪怕有时候他们的话很刺耳，但是我也是确确实实学习到了很多东西，这就是互联网的价值吧。现在我日益觉得互联网是个很棒的东西，但我在高中是经历非常严重的网络审查与封锁的，这又是一个让我叹息的地方。高中的屁事真多，如果可以的话，我想要杀死这些伤痛，不要再看着美好的东西离开自己了。 如果你看到了这里，那你真是相当的耐心，谢谢你。 突然发现了一点好玩的。我在写完之后上网冲浪，就发现了一句非常适合概括我现状的话：“学校并不比社会简单，人闲事就多。” (The end) ¶引用和脚注 焦虑了，为什么会导致记忆力减退？-心理学文章-壹心理 县城 - 刘森 - 单曲 - 网易云音乐 1.维基百科：拓扑排序 ↩2.这里只是借用自由软件的内涵，并不是真的全民开发自由软件的学校。恰恰相反，小白的初中是个技术浓度很低的地方。 ↩3.Encycolorpedia：#ffff21十六进制颜色代码 ↩4.维基百科：非暴力不合作 ↩5.维基百科：故意，法行宝：刑法关于主观故意与客观行为的规定 ↩","link":"/articles/May-25th/"},{"title":"修复成功MVP结算","text":"卡尔白在搭建好博客之后，觉得 Hexo 提供的模板不合乎自己口味，就在 GitHub 找了个喜欢的模板。经历了九九八十一难终于把参数调对了，就在准备发布的时候，意外发生了： 突然之间，页面消失不见，所有的条目都不能访问。他对着机箱发怒了一刻钟，毫无效果后只能老老实实翻配置文件。这是修改前的代码块： _config.icarus.yml123456789101112131415# Alipay donate button configurations - # type: alipay # Alipay qrcode image URL # qrcode: '' # &quot;Buy me a coffee&quot; donate button configurations - # type: buymeacoffee # URL to the &quot;Buy me a coffee&quot; page # url: '' # Patreon donate button configurations - #type: patreon # URL to the Patreon page #url: '' 问题很明显了，其中的分隔符 - 没有被注释，但我还是排查了好久才发现原因QwQ。所以只要把这些 - 前加上 # 就解决问题了。 要是不这样的话，整个网站都会消失，该死的 yaml…… 最后附上一张图，这是我修复成功的结算画面：","link":"/articles/repair-success/"},{"title":"公告板","text":"开了个新站 Karlbaey’s Shorts，以后可能主站发的会越来越少了…… 一是因为主站的东西太臃肿不好加载，二是因为发评论并不怎么方便。现在改的话遗留问题太多不好解决。这是今天的公告。 Karlblogs 的邮箱换成 office@karlbaey.top 了。2025-06-08 卡尔白","link":"/articles/ANNOUNCEMENT/"},{"title":"十年边缘&#x2F;&#x2F;The Edge of a Decade","text":"观前提醒： 这是以前的故事。本文含有较为直白的性描写，不适合 13 岁以下人士观看。 任何意见请在评论区或真理博客版反馈。 Section 1 在弗莱明刚认识卡尔白的时候，他还只是个三位数加减法都不会的小男孩，而卡尔自己也只有单马尾一种发型，直到现在也鲜少改变。弗莱明还记得卡尔搬来的那天：他坐在家门口，看着一个一个蓝衣蓝帽的搬运工将一个又一个大纸箱移动进对门，弗莱明甚至记得那天一共有十六个箱子在视野里出现。正当他看得出神，忽然间一种奇异的感觉顺着他的脖颈攀上大脑皮层。转过头，一个比弗莱明高出一个头的女孩子正俯视着他。弗莱明此生都不会忘记她拥有的可可色长发。 弗莱明不自觉地深呼吸了一下，尽管这对一个初中都没上的男孩来说显得太刻意了。最终还是卡尔白先示好：“你就住对门？那太好了！这可比我之前对门那个阴暗的怪老头好多了……&quot;尽管内容全无营养，少女天生的温柔微笑依然像春风拂过弗莱明的脸颊，他觉得自己的脸红得要滴下血来。他忘了自己那天是怎么支撑着完成对话的，只不过每次想起这段经历，他先是感到让人抓狂又无奈的尴尬，后面却转化成片刻的温柔。 月亮顺着卧室的窗户越爬越高，恍惚间如水的月色就洒满弗莱明的房间，但他躺在床上蜷成一团，脑中充满了混沌。“我连她名字是什么都不知道……”想到这里，弗莱明顿时灰暗下来：第一次被女生搭话就连语言功能都扔掉了，不争气啊不争气…… 心里事情多，弗莱明想着想着就睡着了。太阳照常升起，又是一个星期二。弗莱明不喜欢学校，他曾有次因为说错一句话，而被班里的异性们孤立许久，于是本来正常的与人相处在他眼中却成了难如登天的事。有这样的背景，弗莱明想喜欢学校都难。可旷课的后果更惨痛，权衡再三，还是艰难起身，去了学校。 “好困啊……”弗莱明的脑中只剩下这句在空荡地回响。他太累了，以至于他刚落座就扑通一声摔桌面上睡着了。等到他醒来，第一节课才刚要开始——是后桌的人用笔戳醒了他。弗莱明回过头去，话又被眼前所见生生梗回去了，他又开始脸红。 “啊，嗯，我们是不是在哪见过……”弗莱明不自觉地吐出句废话，反倒是少女感觉到弗莱明的窘迫，结巴地回复：“啊——我是不是不该吵醒你……但是要上课了，还是不要睡觉的好，”少女顿了顿，将慌张掩盖住，“我叫卡尔白，叫我卡尔就好。你是弗莱明是吧，我们昨天见过了。”话毕，卡尔眨着眼睛等着回应。弗莱甚至能数清她有几根睫毛，但他不敢去数。 “卡尔啊，好名字，跟导师一模一样。”弗莱全然不顾是否存在女生对阶级斗争感兴趣，就把马克思的名部分跟眼前可可色头发的女孩结合起来了。 他们没注意到的是，老师已经站在讲台上，面有愠色地瞧着可以判作“交往过密”的一男一女。还是弗莱的同桌咳嗽一声，才把数睫毛数到出神的少年弄回过神来。课程无聊透顶，弗莱实在不知道怎么会有人蠢到往游泳池一边装水一边放水。他就和同桌搭话，但同桌第一句话让弗莱几乎沉默。 “你后桌那女生新来的吧？长得确实不错啊，个子还高。”说着，同桌把手背朝上，在两人间挥来挥去，“你说你怎么这么好运，这样的女生第一个认识你。” 同桌不提还好，现在他一提，弗莱心里涌出一股无助感。他清楚女生培养关系的速度连病毒自我复制都望尘莫及，要是卡尔知道了他被排挤，一定会从众而排挤他的，毕竟不会有人为了他愿意舍弃什么。弗莱的脸上看不出情绪的变化，因为他已经被这样的无助感折磨大久了，多来一点也不碍事。 时间在弗莱浑浑噩噩的大脑里飞得比子弹还快，此时的弗莱已经走在了放学路上。忽然一只手“啪”的一下搭上他肩头，用力程度之大让他打了个趔趄。 “一个男生身体弱成这样也太不应该了吧，你应该抓住我的手把我拉到前面才对。”只听声音就知道了，弗莱根本不需要回头。他今天已经无数次听到卡尔充满活力的声音了。新来的总是使人新鲜，更何况卡尔接近 180 厘米的个头和甜美的长相本来就受人欢迎。弗莱的血液瞬间降温，他感觉有点晕厥，但还是试探性地问：“今天过得开心吗？” “当然了！本来以为刚来这里会很难适应，没想到大家都这么好相处。”卡尔转到弗莱的面前，双手搭上他肩膀不让他乱动——其实不这么做弗莱也不会动，因为他紧张到忘记路怎么走了。他只好含糊应下两声。 卡尔将手拿下，和弗莱并排走。弗莱踌躇了一阵，才开口：“你有没有听到什么关于我的事情？”卡尔抬头看天，看了一阵才重新和弗莱对上视线：“有啊有啊，女生们说你脑子有点问题……” 弗莱觉得太阳熄灭了。 “……但是我想啊，昨天第一次遇见你你连大气都不敢出一口，真的不像她们口中那种穷凶极恶之徒，我猜是以前你被女生搭话说了什么不该说的话被人讨厌了吧……”卡尔越往下说，弗莱的脸色便愈加铁青。直到最后他的脸快凝成一块钢板，卡尔才觉得不对劲，止住了话头。 “……我说错了吗？看你脸色好差……” 事实上，弗莱自己都没意识到自己脸色的变化，他觉得心里愈合已久的一块创口被无情地撕开了，尽管在这之前他认为自己无所畏惧。原来真正被人理解是这样痛的一件事，弗莱两手颤抖。他顿时有种流泪的冲动，但他不能流，旁边还有女生在，只好略微抬头让已经发红的眼眶在夕阳的光芒下不至于太明显。 卡尔伸手摸了摸弗莱的头顶，后者急忙躲开了。两人接下来一路上都没再开口。沉默在暮色里浮动，夕阳拉出两个人影，一长一短，来回晃荡。就像弗莱明慌乱的内心。 以后的日子倒是平静得不寻常。没有女生来调侃弗莱，他过了段着实难忘的清静日子——对他来说，独处已经是极大的奢侈了。慢慢学校也不再是什么可憎的东西。卡尔每天都与弗莱聊天，只此一点就让小男孩重拾信心了。 Section 2 弗莱终于迎来了小学毕业，再到初中毕业。高中入学考试前一夜弗莱主动给卡尔白打了电话。他觉得心里空落落的，一点自信也没有，急需一个人来平复弗莱躁动的内心，跟父母来两句又太尴尬。思来想去，对门的妹子倒是最合适的选择。令他意外的是，电话一通，对面就传来卡尔兴奋异常的声音，有点像百灵鸟。 “嘿嘿，我就知道你会来电话，等你好久了。” 卡尔“扑”地一下坐起身，少女已经发育起的躯体被白色睡衣和夜色温柔衬托得像天使。弗莱应该庆幸没看见这场面，否则光流鼻血就足以使他晕厥。 “啊，好……我现在睡不着，想和你说说话。” “正合我意。”卡尔“扑”地一下躺回床上，弹簧发出嘎吱声。 “嗯，你也知道，我从出生到现在，一直没做过什么惊天动地的事来证明自己。现在机会来了，我不想白白浪费它。或者说，我不想再被人讨厌了，虽然只是一次考试，但是我觉得只要比其他人优秀，就能获得尊敬了。话又说回来，我要是失败了，肯定会受到更多嘲笑的……” 对面沉默了一阵，像是深思熟虑才选择开口。 “怎么感觉你压力很大的样子。”卡尔白的声音突然低沉下来，像修女指引迷途的羔羊，“可是你也没怎么被人讨厌啊，到少我挺喜欢你的 别误会！不是你想的那样！我是说，你一定比你自己想的受欢迎，一定是这样的。无论如何，弗莱明，你一定要挺直腰杆走路啊，活在阳光下一定比浑浑噩噩地生活好一百倍！” 弗莱已经是不知第几次听到别人劝诫他不要浑浑噩噩，但是他没有一次是听进去的；他一没有出众的外表，二没有足以吸引人的身材，三没有掏得出手的才能。极端点说，他已经忘记了做人的意义。弗莱的呼吸异常规律，胸脯一起一伏就像海水潮汐，他心里的浪潮也快把他淹没——他感到自卑时总是这样。 “怎么不说话？睡着了？” “没有……突然觉得很难受而已。以前从没人跟我说过这些。”弗莱将脸对着枕头，这样说话不会让卡尔听见他话里的哭腔。 “没关系啦，不会很难的，只是需要你一点点勇气罢了。”卡尔蜷在床中央，像哄小朋友般，轻声同弗莱明说，“你真的是个很好的人啊……” “哪里好了？”弗莱警觉地反问。 “就是，怎么说呢，曾经还读小学，我们两个被分到同一个植物小组。你忘记了么？就是班主任不知哪搞来的盆栽轮流让人管理。但是班里的人新鲜感一过，马上就把盆栽的事抛在脑后了。只有你还在每天都去看看它们，时不时来点水。多亏了你，当时班里才不至于一点生机都没有。” “哦……”弗莱想起来了。但他并不是因为责任感才去照料植物的，实在是因为找不到与人搭话的由头才会去和植物说话的。弗莱本身不相信书里写的“万物有灵”，可照料植物愈久，他愈觉得万物确实有灵。他的话里充满快乐，植物就绿意盎然；不然就和霜打的茄子一样。弗莱也未想过，他做的一切被电话那头的女生尽收眼底，他有种感觉——卡尔白是来拯救他弗莱明的天使。 “是吧是吧，我就说有！”电话那头显得非常雀跃，“我看到你名字，就开始想：弗莱明（Flaming），就是会像火焰（flame n.）一样温暖别人呀。” “不至于不至于，别把脑子烧坏就成。” 电话里你一言我一语，时钟上的指针也一圈圈跟着走。弗莱明打起哈欠，打开手机时钟才发现已经过零点了。 “困了？给你唱首摇篮曲吧，祝你好梦~”卡尔也不管什么了，开口唱起来。 “睡吧，睡吧，我亲爱的宝贝……🎶” 弗莱的脸顿时绯红，再平静下来。卡尔的声音不算多么登峰造极，但也可称作是动听了，就像是弗莱把卡尔开的演唱会包下来一样。不多时，弗莱就沉入了梦乡。 Section 3 卡尔感觉到对面传来呼噜声，就把电话挂上，合上了眼睛。因为是夏天，卡尔只用被子盖住腹部，随意地躺着便入梦了。一双超过 42 英寸的腿被睡衣覆住一半，露出来的部分比婴儿的皮肤更光滑细腻。卡尔也常常因此被初中班上的男生们指摘，对着她流过口水的男孩们都能组一个排了。 沉浸在梦中的弗莱就没那么好运了，现实中的他正全身躁热，想动却动不了。因为在他的梦境里卡尔白把他压得紧紧的，弗莱自然动弹不得。与此同时，卡尔的手在他身上乱摸，然后终于是摸到了预料中的地方，卡尔揪住不松手。正当弗莱想叫出声时，卡尔亲了他一口，还把舌头往咽部里面伸。弗莱的心里充满了罪恶感，但肉体上的刺激使他无法自拔。 似乎是知道弗莱不会再叫出声，卡尔坐起身，这时弗莱才注意到骑在他身上的女孩只穿着内衣。可是这个子也太高了，弗莱胡思乱想。卡尔的重量刚刚好，介乎他没感觉和疼痛之间。换言之，他现在太舒服了。卡尔用她滑溜溜的大腿内侧夹紧，弗莱这回是真的叫出声了，现实中停在他窗外的两只小鸟被他的叫声吓得扑腾扑腾飞走了。 弗莱的右手不自觉地掐住卡尔的屁股，还在上面轻拍一下，清脆的拍打声顿时充满整个房间。卡尔娇喘一声，脸上忽然出现一种得逞般的邪笑。她把弗莱拉起来，两人此时的身体贴在一起。虽然是梦，感觉却无比真实，甚至卡尔温暖的小腹还在源源不绝地传递温度给他，卡尔的脸突然变红，在弗莱耳边轻声说：“变态~”,弗莱起了一身鸡皮疙瘩。 他低头，才发现卡尔大腿内侧流动着粘液一样的东西，这让弗莱好不容易消散的罪恶感又涌出来，他不知所措，只好抱紧卡尔以示自己不会推托。只在外面蹭蹭就如此手足无措，弗莱不知道自己是太没用还是因为坐在自己身上的是卡尔白了。 弗莱惊醒，太阳还在地平线以外沉睡。他感觉内裤湿嗒嗒，用手去摸却并不像水。这时他才知道梦里的时事情不全是假的。他回忆起卡尔淡粉色的内衣，脸不知不觉又红了。 无论如何，裤子还是要换。弗莱坐在床边，回忆起梦里的各种细节。卡尔在他印象中绝对不是如此好色的人，这种反差着实让人难以接受。卡尔现在还睡得正香吧，弗莱一边幻想一边苦笑。确实，一夜间卡尔在床上转了数圈，被子上每层褶皱都像精心设计过，与她身体的曲线几乎融为一体。她脸上的微笑告诉整个世界少女的梦境如何美好，嘴唇——也是最引人注目的——似乎总是如此红润。让弗莱觉得如此灼目。 过了接近两个小时，天空才泛起鱼肚白，但弗莱明不想继续留在家里，于是他趁父母没醒，溜出了家门。就在他回头关上门的那一刻，一只手戳了戳他的后颈，他吓得&quot;轰&quot;的一声关上房门。刚准备回头输出，就听见一个温柔的声音： “啊——弗莱明，你怎么这么早就出门了？” 听见卡尔的声音，弗莱顿时没了脾气，只好低着头含糊应答：“不想继续在家发呆了，索性早点出门……” “那我们一起走吧。” “嗯……” 太阳还没有完全露脸，所似即使在夏天，气温也没有多么极端。走到阳光下，弗莱才有机会好好审视整个世界。街边树木身上的熟石灰涂层好像永远褪不掉，但树上无数的绿叶告诉人们：冬天过去了，夏天来了。弗莱记得之前看过，春天也是有落叶的，不过那些是新生的叶子，营养不足才会飘落，冬天那才真是万物凋零，看不出一丝生机。弗莱一直认为自己活在寒冬里，掖着仅剩的棉衣撑过无尽冰雪，但他现在拥有一座篝火了。 卡尔掏出一盒 Pocky，撕开包装，先抽出一条塞进弗莱唇间，然后就一条一条把整盒吃光了。弗莱有点出神，叼着 Pocky 也不说话，注意力放在旁边咬饼干的声音。 “不好吃吗？”卡尔问。 “没有，挺不错的。” 弗莱一节一节咬下饼干，一半苦涩裹着另一半甜蜜。还是巧克力味的，弗莱明很喜欢这种味道，就像卡尔给他的印象一样。这时他才有机会欣赏卡尔的样貌。还记得两个刚认识的时候卡尔头发并不长，只扎个马尾辫，前额的头发就有点拮据了；现在留了长发，一直留到肩胛骨往下，这让弗莱想起之前读的《查理与巧克力工厂》中描写的巧克力瀑布，甚至卡尔头发颜色也是一模一样的可可色。 看着卡尔嚼饼干，弗莱注意力又被引到卡尔嘴唇上。他之前一直好奇，卡尔是不是有抹口红的习惯，因为她嘴唇的确比弗莱见过的其他人更红一分。后来才知道不是的，不然也不会无所顾忌地咬饼干。也许是它的原因，卡尔的皮肤白得接近透明，弗莱想戳戳看看是不是和初生儿一样水嫩。 虽然只是看看，弗莱明也非常开心了。他知道曾经有多少人喜欢过卡尔，也知道曾有个不长眼的到处表明爱意，尽管这小子看着连真爱是什么都不知道，大约只是馋卡尔身子。确实啊，卡尔的美浑然天成，连棕黑色的虹膜都像是为了支撑她的美，不过身材不能说像钢板，也就比钢板多点弧度，像久用的砧板。想到这，弗莱憋不住笑出来。 “笑什么？”卡尔发现弗莱一边盯着自己一边发出气球漏气一样的笑声，警觉地问。 “不好笑，我就是觉得很开心。” 弗莱明发现，学校已经出现在视线内了。他真心希望这条路能长一点，再长一点，让他能多看两眼卡尔白。她的腿被短裤衬托得像豆腐，弗莱心里蠢蠢欲动。 不过该来的总是要来，弗莱跟卡尔在学校门口说了再见。他的心忽然感到落寞，毕竟以后可能再也见不到这可可发色的女孩了。 考试倒是乏善可陈，三天的时间一晃眼就过去了，期间卡尔一直没出现，弗莱心里空落落的。当他打开手机，发现今天已经是六月十九日了，再往后数……多少天呢？弗莱有些懊恼，卡尔跟他说过很多次她生日落在哪天，现在他全给忘了。他只好打开聊天框，试探地向卡尔发出： “生日快乐~” 等了三十秒，消息框从手机顶弹出： “我还没过生日呢，你怎么比我还急？” “我忘记了……” “你也真是粗心，我再说一次，是6月26号” 弗莱松了一口气，至少没等到卡尔生日过了才祝生日快乐。 “想送礼物了？这么着急” “突然想起来而已。考试前你好像跟我说过这些” “是啊，我生日那天你要来我家吗？会有很多人来的” “算了吧”按下“发送”，弗莱就不再看手机。并不是他不想去，而是出于一种莫名的恐惧。弗洛伊德说童年经历会影响人的一生，弗莱明深信不疑，他想，自己的恐惧源自童年被疏于照料，在外面受了委屈却没有一个可以倾诉的对象。弗莱也嘲笑自己，说打碎牙往肚里咽不是很正常的事吗？很快又笑不出来了，因为被委屈缠绕的是自己，又是在人最天真的孩提时期。弗莱明害怕有一天卡尔消失，像一股轻烟飞走了，那时候他又变回一个人，索性现在就少点见面。虽然他骗不过自己的心。 “为什么……明明就在对门……”可惜弗莱不会看到这条消息了。 Section 4 过了几天，弗莱明收到高中录取通知书，他惊奇地发现又和卡尔白在一间学校了。弗莱感觉一种莫名的喜悦涌出来。但他对高中生活并不抱多大期望。他读初中时每到星期五就有以前的毕业生回母校探望老师。他印象最深刻的是一个眼圈黑得让熊猫都怜悯的学长，学长在弗莱班上大谈特谈理想与前程，但学长脸上的憔悴实在让人怀疑。 四个月的日子一下就溜过去了，弗莱明没有觉得开学前的自己有任何认知错误。他最厌恶的就是在高中住宿，并不是宿舍矛盾激烈，而是弗莱只喜欢家里的床。现在也算是暂时地结束了，就这，班主任还提醒要弯道超车。 但弗莱明最喜欢的新年就要来了，虽然没有多么热闹，但弗莱可以拿到不少的压岁钱，足以吃喝不愁。尽管距新年还有接近两个星期，弗莱明就已经在手机日历上做好标记了。 除夕夜当天，弗莱明早早洗好澡，坐在床上那玩起手机准备领各路来历的红包。一条短信吸引了他的注意，大意是他在的城市会有烟花演出，恰巧他卧室的窗户正对着演出地，这使弗莱兴奋异常。但敲门声 打断了他的兴奋： “弗莱明–你在家吗——” 弗莱突然尴尬起来，要是这声音让父母听见想必一定会被问东问西。不过还好，看样子一切正常。弗莱打开门，门外是裹成狗熊一样大只的卡尔白。 “你在家真是太好了，我家里没人，可以来你家跨年吗？”卡尔白的眼睛里闪着星星，弗莱发现自己根本无法拒绝。“啊……好吧。但你小点声，我爸妈还在家。” 卡尔比出一个 OK 的手势，回头把门轻轻关上。和弗莱一起蹑手蹑脚进入房间。卡尔惊呼： “你房间的窗户好大啊，很适合看夜景呢！” “是啊，今天晚上还可以看烟花。” 弗莱明看着充满期待的卡尔，一种自豪之情油然而生。与此同时，他觉得心底被掩盖住的一块在不安地躁动，而他独处时从没有这种感觉。他向卡尔移动得更近一些，卡尔看了他一眼，没有拒绝。 “诶，卡尔白……” “什么？”卡尔对有人直呼自己的名字突然有点迷茫。 “你有交过男朋友吗？” “没有，真的没有。好多人问我这个问题。我知道自己长得好看身材也不错，现在还没谈过真是奇怪。”卡尔白开了个玩笑。 “……”弗莱明脸红了，张张嘴却一言不发。 “不是，你不会……”卡尔意识到不对劲了，站起来俯视弗莱。 卡尔在弗莱面前走来走去，一脸的难以置信。披散的可可色长发如同爬山虎一样晃动。 “我发自心底地觉得我们只是好朋友，如果想再近一步绝对不合适。至于原因，”卡尔站定了，眼神坚定，“你会知道的。” “不是，你会错意了。你怕是不知道，一个学期之间你被传了多少条排闻，甚至包括我和你的。我只是为了确认一下，你多虑了。” “……” “小丑竟是我自己。”卡尔跌坐下来。 看完烟花，卡尔白自己回家睡觉了。但让弗莱明难以忘怀的是，倒计时跨年的那几秒间，卡尔在他脸上轻轻吻了一下。当时他没敢问发生了什么，只觉得心里像有团火在烧，脸颊上一大块区域都红得像番茄。深呼吸几次，激动的心情才得以恢复。 此后的日子单调得如同溪流穿过林间。弗莱的日程表每天都充满了各种各样的课程，要是没有课程那也是抢着吃饭洗澡，时间在这种单调的日子里过得是最快的，弗莱现在真是深刻领悟了这一点。但弗莱明也会做梦，当夜深人静，他的大脑开始造梦时，这梦里便必须然有卡尔的身影。但它始终是梦，梦再真实醒来也是一场空，弗莱很讨厌这种感觉，被空虚攫取的郁闷实在难以消解。 高考前后的日子改变其实并不大，不过是班级中的人们愈发沉默寡言，书本纸张可以从地面堆上天花板，整个世界近乎黑白色，幸运的是，弗莱心里多了一抹可可色，这使他不至于如此难熬。 Section 5 高考后，连弗莱明都感觉到一股自由的风席卷整座城市：街道上的年轻身影越发多起来，尤其是在晚上。但他有件更重要的事，要是这件事做不成，其他说再多都没什么意思。弗莱坐在书桌前，摊开一张信纸，抓住笔转了半天，也没有有趣的话好写。最后没办法了，只写上一行字： “I want you to be MY ALL. ” 写完署名封口，出门打算将它从门底的缝隙投入。他失望了，他又一次看见一大群蓝衣工人，进进出出，这回搬走了二十个箱子。弗莱次难得真正清醒一回： “人还是会成长的啊……” 最后一个离开的工人给弗莱明一个信封，捏了捏，里面东西还挺多。信封上没有收寄信息，只画了一片绽放的烟花。弗莱不敢打开，他怕里面全盘否定自己这十年间的感情。到最后他坐回书桌前，桌上摆着两封信:一封永远无法寄出，一封永远无法打开。弗莱明相当仓皇，他又胡思乱想起来。那个身高接近一米九，一头棕色……是可可色头发的女孩成了他青春的剪影。 幸运的是，十年过去了，弗莱明再也没见过卡尔白。 全文完 2024.11.16 后记 这个故事并不是完全虚构的，这个女生是存在的。 把她的名字直接用我的替换上，有两个原因： 我眼中没有一个人的名字配得上她。 我不知道她的名字。 看得懂的，就读读下面这条B站评论，我自己写的，权当作补充材料。看不懂的，当成个悲剧看就好。 当时本子上画的漫画，突发奇想做出来的： 注释 1.〔42 英寸〕约合 106.68 厘米。↩ 2. 因为是气泡消息，所以不加句号。↩","link":"/articles/the-edge-of-a-decade/"},{"title":"卡尔白算法之路的开山之作：LeetCode20-有效的括号","text":"欢迎前往我的仓库支持！ ¶题面描述 1234567891011121314151617181920212223242526272829给定一个只包括 '('，')'，'{'，'}'，'['，']' 的字符串 s ，判断字符串是否有效。有效字符串需满足：1. 左括号必须用相同类型的右括号闭合。2. 左括号必须以正确的顺序闭合。3. 每个右括号都有一个对应的相同类型的左括号。示例 1： I: s = &quot;()&quot; O: True示例 2： I: s = &quot;()[]{}&quot; O: True示例 3： I: s = &quot;([)]&quot; O: False示例 4： I: s = &quot;(]&quot; O: False示例 5： I: s = &quot;([{}])&quot; O: True 其中 1 =&lt; s.length =&lt; 10^4 ¶解法与逻辑关系的解释 这是我的解法： 123456789101112class Solution: def isValid(self,s: str) -&gt; bool: brackets = {&quot;)&quot;:&quot;(&quot;,&quot;]&quot;:&quot;[&quot;,&quot;}&quot;:&quot;{&quot;} chars = list() for char in s: if char in brackets: # 优先处理右括号 if not chars or chars[-1] != brackets[char]: # 栈为空 / 栈末位与待检测括号不匹配 return False chars.pop() else: # 处理左括号 chars.append(char) # 直接压入栈 return not chars # 处理完毕，栈为空则 s 有效 变量名解释： s： 待检测括号。 chars：空栈，存储单个括号用。 char：s 中每一个括号。 brackets：存储右-左括号的键-值对的字典。 算法的要求很简单：每个左括号一定能在它右侧的某一位置找到与它对应的右括号**（反之亦然），此时称它与它的右括号为一对有效的括号**，并且它的右括号不会穿插在另一对有效的括号中。 这意味着我需要使用栈，遵循后进先出原则（Last In First Out），以便于在右括号与它的左括号匹配上时能够及时地将这一对有效的括号弹出，不影响后续的判断。所以用到 Python 的字典建立映射关系。 我的困惑是第 7 行代码 1if not chars or chars[-1] != brackets[char]: 不过在这之前还要检查第 6 行：if char in brackets:。Python 的字典在使用 in 运算符时只检查键而不是值，也就是说，brackets 中的全部键均是右括号，只要第 6 行的代码能够判断待检测括号是右括号即可。 or 把前后分成两个条件，也就是 not chars 和 chars[-1] != brackets[char]： not chars：当 chars 为空时，这个条件的结果是 True。栈为空还有右括号未匹配自然无效。 chars[-1] != brackets[char]：brackets[char]是这个右括号的对应左括号，此时它的左侧（也就是栈的末端）并不是它对应的左括号，说明这对括号无效。 这里的关系理顺了，下面直接把左括号压入栈的做法也就很好理解了。 ¶流程图演示 ¶时间/空间复杂度 时间复杂度： O(n) 代码遍历整个字符串一次，每个字符处理时间为 O(1)。字典查找、列表的末尾插入（append）和删除（pop）操作均为常数时间复杂度。 空间复杂度： O(n) 最坏情况下（如所有字符均为左括号），chars 列表需要存储所有字符，占用 O(n) 空间。即使存在部分匹配，空间复杂度仍由输入字符串长度决定。","link":"/articles/Valid-parentheses/"},{"title":"压缩包学习笔记","text":"¶关于压缩包 压缩包的正式名称是归档文件，也叫压缩文件。压缩文件分为有损压缩和无损压缩。 有损压缩通过抛弃部分不需要的数据，来实现减小文件大小的功能，也就是说，作为用户，必须接受压缩程序对原始文件的重新解释。最有代表性的就是 MP3 文件。简单来说，MP3 通过滤过人耳无法捕捉到的声音（也就是利用人耳听觉系统的遮蔽效应特性），来达到压缩音频大小的效果。 无损压缩算法通过消除数据中的冗余和重复部分来压缩数据，同时保持数据的完整性和准确性。举个例子，这是一段无序的字符： ppppsdwwwwqq 我们可以换一种书写方式，用数字代表这个字符出现的次数，省略1，所以就能得到： 4psd4w2q 这样，原长为 12 的字符串就被减少到了 8。当然，实际上的压缩算法比这更先进，也比使用有损压缩更复杂，而此时的压缩包已经是另一种文件格式了，如果想使用其中的数据，首先得用压缩软件把数据还原，这个过程称作解压缩。 我想写的主要是诸如 .zip 之类的压缩文件，因此下面就不多写有损压缩的东西了。","link":"/articles/Compressed-files-notes/"},{"title":"「新」动计划 · 编程入门 题面与答案解释","text":"欢迎前往我的仓库支持！ ¶说明 本目录中的 Solutions.py 中存储了全部 LeetCode 「新」动计划 · 编程入门 的解法，为了方便阅读全部写进了一个类中，并附上了题号和题面描述的 URL，因此下文如无必要就不会粘贴题面。其中两道特别的题 #8 和 #9 使用的是 MySQL 语句完成的，因此另开一个 Markdown 文件 Solutions.MySQL.md 用于存储答案。 下面是对 20 道题目的理解和答案解释。 ¶答案展示与思路解析 1class Solutions(): ¶1 LeetCode2235-两整数相加 12def sum(self, num1: int, num2: int) -&gt; int: return num1+num2 不必多言。 时间复杂度： O(1) 空间复杂度： O(1) ¶2 LeetCode2469-温度转换 12def convertTemperature(self, celsius: float) -&gt; list[float]: return [celsius+273.15,celsius*1.8+32] 只需要根据温度换算公式输出即可。 时间复杂度： O(1) 空间复杂度： O(1) ¶3 LeetCode2413-最小偶倍数 12def smallestEvenMultiple(self, n: int) -&gt; int: return n if n % 2 == 0 else n*2 通过数学方法解决： 如果这个整数是偶数，直接输出即可。 如果这个整数是奇数，输出它与 2 的积。（即：任意一个奇数总与 2 互质） 时间复杂度： O(1) 空间复杂度： O(1) ¶4 LeetCode2236-判断根结点是否等于子结点之和 这之前需要定义一个答案中用到的二叉树： 12345678910class TreeNode: def __init__(self, val=0, left=None, right=None): self.val = val self.left = left self.right = right # 题目给出了一个数组 `root`，因此就有：tree = TreeNode(root[0])tree.left = TreeNode(root[1])tree.right = TreeNode(root[2]) 这样： 12def checkTree(self, root: Optional[TreeNode]) -&gt; bool: return True if root.left.val + root.right.val == root.val else False 容易发现只要一个简单的条件判断即可得到答案。 时间复杂度： O(1) 空间复杂度： O(1) ¶5 LeetCode1486-数组异或操作 12345def xorOperation(self, n: int, start: int) -&gt; int: ans = 0 for i in range(n): ans ^= start+2*i return ans 题目告诉我们 start + 2*1 就是num[i]，只要遍历一次即可得到答案。 （其中 ^ 是位运算的异或运算符） 时间复杂度： O(n)，n 是整型 n 。 空间复杂度： O(1) ¶6 LeetCode1512-好数对的数目 ¶解法 Ⅰ 123456789def numIdenticalPairs_1(self, nums: list[int]) -&gt; int: # 解法一 # 采用了两层 for 循环，是一种暴力解法 ans = 0 for i in range(len(nums)): for j in range(len(nums)): if nums[i] == nums[j] and i&lt;j: ans += 1 return ans 类比 LeetCode1-两数之和，容易发现二者的思想其实是一样的。LeetCode1 是给出一个数组要求这个数组里找出两个数，使它们的和等于给定值；本题是使得数组中两个数相等。 所以我们首先考虑迭代两次，当 (i,j) 满足 nums[i] == nums[j] 且 i &lt; j 时计数器（即解法一中的 ans）加一。这种方法必定出现最坏情况，即遍历列表 nums 次数为 len(nums) 的平方。 时间复杂度： O(n2)，n 是列表 nums 的长度。 空间复杂度： O(1) ¶解法 Ⅱ 123456789101112def numIdenticalPairs_2(self, nums: list[int]) -&gt; int: # 解法二 # 使用字典减少了匹配次数 d = dict() ans = 0 for num in nums: if num in d: ans += d[num] d[num] += 1 else: d[num] = 1 return ans 同上。我们发现解法 Ⅰ 非常容易超时，于是我们设想类比 LeetCode1-两数之和看看能不能用 Python 的字典解决这个问题。 我们发现，针对题目中给出的有序整数对 (i,j) 总有 nums[i] == nums[j]，于是，我们可以创建形如 1d = {key:value} # key 为 nums 中的整数 num，value 为 num 出现的次数 的字典。如果这个数在 nums 中第一次出现，就把它作为键并将它对应的值设置为 1。如果是第 n（n &gt; 1）次出现，计数器就加上 n-1。这样，只需要遍历 nums 一次，就得到了答案。 Q：为什么加上 n-1 ？ A：根据计数原理，我们假设一张纸上有 n （n&gt;2）个点，其中任意三个点都不在同一条直线上。我们发现，它们可以连成 1+2+3+…+(n-1) 条线段，也就是 $\\frac{n(n-1)}{2}$ 条线段。 接着，我们增加一个点，这个点遵循上面的规则，于是线段条数增加 n 条（因为先前的 n 个点都要同这个新的点连结），以此类推。 把这个连线的过程回放到算法中，我们发现，如果把 nums 中的每个相同的数都看作一个点，那这些点连线的条数之和就是我们要的结果。同时因为两点只确定一条线段，就避免了判断 i 与 j 的大小。 时间复杂度： O(n)，n 是列表 nums 的长度。 空间复杂度： O(n)，最坏情况下需要存储 nums 中全部的整型。 ¶7 LeetCode1534-统计好三元组 ¶解法 Ⅰ 1234567891011def countGoodTriplets_1(self, arr: list[int], a: int, b: int, c: int) -&gt; int: # 解法一 # 三层 for 循环，极其暴力，极其不优雅 n = len(arr) ans = 0 for i in range(n): for j in range(i+1,n): for k in range(j+1,n): if abs(arr[i] - arr[j]) &lt;= a and abs(arr[j] - arr[k]) &lt;= b and abs(arr[i] - arr[k]) &lt;= c: ans += 1 return ans 注释已经写得很明确了。还好这道题限制了 arr 的长度3 &lt;= arr.length &lt;= 100，否则必定超时。 时间复杂度： O(n3)，n 是列表 arr 的长度。 空间复杂度： O(1) ¶解法 Ⅱ 1234567891011121314151617def countGoodTriplets_2(self, arr: list[int], a: int, b: int, c: int) -&gt; int: # 解法二 # 这个解法很帅气，但我读不懂 idx = sorted(range(len(arr)), key=lambda i: arr[i]) ans = 0 for j in idx: y = arr[j] left = [arr[i] for i in idx if i &lt; j and abs(arr[i] - y) &lt;= a] right = [arr[k] for k in idx if k &gt; j and abs(arr[k] - y) &lt;= b] k1 = k2 = 0 for x in left: while k2 &lt; len(right) and right[k2] &lt;= x + c: k2 += 1 while k1 &lt; len(right) and right[k1] &lt; x - c: k1 += 1 ans += k2 - k1 return ans 这是来自灵茶山大佬的解法，思想就是分成两个有序数组后使用双指针查找。但是，时间复杂度也只是下降到了 O(n2)，非常可惜。 具体解读等我看懂了再同步更新。 时间复杂度： O(n2logn)，n 是列表 arr 的长度。 空间复杂度： O(1) ¶8 LeetCode584-寻找用户推荐人 1234SELECT nameFROM customerWHERE referee_Id != 2 OR referee_Id IS NULL 处理这道题只有两个难点。一是不知道 MySQL 怎么用，二是 NULL 并不能简单地用布尔值判断，而是应该使用 MySQL 提供的 IS NULL 或 IS NOT NULL 运算。 第二点不能用布尔值的原因是，MySQL 是操作数据库的语言，是与现实紧密联系的。如果值是 NULL 自然只能认为不知道这个值，而不是用简单的 TRUE 或 FALSE 判断。 ¶9 LeetCode1757-可回收且低脂的产品 1234SELECT product_idFROM Products AS prWHERE pr.low_fats = 'Y' AND pr.recyclable = 'Y'; 同 8，只要会 MySQL 语句就很简单。格式问题不在这里赘述。 ¶10 LeetCode709-转换成小写字母 ¶解法 Ⅰ 1234def toLowerCase_1(self, s: str) -&gt; str: # 解法一 # 直接调用 Python 内置函数 return s.lower() 不必多言。 时间复杂度： O(n)，n 是字符串 str 的长度。 空间复杂度： O(1) ¶解法Ⅱ 1234567891011121314def toLowerCase_2(self, s: str) -&gt; str: # 解法二 # 假设 Python 没有提供 str.lower() 这样方便的函数，就需要通过 ASCII 转小写 return &quot;&quot;.join(chr(ochar | 32) if 65 &lt;= (ochar := ord(char)) &lt;= 90 else char for char in s) # 为了方便理解，下面是展开式。其中提到的变量 ans 并不是必要的 # ans = [] # for char in s: # ochar = ord(char) # 计算字符的 ASCII 值 # if 65 &lt;= ochar &lt;= 90: # lower_char = chr(ochar | 32) # ans.append(lower_char) # else: # ans.append(char) # return &quot;&quot;.join(ans) 在 ASCII 中，大写英文字母占用 65~90，小写字母占用 97~122，中间间隔 32。 时间复杂度： O(n)，n 是字符串 str 的长度。 空间复杂度： O(1) ¶11 LeetCode258-各位相加 12def addDigits(self, num: int) -&gt; int: return (num-1)%9+1 if num &gt;= 1 else 0 我们在小学的时候就学习过怎样快速判断一个正整数是不是 3 的倍数。方法就是将待判断的数的每一位都加起来，得到一个新的数，如果这个新的数是 3 的倍数，那么这个待判断的数也是 3 的倍数。 这个过程与这道题的要求非常相似，于是我们设想：通过类比计算一个数是否是 3 的倍数，得到这个算法。 当然，如果根据上述，我们会发现得到的结果永远小于 3，因此我们借助 10 以下同时也是 3 的倍数 9 来辅助处理这个问题。这样的话，得到的结果就限定在了 [0,8]，如何处理结果为 9 我们后面再说。 让我们先做一个实验： 假设 num = 102734，那么： 1+0+2+7+3+4 == 19, 1+7 == 8 107234%9 == 8 非常符合我们的猜想。不失一般性，我们将这个结论推广到 $[0,2^{31}-1]$ 这个区间内。（证明过程请自行查找关键词“数根”，这里不赘述） 但是我们容易发现：一旦 num 是 9 的正整数倍，结果就会变为零，这明显不是我们想要的。于是我们对 num 进行偏移，这样就能保证当 num 是 9 的正整数倍时结果不为零。 因为 num 必定是自然数，因此选择 num-1。这样，num-1 模 9 取余得到的结果就变成 num 同样操作后减去一（当然，上面提到的情况除外），我们再把它加上。 还有最后一个例外：0。对 0 做一个简单的条件判断即可。 时间复杂度： O(1) 空间复杂度： O(1) ¶12 LeetCode1281-整数中的各位积和之差 123456def subtractProductAndSum(self, n: int) -&gt; int: prod, SUM = 1, 0 for num in str(n): prod *= int(num) SUM += int(num) return prod-SUM 无需多言。顺次获取每一位数 时间复杂度： O(logn)，其中 n 是整型 n 变为字符串后的长度。显然只有整型 n 的位数（而不是数的大小）增加时字符串 n 长度才增加，它们满足对数增长关系。 空间复杂度： O(1) ¶13 LeetCode231-2的幂 12def isPowerOfTwo(self, n): return n &gt; 0 and n &amp; (n - 1) == 0 我们知道 2 的幂一定是正数，因此我们得到第一个条件：n&gt;0 同时我们经过观察，发现：当一个十进制数 n 是 2 的正整数次幂时，n 对应的二进制必定首位是 1，其余位全是 0，且 n-1 的首位是零，其余位全是 1。这意味着我们只需要采用位运算和，就能得出答案。 时间复杂度： O(1) 空间复杂度： O(1) ¶14 LeetCode326-3的幂 12def isPowerOfThree(self, n: int) -&gt; bool: return True if n &gt; 0 and 1162261467 % n == 0 else False 这道题……我得承认我没有好的想法，只是把数据范围区间内 3 的幂的最大值（1162261467）预先求出来，再把这个数除以 n，如果余数是 0 那 n 自然是 3 的正整数次幂。 这个思路完全可以套到13 LeetCode231-2的幂中，但是太不优雅就没有写出来。 时间复杂度： O(1) 空间复杂度： O(1) ¶15 LeetCode263-丑数 1234567891011def isUgly(self, n: int) -&gt; bool: if n &lt;= 0: return False else: while n % 3 == 0: n /= 3 while n % 5 == 0: n /= 5 while n % 2 == 0: n /= 2 return n == 1 丑数是个已经被承认的数学概念，除了暴力也没有别的好方法。 时间复杂度： O(logn)，其中 n 是整型 n。取对数增长的原因是，每一次做除法，n都会变到原来的 1/m，其中 m 是 2 或 3 或 5，n 减小的速度会越来越慢，直到得出结果。因此可以认为时间复杂度是 O(logn)。 空间复杂度： O(1) ¶16 LeetCode1470-重新排列数组 1234567def shuffle(self, nums: list[int], n: int) -&gt; list[int]: ans = list() for i in range(n): ans.append(nums[i]) ans.append(nums[n]) n += 1 return ans 容易发现，len(nums) 必是偶数，因此我们用两个指针 i 和 n 来实现功能 假如我们把 nums 等分成两半，就能发现 num[n] 恰好是紧靠中线右侧的一项，也就是题目要求的 y1，按照这个思路，每循环一次 i 与 n 都加一，就能得到答案。 时间复杂度： O(n)，n 是 nums 的长度。 空间复杂度： O(1) ¶17 LeetCode867-转置矩阵 1234567def transpose(self, matrix: list[list[int]]) -&gt; list[list[int]]: i, j = len(matrix), len(matrix[0]) ans = [[0] * i for num in range(j)] for m in range(i): for n in range(j): ans[n][m] = matrix[m][n] return ans 思路就是创建一个行列数与 matrix 相反的二维列表，再一个个填进去。 时间复杂度： O(n2)，n 是 matrix 行数与列数中的较高项。 空间复杂度： O(1) ¶18 LeetCode1422-分割字符串的最大得分 12345678910def maxScore(self, s: str) -&gt; int: r = s.count(&quot;1&quot;) # 右计数器 l = ans = 0 # 左计数器和答案 for i in s[:-1]: if i == &quot;0&quot;: l += 1 else: r -= 1 ans = max(ans,l+r) return ans 题目中把 s 分割成了长度均不为零的两部分，计算左侧 0 的数目与右侧 1 的数目之和（称作“得分”）的最大值。 容易想到，遍历字符串一次（把这个称作分界线）。如果分界线遍历到的是 0，左计数器就加 1；如果是 1，右计数器就减 1。 当然，在这之前，假设全部字符串都被归到右边，那得分就是 s 中 1 的数目，把它作为右计数器的起始值。 还有最后一个坑，由于分割后的字符串必定不是空字符串，给 s 切片时就需要防止分界线抵达最后一位。因为分割字符串时分割的点必定在分界线与下一位之间。 时间复杂度： O(n)，n 是字符串的长度。 空间复杂度： O(1) ¶19 LeetCode2586-统计范围内的元音字符串数 1234567def vowelStrings(self, words: List[str], left: int, right: int) -&gt; int: ans = 0 vowels = &quot;aeiou&quot; for i in range(left,right+1): if words[i][0] in vowels and words[i][-1] in vowels: ans += 1 return ans 一道挺有趣的题，只要遍历 words 中在[left, right]这个区间中的词并且判断首尾就行了。 时间复杂度： O(n)，n 是需要遍历的词数。 空间复杂度： O(1)，仅占用一个长度恒为 5 的字符串。 ¶20 LeetCode852-山脉数组的峰顶索引 123456789def peakIndexInMountainArray(self, arr: List[int]) -&gt; int: l, r = 0, len(arr)-1 while l&lt;r: m = l + (r - l) // 2 if arr[m] &lt; arr[m+1]: l = m + 1 else: r = m return l 这道题与前面 19 题有一个最大的区别（不是难度！），就是它限制了时间复杂度为 O(logn)。 一般地，针对这种限制时间复杂度的题，我的建议是在互联网搜索“时间复杂度为 xxx 的经典算法”，然后根据实际情况修改。例如，既然时间复杂度是 O(logn)，很快就能检索到二分查找。 然后，又因为我们要找的数必定是既大于它左边又大于它右边的，我们就有了搜索方向，二分查找成立。 把左右指针设置为 0 和末尾，反复取半。容易发现，每取一半，将用到的时间就又少一点，这满足题目要求的 O(logn)。注意避免死循环和溢出，当 l == r 时就可以返回答案了。 时间复杂度： O(logn)，其中 n 是 arr 的长度。 空间复杂度： O(1) ¶结语 这整一套题单我花了一天多一点，断断续续做完的，感觉设计的很不错，非常适合像我这样的初学者。我觉得自己已经深深地学习了。 下一道题就等下一个周末再更新吧，See ya~ (The end)","link":"/articles/Primers-list/"},{"title":"我终于有自己的域名啦！","text":"¶在拥有域名以前…… 受阮一峰先生的影响，我对个人博客这一块很早就有了非常浓厚的兴趣，但是碍于技术条件一直未能如愿。不过很幸运的是，我在 2025 年寒假时用上了个人电脑，也自己学习了怎么用 Hexo 框架搭建博客。不选用 Wordpress 就是因为我认为 Wordpress 虽然傻瓜式操作，部署等操作非常方便，但是太过于笨重，如果我以后要在网页里实现比较复杂的功能那 Wordpress 实在不够看，因此最后选了轻量化而且静态的 Hexo。 2025 年 2 月 8 日，我注册了个人博客站，也就是你看到的这个站点。同天发表了第一篇博客，就此踏上了 blog 之路。本着吃水不忘挖井人的精神，我还发布了一篇教学 Hexo 博客与你。 我没有 VPS 或可供当服务器的设备，因此白嫖 GitHub Pages 部署网页。但是显然有弊端：GitHub Pages 只支持如 .html 等的静态页面，对 .php 页面无能为力。不过对我来说无伤大雅，至少我在互联网上有自己的基地了。 看到不知不觉就一个月了心里还是很感慨的，虽然每一步走的都堪称艰难。（因为我的代码技术太差了嘛） 但这么一路白嫖下去也不是个事，看看：karlbaey101.github.io 这个网址，太长了。我需要一个短些的网址。于是…… ¶Karlbaey.top 字面意思很好理解，就取了“最顶尖的卡尔白”这个含义。还有一个原因就是 .top 顶级域名比 .com，.cn 之流便宜得多，也省去了备案的麻烦。 特别鸣谢 非常感谢 Nekoaday 为我建站和域名选择提供了非常有价值的建议和帮助！相关 issue：miaomiaolol · Issue #2 · Karlbaey101/Karlbaey101.github.io 域名是在 Spaceship 上购买的，就顺便用了 Spaceship 提供的 DNS 解析服务，不得不说体验非常好。不过后来还是把一些服务托管在 Cloudflare 上了，因为我需要电子邮箱服务。以后可能会慢慢多起来的。 不过可能很少有人知道我原本是打算买 Karlblo.gs 这个域名的，但是我嫌域名长得不好看最终作罢。Karlbaey 也是个陪伴我很久的虚拟形象了，用这个来做域名显然更好。 ¶困难和困难 买域名的时候 DNS 解析一直对不上，甚至出现了被墙的惨状，到最后发现是 Cloudflare 抽风，关掉小黄云后就万事大吉了。 ¶记一次令人疲劳的网站修复 提醒 本段于 2025-03-23 03:26 编辑。 星期五回到家，发现自己博客文件夹莫名其妙少配置文件了，就打算着索性换一个模板吧，因为我正用着的 Icarus 模板显示范围相当窄，看长篇文字的时候很让人不愉快。 于是就在 GitHub 上找了找，找到一个看着很喜欢的 amazing 模板（够霸气的名字），再细看下来原来是在 Icarus 基础上魔改的，倒也正合我意。 然后依葫芦画瓢把仓库克隆到本地了，结果报错一堆，实在心累。不多说，直接上图吧： 我不会改代码，就问了 AI，但是它给的方法一点用都没有。我只能自己上必应搜方法慢慢调试，最后终于好了。原因就是：我没有把模板文件夹命名成“amazing”。除了脑残我想不到任何更好的词表达我的愤怒。 光处理 HTML 文件无法生成这个问题就耗掉了我接近一个小时，我也没有耐心去改配置了。现在 karlbaey.top 暂时关闭访问了，预计等到明天我修好站点页面之后再开放访问。 更让我恼火的是，我用的无线鼠标在我正修得热火朝天之时，突然坏掉了……我崩溃。 希望不要有人重蹈我的覆辙，hexo 模板也不要再搞什么反人类的东西了。现在是3:26，非常晚，我睡了。 ¶以后的计划 好多想说的，好多想做的，都慢慢来吧。 每周更新一篇博客，内容不限，哪怕是碎碎念也算是努力过的证明。一年下来也会有 50 篇的。 一直保留着 Karlbaey.top 这个域名，因为我实在是太喜欢了。 加入十年之约，认识更多更多的中文 Blogger。 嗯，就这样吧。太阳照常升起，又是新的一天。","link":"/articles/My-own-domain-karlbaey-top/"},{"title":"新评论系统上线！🚀（以及其他的技术更新）","text":"最近给自己的博客折腾了点新东西，还是很开心的。下面就把这些更新写在这篇博文里吧。 新评论系统 众所周知，我的评论系统最早用的是 utterances，但是体验并不好：评论一多起来，评论输入框就会出现在页面最下方。我本来想发 issue，但是发现已经有不少人反映过这个问题了 Place new comment box above comments #513： 然后发现 icarus 模板原生支持 giscus 评论系统，我一用就喜欢上了：评论框置顶、评论表态跟回复功能。这简直就是我见过最最理想的评论系统。这里有张效果图： 现在忙着给以前托管在 issues 的评论补档，不过还是很开心的。 RSS 订阅源和 follow.it 订阅 这两个技术性调整都是为了方便喜欢我博客的朋友们及时获取订阅的，具体操作见下面： ¶RSS 订阅源 关于 RSS 订阅源，参考这篇文章：《知道RSS的人越少，我就越希望它能被人知道！》——阿虚同学。 考虑到我一直积极维护的互联网精神（也就是自由、开放、合作、共享的精神），我还是给自己的博客开了 RSS 订阅源。你可以按我头像下的 符号或者这里来获得 RSS 订阅源。而关于如何使用本站的 RSS，请参考我的这篇博客。 ¶follow.it 订阅 相比起 RSS 订阅，follow.it 会方便许多。左侧有一个输入框： 只要输入你的电邮并且在你的收件箱里激活，就可以通过 follow.it 提供的订阅收取我的更新通知了！它与 RSS 订阅有相似之处，不同的是，RSS 订阅更简洁明了而 follow.it 只需要查收邮件。 萌国备案 其实这是很早之前的事了，有朋友推荐我去一些人多的地方混个脸熟，于是就找到了萌社区并且注册了备案，这是我在萌社区的个人资料。但愿能招揽些人来看我的网站吧。 话说有没有人注意到标题的 emoji 从烟花变成火箭了？","link":"/articles/New-commenting-system-and-other-updates/"},{"title":"第一篇博客","text":"不知道花了多少时间，终于把我的 GitHub 个人博客搭好了。 中间经历了 hexo 无法部署、断网等等困难。 现在可以写个人博客了，不用依赖新浪微博真是太好了。 GitHub项目地址➲ 本博客几乎全部的图片都由图床托管搭载在仓库中，所以要是崩了直接发邮件告诉博主就行。 这里放张博主的 GitHub 头像，算是博客之路的起点：","link":"/articles/my-first-blog/"},{"title":"评论系统上线！🎇","text":"提醒 这篇博客里叙述的东西已经不再适用于本站了，关于本站的评论系统等请看此处。 我在搭好自己的博客之后，决定给自己添加一个评论系统，bing 一番后选择了最时兴的 Gitalk。当时的我太单纯，不知道 Gitalk 的代理服务器被墙了，点我查看完整 issue。/(ㄒoㄒ)/~~ 本着有问题就解决问题的思想，我试了挂其他大佬的代理（HTTP 429：请求过多），自己在 Cloudflare 搭反向代理（截至本博客发布日期，Cloudflare 依然关闭免费反向代理服务。但我觉得我没找到的可能性大一点，因为我读不懂英文）。全部失败。 活不下去了，换一个评论吧。 然后换了 giscus，但我配置好才发现什么都不显示，配置又出问题了。最后才选用了现在的 utterances，弊端就是要求评论者要有 GitHub 账户，其他的话我用着还挺满意的。 如果有大佬愿意给我提供个 Gitalk 的代理我倒是很愿意换回来。 希望不要再出什么意料之外的错误了…… 目前已知的问题： 使用 utterances 做评论会使得评论框出现在评论区底部。","link":"/articles/commenting-system-launch/"}],"tags":[{"name":"GitHub","slug":"GitHub","link":"/tags/GitHub/"},{"name":"Guide","slug":"Guide","link":"/tags/Guide/"},{"name":"Reviews","slug":"Reviews","link":"/tags/Reviews/"},{"name":"Markdown","slug":"Markdown","link":"/tags/Markdown/"},{"name":"Nothing","slug":"Nothing","link":"/tags/Nothing/"},{"name":"physics","slug":"physics","link":"/tags/physics/"},{"name":"DailyLife","slug":"DailyLife","link":"/tags/DailyLife/"},{"name":"Past","slug":"Past","link":"/tags/Past/"},{"name":"Sadness","slug":"Sadness","link":"/tags/Sadness/"},{"name":"Minecraft","slug":"Minecraft","link":"/tags/Minecraft/"},{"name":"ANNOUNCEMENT","slug":"ANNOUNCEMENT","link":"/tags/ANNOUNCEMENT/"},{"name":"Original","slug":"Original","link":"/tags/Original/"},{"name":"Algos","slug":"Algos","link":"/tags/Algos/"},{"name":"Python","slug":"Python","link":"/tags/Python/"},{"name":"LeetCode","slug":"LeetCode","link":"/tags/LeetCode/"},{"name":"Files","slug":"Files","link":"/tags/Files/"},{"name":"Desktop","slug":"Desktop","link":"/tags/Desktop/"},{"name":"Lanzou","slug":"Lanzou","link":"/tags/Lanzou/"},{"name":"Milestone","slug":"Milestone","link":"/tags/Milestone/"}],"categories":[{"name":"Karlblogs","slug":"Karlblogs","link":"/categories/Karlblogs/"},{"name":"Tales","slug":"Tales","link":"/categories/Tales/"},{"name":"ANNOUNCEMENT","slug":"ANNOUNCEMENT","link":"/categories/ANNOUNCEMENT/"},{"name":"Algo","slug":"Karlblogs/Algo","link":"/categories/Karlblogs/Algo/"},{"name":"Tech","slug":"Tech","link":"/categories/Tech/"}],"pages":[{"title":"Karlblogs API 页面","text":"欢迎你来到本站的 API 页面！下面列出了本站使用的全部应用程序编程接口！ API 标识号 应用方法 使用例 lanzou 共有三种参数：url（必填）、type（选填）、pwd（如有） 例如，https://karlbaey.lanzoum.com/iht9v2hgsquf，密码:seeyou，它会下载 《See You Again》这首歌，应用到这个 API 上就是：https://api.karlbaey.top/lanzou/?url=https://karlbaey.lanzoum.com/iht9v2hgsquf&amp;type=down&amp;pwd=seeyou - - -","link":"/main/"},{"title":"关于本站","text":"1 欢迎你！ 欢迎你来到卡尔白的博客站！ 如你所见，karlbaey.top（下称本站）是卡尔白（en_US = Karlbaey），也就是我的个人博客网站。本站脱胎于真理博客版，随后慢慢来到了全球最大同性交友程序员交流网站 GitHub 上。我个人暂时没有写代码的需求，所以本站就来当作我记录生活的地方吧！ 若不做特殊说明，“我”“我本人”“卡尔”均指卡尔白。 2 关于本站 ¶2.1 这个网站是干什么的？ 用来写写日记，当然也不一定每天更新。如果你看了我写的东西，感觉到开心就足够了。有什么想对卡尔说的欢迎发 issue，写电邮到Karlbaey101@outlook.com也很不错！ ¶2.2 本站的协议和技术支持 本站的全部内容均遵循 CC BY-NC-SA 4.0 协议，保留所有权利。这也意味着，本站： ✓ 欢迎非商业性转载/二次创作。 ✓ 需保留完整署名与原文链接。 ✓ 禁止将内容用于商业用途。 选用了 GitHub Pages 搭配 Hexo 框架，以及建立在 icarus 主题上的 amazing 主题。使用静态博客站点完全是因为手头没有多余的钱购买 VPS 或者自建服务器，也因此与 Wordpress 无缘。 （目前已知的问题：使用 VPN 连接很可能导致托管在图床的图片无法加载） ¶2.3 版权归属 本站的 Favicon 与 Logo 均由我绘制，转载请标明出处。 本站的 Favicon 见下图： 本站的 Logo 见下二图： 本博客内，分类在： Karlblogs 下的文字内容均由我本人（Karlbaey101）创作。我拥有完全控制权。 Tales 下的内容与 Karlblogs 做同等处理。 Tech 下的内容是本站新技术内容（如评论系统）的新闻。 Reproduction 下的内容为转载，并且在醒目处标明出处。版权属于原作者。 Archived 下的内容为留档专用，不一定由我创作，但因为种种原因它们已经快消失了。版权属于原作者。与Archives存档区分。 待补充 本站的正式名称是：卡尔白的博客站。非正式名称包括但不限于：老卡尔的旧纸箱、Karlbaey’s Blogs、Karlblogs。但本站更常用“Karlblogs”这个称呼。 ¶2.4 相关法律法规及本站规定 如果您正访问、浏览、使用或进行任何与本站有关的活动，即代表您知晓并遵守： 中华人民共和国宪法法律法规条例、全国人民代表大会批准加入的国际法公约倡议、公序良俗//现代社会基本道德标准//普世价值观//社会主义核心价值观和本页面全部规定。如必要本站会协助有关部门进行合法工作。 也就是说：请勿直接或间接发表涉政，色情，人身攻击，黑灰产广告等公认无法在中国大陆通过互联网平台审核的内容，不得故意或者过失损害或弱化本网站的各类合法权利与利益，不将本网站以及与之相关的网络服务用作非法用途以及非正当用途，不干扰和扰乱本网站以及与之相关的网络服务。 本站点托管在 GitHub，非评论的文字及图片内容均托管在相应的 GitHub 仓库，我拥有使用权；评论均托管在本站唯一评论仓库，版权归评论编写者所有，但我保留删除不合本页规定评论的权利。 部分内容来源于互联网，出版物等。如无意中侵犯了哪个自然人，法人，非法人组织等民事法律主体的知识产权或相关权益，请携带权利证明，联系我进行删除等相关处理 (联系方式请详见网站上方)。 引用内容版权属于原作者，本站及其访问者均认可并尊重其版权。 本站并不储存任何数据，您可能需要向网络存储服务商提供版权侵犯通知。 需要注意的是，以下属于合法使用： 《中华人民共和国著作权法》规定的“合理使用”和“法定许可使用”。 《计算机软件保护条例》规定的“为了学习和研究软件内含的设计思想和原理，通过安装、显示、传输或者存储软件等方式使用软件的，可以不经软件著作权人许可，不向其支付报酬。” 符合原作者授权协议的使用或原作品已进入公共领域。 本站遵循 CC BY-NC-SA 4.0 协议，转载及引用时请附上作者和原文链接并标注及使用原授权协议，且请勿用于商业或非法目的，否则后果自负。 本站上的文章可能会包含嵌入的内容（如视频、图片、文章等）。阅读来自其他站点的嵌入内容的行为和您直接访问这些其他站点没有区别。 这些站点可能会收集关于您的数据、使用 cookies、嵌入额外的第三方跟踪程序及监视您与这些嵌入内容的交互，包括在您有这些站点的账户并登录了这些站点时，跟踪您与嵌入内容的交互。 3 常见问题解答 ¶Q3.1 我读完了，现在我能干什么？ A： 太多了。 你能读读我的博客，要是发现什么有趣的也可以联系我。 好像也不怎么多。 ¶Q3.2 卡尔，你写的挺不错的，我能给我的朋友家人们看看吗？ A： 当然可以，只要你遵照2 关于本站的全部内容就可以了。不过记得，不要因为观点不同就吵架。 ¶Q3.3 你的博客有友站吗？ A： 有的兄弟，有的，请点这里。 ¶Q3.4 我该怎样联系站长？ A： 分三种途径： 针对博客文字本身的疑问或见解，直接在对应的博客页发评论。评论服务由 giscus 提供。 如果对站点的 HTML 或是 JavaScript 代码等有建议，请到这里发 issue。在发 issue 前我非常建议你先读读其他朋友们发的 issue 并参考标签，这或许对你表达建议有些帮助。 想找卡尔聊天的可以直接加我的 QQ 2454161978 或者与我互发邮件 karlbaey101@outlook.com。 除此之外，我也建议你了解以下这些常用的电子邮箱账号： office@karlbaey.top ——本站专用收信箱（正式名称：Karlbox-in ），与发 issue 具有同等效力，我个人更推荐前者。与 Karlbot-info 相反，这个邮箱没有发信功能，因此送至这个信箱的邮件很可能没有回音，这也是我推荐发 issue 的理由。 不过虽然说是机器人可邮件都是我亲手写的😡 4 结语 好了，请开始你在本站的生涯吧！ 由卡尔白撰写，因为本站产生的纠纷以本页面为准。将会随时间更新。","link":"/about/"},{"title":"","text":"碎碎念 tips：github登录后按时间正序查看、可点赞加❤️、本插件地址…「+99次查看」 说实话不知道写点什么好，毕竟我已经被 Gitalk 吓怕了，等我什么时候玩利索了再来修这个页面吧。 2025.04.11 改：修了，但是不会做反向代理，就这样吧。 123456789101112131415&lt;script&gt; $.getScript(&quot;/js/gitalk_self.min.js&quot;, function () { var gitalk = new Gitalk({ clientID: '46a9f3481b46ea0129d8', clientSecret: '79c7c9cb847e141757d7864453bcbf89f0655b24', id: '666666', repo: 'issue_database', owner: 'removeif', admin: &quot;removeif&quot;, createIssueManually: true, distractionFreeMode: false }); gitalk.render('comment-container1'); });&lt;/script&gt;","link":"/chatters/"},{"title":"本站友情链接","text":"申请友链须知 申请请提供：站点名称、站点链接、站点描述、logo或头像（不要设置防盗链）。 排名不分先后，刷新后重排，更新信息后请留言告知。会定期清理很久很久不更新的、不符合要求的友链。本站不存储友链图片，如果友链图片换了无法更新。图片裂了的会替换成默认图，需要更换的请留言告知。 如果您也想加入本页，请在评论区留言并且附上您网站的URL和介绍图（宽与高的比应尽可能接近1）。 本站友链信息如下，申请友链前请先添加本站信息： 123456789网站名：老卡尔的旧纸箱网站URL：Karlbaey.top简介：这里存着卡尔白的过去、现在和未来站长：Karlbaey101站长头像：https://karlbaey.top/images/Fundamental/avatar.png本站 favicon：https://karlbaey.top/images/Fundamental/Favicon.png本站 logo（1024×512）：https://karlbaey.top/images/Fundamental/KarlblogsLogo1.png 以后会不断更新。 《冯摹兰亭序》卷 加载中，稍等几秒...","link":"/friends/"},{"title":"","text":"来而不往非礼也。 有什么想说的，都写在下面吧。卡尔会很高兴能回复你的。","link":"/message/"},{"title":"","text":"window.location.href = \"https://api.hanximeng.com/lanzou/?url=https://karlbaey.lanpw.com/iziv32p9l3sj&type=down\"; 感谢你的支持！Typora 的下载马上开始…… 如果下载不开始，请按这里","link":"/special/Download-Typora"},{"title":"","text":"window.location.href = \"https://nekoa.day\"; 如果不跳转，请按这里","link":"/nkd/"},{"title":"关于我","text":"你好，我是@卡尔白！也就是这个网站的站长！本文有一个更正式的版本，请看这里。 我吗？其实还是有很多想说的吧。 ¶名字的由来 Karlbaey （跟我一起读：/'kɑ:rlbɑ:ɪ/），中文音译为卡尔白，分成两部分：","link":"/about/me/"}]}